Map hadithsWithExplanation = {
  "hadith": [
    {
      "arabicText":
          """رضي الله عنه، قال‏:‏ سمعت رسول الله صلى الله عليه وسلم يقول‏:‏ ‏ "‏ إنما الأعمال بالنيات، وإنما لكل امرىء ما نوى فمن كانت هجرته إلى الله ورسوله فهجرته إلى الله ورسوله، ومن كانت هجرته لدنيا يصيبها، أو امرأة ينكحها فهجرته إلى ما هاجر إليه‏"‏)(متفق عليه)""",
      "arabicExplanation":
          """هذا الحديثُ العَظيمُ قاعدةٌ مِن قواعدِ الإسلامِ، وأصلٌ مِن أُصولِ الشَّريعةِ، حتَّى قِيلَ فيه: إنَّه ثُلثُ العِلمِ، حيثُ قال فيه صلَّى اللهُ عليه وسلَّمَ: «الأعمالُ بِالنِّيَّةِ»، فلا تصِحُّ جَميعُ العِباداتِ الشَّرعيَّةِ إلَّا بوُجودِ النِّيَّةِ فيها، «ولِكلِّ امرِئٍ ما نَوى»، فإنَّما يَعودُ على المسلمِ مِن عَملِه ما قصَدَه منه، وهذا الحُكمُ عامٌّ في جَميعِ الأعمالِ مِنَ العباداتِ والمعاملاتِ والأعمالِ العاديَّةِ، فمَنْ قصَدَ بعَملِه مَنفعةً دُنيويَّةً لم يَنلْ إلَّا تلكَ المَنفعةَ ولو كان عِبادةً، فَلا ثَوابَ له عليها، ومَن قصَدَ بعَملِه التَّقرُّبَ إلى اللهِ تعالَى وابتغاءَ مَرضاتِه، نالَ مِن عَملِه المَثوبةَ والأجرَ ولو كان عمَلًا عاديًّا، كالأكلِ والشُّربِ، ثُمَّ ضرَبَ صلَّى اللهُ عليه وسلَّمَ الأمثلةَ العمليَّةَ لِبيانِ تَأثيرِ النِّيَّاتِ في الأعمالِ فبيَّنَ أنَّ مَن قصَدَ بِهجرتِه امتثالَ أمْرِ ربِّهِ، وابتغاءَ مَرضاتِه، والفرارَ بِدِينِه مِنَ الفتنِ؛ فهِجرتُه هِجرةٌ شرعيَّةٌ مَقبولةٌ عندَ اللهِ تعالَى ويُثابُ عليها لصِدقِ نيِّتِه، وأنَّ مَن قصَدَ بِهِجرتِه مَنفعةً دُنيويَّةً وغرَضًا شخصيًّا، مِن مالٍ، أو تجارةٍ، أو زَوجةٍ حَسناءَ؛ «فهِجرتُه إلى ما هاجَرَ إليه»، فلا يَنالُ مِن هِجرتِه إلَّا تلك المنفعةَ الَّتي نَواها، ولا نَصيبَ له مِنَ الأجرِ والثَّوابِ. """,
    },
    {
      "arabicText": """
عن أم المؤمنين أم عبد الله عائشة رضي الله عنها قالت‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏"‏يغزو جيش الكعبة فإذا كانوا ببيداء من الأرض يخسف بأولهم وآخرهم‏"‏‏.‏ قالت‏:‏ قلت‏:‏ يارسول الله، كيف يخسف بأولهم وآخرهم وفيهم أسواقهم ومن ليس منهم‏!‏‏؟‏ قال‏:‏ ‏"‏يخسف بأولهم وآخرهم، ثم يبعثون على نياتهم‏"‏ ‏(‏‏(‏متفق عليه‏.‏ هذا لفظ البخاري‏)‏‏)‏‏.‏
                  """,
      "arabicExplanation": """
لقدْ جَعَل اللهُ عزَّ وجلَّ لمَكَّةَ المُكرَّمةِ والمدينةِ المُنوَّرةِ مَنزِلةً تَفُوقُ غيرَهما مِن الأماكنِ والمَنازلِ، وعجَّلَ العُقوبةَ لمَن أرادَهُما بسُوءٍ.
وفي هذا الحَديثِ يُخبِرُ النَّبيُّ صلَّى اللهُ عليه وسلَّمَ أنَّه في آخِرِ الزَّمانِ يَقصِدُ جَيشٌ عَظيمٌ الكَعْبةَ لتَخريبِها، حتَّى إذا كانَوا في بَيْداءَ مِن الأرضِ -أي: بأرْضٍ مُتَّسعةٍ مَلْسَاءَ لا شَيءَ بِها، ويَعني مَوضعًا مِن الصَّحارَى فيما بيْن مكَّةَ والمدينةِ- خَسَفَ اللهُ الأرضَ مِن تَحتِهم، فوَقَعوا فيها مِن أوَّلِهمْ إلى آخِرِهمْ، فَعمَّهُم كلَّهُم بالخسْفِ، وزاد مُسلمٌ في رِوايةٍ: «فلا يَبْقى إلَّا الشَّريدُ الَّذي يُخبِرُ عنهم». فَتَساءلتْ أمُّ المُؤمنينَ عائشةُ رَضيَ اللهُ عنها: كيفَ يَعُمُّ العِقابُ الجميعَ وفيهم أهْلُ سُوقِهم ممَّن يَبِيعون ويَشترُون، ومَن ليس منْهم ممَّن صادَفَ وُجودُه معهم عندَ وُقوعِ الخسْفِ، ولمْ يَنوِ غَزْوَ الكَعبةِ، ولا التَّعرُّضَ لها؟ فاستَشْكَلَت أمُّ المؤمنينَ وُقوعَ العذابِ على مَن لا إرادةَ له في القتالِ الَّذي هو سَببُ العُقوبةِ، فبَيَّن صلَّى اللهُ عليه وسلَّمَ أنَّ الخَسْفَ يَعُمُّهم، ثمَّ يَبعَثُهم اللهُ عزَّ وجلَّ يومَ القِيامةِ، فيُحاسَبُ كلٌّ منهم بحسَبِ نِيَّتِه وقصْدِه؛ إنْ خَيرًا فخَيرٌ، وإنْ شَرًّا فشَرٌّ.
وفي الحَديثِ: أهميَّةُ النِّيَّةِ وأثَرُها على العَبدِ.
وفيه: عِنايةُ اللهِ تعالَى بالبَيْتِ الحَرامِ.
وفيه: أنَّ مَن كَثَّرَ سَوادَ قَومٍ جَرَى عليه حُكْمُهم في ظاهِرِ عُقوباتِ الدُّنيا. 
                  """,
    },
    {
      "arabicText": """
عن عائشة رضي الله عنها قالت قال النبي صلى الله عليه وسلم‏:‏ ‏ "‏ لا هجرة بعد الفتح، ولكن جهاد ونية، وإذا استنفرتم فانفروا‏"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏
                  """,
      "arabicExplanation": """
كانتِ الهِجرةُ مِن مَكَّةَ إلى المدينةِ واجبةً على المؤمنينَ في بِدايةِ الإسلامِ؛ نُصرةً للإسلامِ، وحِمايةً للمسلمين، فَهاجَرَ النبيُّ صلَّى اللهُ عليه وسلَّمَ، وهاجَرَ أصحابُه رِضوانُ الله عليهم.
وفي هذا الحَديثِ يَرْوي عبدُ اللهِ بنُ عبَّاسٍ رَضيَ اللهُ عنهما أنَّ النبيَّ صلَّى اللهُ عليه وسلَّمَ أخبَرَ يومَ فتْحِ مَكَّةَ -وكان في العامِ الثامِن مِن الهجرةِ- أنّه لا هِجرةَ مِن مكَّةَ إلى المدينةِ بعْدَ فتْحِ مكَّةَ؛ وذلك لأنَّ المؤمنينَ في بِدايةِ أمْرِهم كانوا يَفِرُّون مِنَ اضطهادِ الكفَّارِ وإيذائِهم؛ مَخافةَ أنْ يُفتَنُوا في دِينِهم ويَرجِعوا إلى الكُفرِ، أمَّا بعْدَ فتْحِ مَكَّةَ وظُهورِ الإسلامِ، فلمْ يَعُدْ هناك سَببٌ لِلهجرةِ؛ إذ صارَ المؤمنُ آمنًا على نفْسِه، يَعبُدُ رَبَّه كيف شاءَ، ومتى شاءَ، وأينَ شاءَ، فحُكْمُ الهِجرةِ باقٍ في حقِّ مَن أسلَمَ في دارِ الكفْرِ، ولم يَأمَنْ على دِينِه، وقدَرَ على الخُروجِ منها. ثمَّ قال صلَّى اللهُ عليه وسلَّمَ: «ولكِنْ جِهادٌ ونيَّةٌ»، أي: ولكنْ لكمْ جِهادٌ في الكُفَّارِ، ونِيَّةٌ صالحةٌ في الخيرِ تُحصِّلون بهما الفَضائلَ التي في معْنى الهِجرةِ التي كانتْ مَفروضةً لمُفارَقةِ الفَريقِ الباطِلِ فلا يُكثَّرُ سَوادُهم، ولإعلاءِ كَلمةِ اللهِ وإظهارِ دِينِه. وهذه الجُملةُ تَضمَّنُ بِشارةً مِن النبيِّ صلَّى اللهُ عليه وسلَّمَ بأنَّ مكَةَ سَتَستمِرُّ دارَ إسلامٍ أبدًا؛ لأنَّه نفَى أنْ يكونَ هناك هِجرةٌ بعْدَ فَتْحِها، وهذا يَدُلُّ على أنَّها لنْ تَعودَ دارَ كُفرٍ مرَّةً أُخرى؛ إذ الهِجرةُ تكونُ مِن دارِ الكُفرِ إلى دارِ الإسلامِ.
ثمَّ قال صلَّى اللهُ عليه وسلَّمَ: «وإذا استُنفِرْتُم فانفِروا»، أي: إذا دَعاكم الإمامُ إلى غَزوٍ لِقتالِ الكفَّارِ، فأَجِيبوه واخْرُجوا معه.
ثمَّ أخبَرَ صلَّى اللهُ عليه وسلَّمَ أنَّ مَكَّةَ المُكرَّمةَ حرَّمَها اللهُ يومَ خلَقَ السَّمواتِ والأرضَ؛ فإنَّ تَحريمَها أمرٌ قَديمٌ، وشَريعةٌ سالفةٌ، ليس ممَّا أحْدَثه النبيُّ صلَّى اللهُ عليه وسلَّمَ أو اختُصَّ بشَرْعِه. ويَحتمِلُ أنْ يكونَ المعْنى: إنَّما خلَقَ أرضَ مكَّةَ حِينَ خلَقَها مُحرَّمةً. وهذه الحُرمةُ مُستمِرةٌ إلى يَومِ القِيامةِ، باقيةٌ أبديَّةٌ. وفي الصَّحيحَينِ مِن حَديثِ عَبدِ اللهِ بنِ زَيدٍ رَضيَ اللهُ عنه: أنَّ النبيَّ صلَّى اللهُ عليه وسلَّمَ قال: «إنَّ إبراهيمَ حرَّمَ مَكَّةَ ودَعَا لأهلِها»، ويُمكِنُ الجمْعُ بيْن الحَديثينِ بأنَّ تَحريمَها كان ثابتًا مِن يومِ خلَق اللهُ السَّمواتِ والأرضَ، ثُمَّ خَفِيَ تَحريمُها واستَمَرَّ خَفاؤُه إلى زمَنِ إبراهيمَ عليه السَّلامُ، فأَظْهَره وأشاعَه لا أنَّه ابتَدَأَه. أو أُسْنِدَ التَّحريمُ إلى إبراهيمَ عليه السَّلامُ مِن حيثُ إنَّه مُبلِّغُه؛ فإنَّ الحاكمَ بالشَّرائعِ والأحكامِ كلِّها هو اللهُ تعالَى، والأنبياءُ يُبلِّغونها، ثمَّ إنَّها كما تُضافُ إلى اللهِ تعالَى مِن حيث إنَّه الحاكمُ بها، تُضافُ إلى الرُّسلِ؛ لأنَّها تُسمَعُ منْهم وتُبيَّنُ على لِسانِهم.
ثمَّ أخبَرَ صلَّى اللهُ عليه وسلَّمَ أنَّه لَمْ يَحِلَّ القِتَالُ في البَلدِ الحرامِ لأحَدٍ قَبْلَه، وإنَّما خَصَّه اللهُ عزَّ وجلَّ بذلك، ولَمْ يَحِلَّ له إلَّا سَاعَةً مِن نَهَارٍ، ثُمَّ عادَتْ حُرمتُه كما كانتْ، فَهو حَرَامٌ بحُرْمَةِ اللهِ إلى يَومِ القِيَامةِ. وقد جاءَ في الصَّحيحَينِ بَيانُ سَببِ قولِ النبيِّ صلَّى اللهُ عليه وسلَّمَ ذلِك؛ وهو: أنَّ «خُزاعَةَ قَتَلوا رجُلًا مِن بَنِي لَيثٍ عامَ فتْحِ مَكَّةَ بقَتيلٍ منهم قَتَلوه، فأُخْبِرَ بذلك رسولُ اللهِ صلَّى اللهُ عليه وسلَّمَ، فرَكِبَ راحلتَه، فخَطَب، فقال: إنَّ اللهَ عزَّ وجلَّ حبَسَ عن مَكَّةَ الفِيلَ، وسَلَّطَ عليها رَسولَه والمؤمنِين»، أي: منَعَها وحَفِظَها مِن فِيلِ أَبْرَهةَ الحَبشيِّ الذي أتَى به لهدْمِ الكَعبةِ، ومَكَّنَ رسولَه مُحمَّدًا صلَّى اللهُ عليه وسلَّمَ وأصحابَه رَضيَ اللهُ عنهم مِن وِلايتِها والتَّغلُّبِ على أهلِها.
ثمَّ بيَّن صلَّى اللهُ عليه وسلَّمَ حُرمةَ هذا البَلدِ بأنَّه «لا يُعضَدُ شَوكُه»، أي: لا يُقطَعُ، وذِكرُ الشَّوكِ دَليلٌ على أنَّ غيرَه ممَّا لا يُؤْذي بالأَولى، ويُخصَّصُ بالمُؤذي، فيَجوزُ قطْعُه قِياسًا على حلِّ قتْلِ الفواسقِ الخَمْسِ في الحرَمِ بجامعِ الإيذاءِ. وفي روايةِ الصَّحيحَينِ: «ولا يُعضَدُ شَجرُها»، فلا يُكسَرُ ولا يُقطَعُ، «ولا يُنفَّرُ صَيدُه»، فلا يُزعَجُ مِن مكانِه ولا يَحِلُّ صَيدُه، «ولا يَلتَقِطُ لُقَطتُه إلَّا مَن عرَّفها»، فلا يُستفادُ مِن لُقَطةِ مَكَّةَ المفقودة من أي شخص كما يُستفادُ منها في الأماكنِ الأخرى غيرِ مَكَّةَ، إلَّا لِمَن يُعرِّفُها ويُنادي عليها، حتَّى يَجِيءَ صاحبُها، ولا يَأخذُها للتمليكِ، واللُّقَطةُ: هي ما يَجِدُه الإنسانُ مِن مالٍ ضائِعٍ في الطريقِ لا يُعرَفُ له صاحبٌ، «ولا يُختلَى خَلاه»، فلا يُقطَعُ نَباتُه، لا الشَّجرُ الكِبارُ ولا الشجرُ الصِّغارُ، أو النباتُ الصَّغيرُ الذي هو الحشيشُ الرَّطبُ.
فأرادَ العبَّاسُ رَضيَ اللهُ عنه أنْ يُرخِّصَ لهم النبيُّ صلَّى اللهُ عليه وسلَّمَ في نَباتِ الإذخرِ، وهو: نَباتٌ عُشبيٌّ عَريضُ الأوراقِ مِن فَصيلةِ النِّجيليَّاتِ، له رائحةٌ لَيمونيَّةٌ عَطِرةٌ، أزهارُه تُستعمَلُ مَنقوعةً كالشَّاي؛ «فإنَّه لِقَيْنِهم»، والقَيْنُ: هو الحَدَّادُ؛ فإنَّه يَستعمِلُ الإذخرَ في إيقادِ النارِ، وهو نافعٌ لهم في حَرْقِه بدَلًا عن الحطَبِ، ويُستخدِمُه الناسُ في بُيوتِهم لسَقْفِها، وكذا لسَقْفِ قُبورِهم، والمعنى: لبُيوتِهم حالَ حياتِهم ومَماتِهم، فأجابَه النبيُّ صلَّى اللهُ عليه وسلَّمَ لذلك، ورخَّصَ لهم فيه.
وفي الحَديثِ: تَعظيمُ اللهِ تعالَى لمكَّةَ المكرَّمةِ، والنَّهيُ عن القِتالِ بها.
وفيه: أنَّ مَكَّةَ فُتِحتْ عَنْوةً، وليس صُلْحًا. 
                  """,
    },
    {
      "arabicText": """
عن أبي عبد الله جابر بن عبد الله الأنصارى رضي الله عنهما قال‏:‏ كنا مع النبي صلى الله عليه وسلم في غزاةٍ فقال‏:‏ ‏"‏إن بالمدينة لرجالاً ماسرتم مسيراً، ولا قطعتم وادياً إلا كانوا معكم حبسهم المرض‏"‏ وفى رواية‏:‏ ‏"‏إلا شاركوكم في الأجر‏"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏

‏(‏‏(‏ورواه البخاري‏)‏‏)‏ عن أنس رضي الله عنه قال‏:‏ رجعنا من غزوة تبوك مع النبي صلى الله عليه وسلم فقال‏:‏ ‏"‏ إن أقواماً خلفنا بالمدينة ما سلكنا شعباً ولا وادياً إلا وهم معنا، حبسهم العذر‏"‏‏.‏
                  """,
      "arabicExplanation": """
كان النَّبيُّ صلَّى اللهُ عليه وسلَّمَ يَحفَظُ لأصحابِه فَضْلَ بعضِهم على بَعضٍ، ويُظهِرُ فيهم مَناقِبَهم، ويَعذِرُ مَريضَهم، ويُعِينُ ضَعيفَهم.
وفي هذا الحديثِ يُخبِرُ جابرُ بنُ عَبْدِ اللهِ رَضيَ اللهُ عنهما أَنَّهم كانوا مع النَّبيِّ صلَّى اللهُ عليه وسلَّمَ في غَزاةٍ، وهِيَ غَزوةُ تَبوكَ، كما وقَعَ عندَ البُخاريِّ، وقد كانت غَزوةً شَديدةً قطَعَ فيها الصَّحابةُ مَسافاتٍ شاسعةً في الحَرِّ الشَّديدِ نُصرةً لدِينِ اللهِ، فقال صلَّى اللهُ عليه وسلَّمَ لهم: «إنَّ بالمدينةِ لَرِجالًا» ما شارَكوا في الغزوِ، ولا خَرَجوا للجهادِ، ولكنْ «ما سِرتُم مَسيرًا» أي: ولا مَشَيتُم مَسافةً أو طَريقًا، «ولا قَطعتُم وَاديًا» وهو الأرضُ المنخفِضةُ تَقَعُ بيْنَ الجِبالِ؛ «إلَّا كانوا مَعَكم» أي: شارَكوكم في الأَجْرِ والثَّوابِ، كما في الرِّوايةِ الأُخْرى: «شَرِكوكم في الأَجْرِ»؛ وذلك أنَّ عدَمَ خُروجِهم كان لِأجلِ ما بهِم مِن مرَضٍ مَنَعَهم مِن استطاعةِ السَّفرِ، فَضْلًا عن أنْ يُشارِكوهم في الحربِ والقتالِ، وفي حُكمِهم الفقراءُ والضُّعفاءُ الَّذين لم يَقدِروا على الغَزوِ لضَعفِهم، أو لعَدمِ وُجودِ زادٍ لهم أو دابَّةٍ يَركَبونَها، فكان لهم الأجرُ مِثلَكم؛ لنِيَّتِهم الصَّالحةِ، وهذا تَمييزٌ لهم عن المنافِقين الَّذين يَتخلَّفون عن غَزواتِ النَّبيِّ صلَّى اللهُ عليه وسلَّمَ بأعذارٍ غَيرِ حَقيقيَّةٍ خَوفًا مِن الجهادِ والقتالِ، واستِثْقالًا لِمَشقَّةِ وعَناءِ السَّفرِ.
وفي الحديثِ: فَضلُ النِّيَّةِ في الخَيرِ، وأنَّ الإنسانَ إذا نوى العملَ الصَّالحَ ولكنَّه لم يَستطعِ القيامَ به لعُذْرٍ؛ فإنَّه يُكتَبُ له أَجْرُ ما نوَى. 
                  """,
    },
    {
      "arabicText": """
وعن أبي يزيد معن بن يزيد بن الأخنس رضي الله عنهم، وهو وأبوه وجده صحابيون، قال‏:‏ كان أبي يزيد أخرج دنانير يتصدق بها فوضعها عند رجل في المسجد فجئت فأخذتها فأتيته بها، فقال‏:‏ والله ما إياك أردت، فخاصمته إلى رسول الله صلى الله عليه وسلم فقال‏:‏ ‏ "‏ لك ما نويت يا يزيد، ولك ما أخذت يامعن‏"‏ ‏(‏‏(‏رواه البخاري‏)‏‏)
                  """,
      "arabicExplanation": """
المُبايَعةُ هي المعاقَدةُ والمعاهَدةُ، وسُمِّيت بذلك تَشبيهًا بالمُعاوَضةِ الماليَّةِ، كأنَّ كلَّ واحدٍ منهما يَبيعُ ما عِندَه مِن صاحبِه؛ فمِن طرَفِ رَسولِ اللهِ صلَّى اللهُ عليه وسلَّمَ: وَعْدٌ بالثَّوابِ، ومِن طَرَفِهم: الْتزامُ الطَّاعةِ.
وفي هذا الحَديثِ يَحكي مَعْنُ بنُ يَزيدَ السُّلَميُّ رَضيَ اللهُ عنهما أنَّه وأباه وجَدَّه الأخْنَسَ بنَ حبيبٍ السُّلَميَّ رَضيَ اللهُ عنه بايَعوا رسولَ الله صلَّى اللهُ عليه وسلَّمَ، وخطَب له النبيُّ صلَّى اللهُ عليه وسلَّمَ امرأةً، وطلَبَ مِن وليِّ المرأةِ أن يُزَوِّجَه، فزَوَّجه إيَّاها، ويَحكي أنَّ أباه أخرَج صدقةً فوضَعها عندَ رجُلٍ في المسجِدِ؛ لِيَصرِفَها لِمَن يَستحِقُّ الصَّدقةَ، فذَهَب مَعْنٌ فأخَذها، وأخبَر أباه بذلك، فأخبَره أبوه أنَّه ما قصَدَه في إعطائِه هذه الصَّدقةَ، قيل: المرادُ بها صدَقةُ التطَوُّعِ، وليس زَكاةَ المالِ، فتخاصَما إلى النبيِّ صلَّى اللهُ عليه وسلَّمَ، فحَكَمَ النبيُّ صلَّى اللهُ عليه وسلَّمَ بيْنَهما أنَّ لِيَزيدَ ما نَوى من إعطاءِ صدَقتِه، وأنَّ لِمَعنٍ ما أخَذَ؛ لأنَّه فقيرٌ، ودخَل في عُمومِ الفُقراءِ المأْذونِ للوكيلِ في الصَّرفِ إليهم.
وفي الحديثِ: أنَّ للمتَصَدِّقِ أجْرَ ما نَواه، سواءٌ صادَف المستحِقَّ أو لا.
وفيه: أنَّ للابْنِ أن يُخاصِمَ أباه، وليس بعُقوقٍ إذا كان ذلك في حَقٍّ.
وفيه: مشروعيَّةُ التَّوكيلِ في الصدَقةِ. 
                  """,
    },
    {
      "arabicText": """
عن أبي إسحاق سعد بن أبي وقاص مالك بن أهيب بن عبد مناف بن زهرة بن كلاب بن مرة بن كعب بن لؤى القرش الزهرى رضي الله عنه، أحد العشرة المشهود لهم بالجنة، رضي الله عنهم، قال‏:‏ ‏ "‏ جاءنى رسول الله صلى الله عليه وسلم يعودنى عام حجة الوداع من وجع اشتد بى فقلت‏:‏ يارسول الله إني قد بلغ بى من الوجع ما ترى، وأنا ذو مال ولا يرثنى إلا ابنة لي، أفاتصدق بثلثى ما لي‏؟‏ قال‏:‏ لا، قلت‏:‏ فالشطر يارسول الله‏؟‏ فقال‏:‏ لا، قلت‏:‏ فالثلث يا رسول الله‏؟‏ قال الثلث والثلث كثير- أو كبير- إنك أن تذر ورثتك أغنياء خير من أن تذرهم عالة يتكففون الناس، وإنك لن تنفق نفقة تبتغى بها وجه الله إلا أجرت عليها حتى ما تجعل في فيّ امرأتك قال‏:‏ فقلت‏:‏ يارسول الله أخلف بعد أصحابي‏؟‏ قال‏:‏ إنك لن تخلف فتعمل عملا تبتغي بهوجه الله إلا ازددت به درجة ورفعةً، ولعلك أن تخلف حتى ينتفع بك أقوام ويضرّ بك آخرون‏.‏ اللهم امض لآصحابى هجرتهم، ولا تردهم على أعقابهم، لكن البائس سعد بن خولة‏"‏ يرثى له رسول الله صلى الله عليه وسلم أن مات بمكة‏.‏‏(‏‏(‏متفق عليه‏)‏‏)
                  """,
      "arabicExplanation": """
العادةُ الَّتي اعْتادَها الإنْسانُ في الحَياةِ، تَتحَوَّلُ بالنِّيَّةِ الصَّالحةِ إلى عِبادةٍ يُؤجَرُ عليها الإنْسانُ؛ فيَنْبَغي للعاقلِ أنْ يُصحِّحَ نيِّتَه دَومًا، وألَّا يَتحرَّكَ حرَكةً إلَّا ويَبْتَغي بها وَجْهَ اللهِ تعالَى.
وفي هذا الحَديثِ يَحْكي سَعدُ بنُ أبي وقَّاصٍ رَضيَ اللهُ عنه، أنَّ النَّبيَّ صلَّى اللهُ عليه وسلَّمَ زارَه عامَ حَجَّةِ الوَداعِ سَنةَ عَشْرٍ مِنَ الهِجْرةِ، مِن وجَعٍ كان بِه قارَبَ بسَببِه على المَوتِ، وكان مَوضِعَ مَرضِه بمكَّةَ، وكان سَعدٌ رَضيَ اللهُ عنه يَكرَهُ أنْ يَموتَ بالأرضِ الَّتي هاجَرَ منها، كما صرَّحَت رِوايةُ مُسلمٍ: «قدْ خَشِيتُ أنْ أموتَ بالأرضِ الَّتي هاجَرْتُ منها».
فذكَرَ سَعدٌ رَضيَ اللهُ عنه لرَسولِ اللهِ صلَّى اللهُ عليه وسلَّمَ أنَّه صاحِبُ مالٍ، ولا يَرِثُه سِوى ابنةٍ واحِدةٍ -وكان اسمُها عائشةَ-، ومَعنى ذلك: أنَّه لا يَرِثُني مِن الولَدِ، أو مِن خَواصِّ الوَرَثةِ، أو مِنَ النِّساءِ؛ وإلَّا فقدْ كان لسَعدٍ عَصَباتٌ؛ لأنَّه مِن بَني زُهْرةَ، وكانوا كَثيرًا، وقيلَ: مَعْناه: لا يَرِثُني مِن أصْحابِ الفُروضِ، أو خصَّها بالذِّكرِ على تَقديرِ: لا يَرِثُني ممَّن أخافُ عليه الضَّياعَ والعَجزَ إلَّا هي، أو ظنَّ أنَّها تَرِثُ جَميعَ المالِ، أوِ استَكثَرَ لها نِصفَ التَّرِكةِ، فسَأَلَ النَّبيَّ صلَّى اللهُ عليه وسلَّمَ أنْ يَتصدَّقَ بثُلُثِي مالِه، فأجابَه صلَّى اللهُ عليه وسلَّمَ بألَّا يَفعَلَ ذلك، فسَأَلَ رَسولَ اللهِ صلَّى اللهُ عليه وسلَّمَ أنْ يَتصدَّقَ بنِصفِ مالِه، فنَهاهُ صلَّى اللهُ عليه وسلَّمَ عن ذلك أيضًا، ووجَّهَه صلَّى اللهُ عليه وسلَّمَ بأنْ يتَصَدَّقَ بالثُّلُثِ، وأخْبَره أنَّه كَثيرٌ أيضًا؛ تَرْغيبًا مِنه صلَّى اللهُ عليه وسلَّمَ لسَعدٍ أنْ يُقلِّلَ عنِ الثُّلُثِ.
ثمَّ بيَّنَ له النَّبيُّ صلَّى اللهُ عليه وسلَّمَ أنَّ الأفضَلَ له أنْ يَترُكَ وَرَثتَه أغْنياءَ، فيكونُ هذا المالُ سَببًا في إغْناءِ الوَرَثةِ؛ فهو خَيرٌ مِن أنْ يَترُكَهم فُقَراءَ «يَتكَفَّفونَ النَّاسَ في أيْدِيهم»، أي: يَسْألونَهم بأكُفِّهم بأنْ يَبْسُطوها للسُّؤالِ، أو يَسْألونَ ما يَكُفُّ عنهمُ الجوعَ.
وأخْبَرَه صلَّى اللهُ عليه وسلَّمَ أنَّه إنْ عاشَ فما أنْفَقَه مِن نَفَقةٍ ابتِغاءَ وَجهِ اللهِ، فإنَّها صَدَقةٌ، فالأجْرُ حاصِلٌ له حيًّا وميِّتًا، حتَّى اللُّقمةُ تَرفَعُها إلى فَمِ امْرأتِكَ، وهذا مُبالَغةٌ في بَيانِ أوجُهِ الإنْفاقِ الَّتي يُثابُ ويُؤجَرُ عليها الإنْسانُ، وأنَّها ليستْ قاصِرةً على المالِ؛ لأنَّ زَوجةَ الإنْسانِ هي مِن أخصِّ حُظوظِه الدُّنْيويَّةِ، وشَهَواتِه، ومَلاذِّه المُباحةِ، وإذا ثبَتَ الأجرُ في هذا، ففيما يُرادُ به وَجْهُ اللهِ فقطْ أحْرى. فسَألَ سَعدٌ رَضيَ اللهُ عنه رَسولَ اللهِ صلَّى اللهُ عليه وسلَّمَ: يا رَسولَ اللهِ، أُخَلَّفُ بعدَ أصْحابي بمكَّةَ أو في الدُّنْيا؟ فأجابَه صلَّى اللهُ عليه وسلَّمَ: إنَّكَ لن تُخَلَّفَ -يَعني: لنْ تَبْقى- فتَعمَلَ عَمَلًا صالِحًا تَطلُبُ بِه وَجهَ اللهِ عَزَّ وجَلَّ؛ إلَّا ازْدَدْتَ بالعَمَلِ الصَّالِحِ دَرَجةً ورِفْعةً، ولعَلَّكَ تُخَلَّفُ بأنْ يَطولَ عُمرُكَ حتَّى يَنتَفِعَ بكَ أقْوامٌ منَ المُسلِمينَ بما يَفتَحُه اللهُ عَزَّ وجَلَّ على يدَيْكَ مِن بِلادِ الشِّركِ، ويَأخُذُه المُسلِمونَ منَ الغَنائمِ، ويُضَرُّ بكَ آخَرونَ مِن المُشرِكينَ الهالِكينَ على يدَيْكَ وجُنودِكَ، وكذا كان؛ فإنَّه رَضيَ اللهُ عنه شُفيَ مِن مَرضِه، ولم يُقِمْ بمكَّةَ، وعاش أكثَرَ مِن أرْبَعينَ سَنةً بعْدَها، ووَليَ العِراقَ، وفتَحَها اللهُ عَزَّ وجَلَّ على يَدَيْه، فأسلَمَ على يدَيْهِ خَلقٌ كَثيرٌ، فنفَعَهمُ اللهُ عَزَّ وجَلَّ به، وقتَل وأسَرَ منَ الكُفَّارِ كَثيرًا، فاستَضَرُّوا به، وذلك مِن جُملةِ أعْلامِ نُبوَّتِه صلَّى اللهُ عليه وسلَّمَ.
ثمَّ دَعَا النَّبيُّ صلَّى اللهُ عليه وسلَّمَ رَبَّه أنْ يُمضيَ ويُتمِّمَ لأصْحابِه صلَّى اللهُ عليه وسلَّمَ هِجْرتَهم، وألَّا يرُدَّهم على أعْقابِهم بتَرْكِ هِجْرتِهم، ورُجوعِهم عنِ استِقامَتِهم، وكان رَسولُ اللهِ صلَّى اللهُ عليه وسلَّمَ يَكرَهُ لمَن هاجَرَ مِن مكَّةَ أنْ يَرجِعَ إليها، أو يُقيمَ بها أكثَرَ مِن انْقِضاءِ نُسُكِه.
وقولُه صلَّى اللهُ عليه وسلَّمَ: «ولكِنِ البائِسُ سَعدُ ابنُ خَوْلةَ» رَضيَ اللهُ عنه؛ أنْ توفِّيَ بمكَّةَ: والبائسُ هو الَّذي عليه أثَرُ البُؤْسِ، وهو شِدَّةُ الفَقرِ والحاجةِ، وقولُه: «يَرْثي له»، أي: يتَحَزَّنُ ويتَوَجَّعُ له صلَّى اللهُ عليه وسلَّمَ؛ لأجْلِ وَفاتِه بمكَّةَ الَّتي هاجَرَ منها، قيلَ: إنَّ سَعدَ ابنَ خَوْلةَ أسلَمَ، ولم يُهاجِرْ مِن مكَّةَ، فكان بؤْسُه مِن عَدمِ هِجْرتِه. وقيلَ: هاجَرَ وشهِد بَدرًا، ثمَّ انصرَفَ إلى مكَّةَ، ومات فيها، فيكونُ بؤْسُه لسُقوطِ هِجرَتِه؛ لأنَّه رجَع إلى مكَّةَ مُخْتارًا، وقيلَ: هاجَرَ إلى الحَبَشةِ الهِجْرةَ الثَّانيةَ، وشهِد بَدرًا وغيرَها، وتُوفِّيَ في مكَّةَ في حَجَّةِ الوَداعِ، وسَببُ بُؤْسِه على هذا مَوتُه في مكَّةَ، وفَواتُ الأجْرِ الكامِلِ له في الهِجْرةِ، والغُرْبةِ عن وَطنِه.
وفي الحَديثِ: زيارةُ الإمامِ فمَن دونَه للمَريضِ.
وفيه: أنَّ الإنْفاقَ على العِيالِ يُثابُ عليه إذا قُصِدَ به وَجهُ اللهِ تعالَى.
وفيه: بَيانُ أنَّ الوَرَثةَ أحقُّ النَّاسِ بتَرِكةِ الميِّتِ.
وفيه: بَيانُ ما كان عِندَ الصَّحابةِ مِن حِرصٍ على فِعلِ الخَيرِ.
وفيه: الوَصيَّةُ والمُبادَرةُ إليها معَ عَلاماتِ المَوتِ؛ كمرَضٍ ونَحوِه.
وفيه: أنَّ الوَصيَّةَ تكونُ في ثُلُثِ المالِ، أو أقلَّ، ولا تَزيدُ عن ذلك.

                  """,
    },
    {
      "arabicText": """
عن أبي هريرة عبد الرحمن بن صخر رضي الله عنه قال قال رسول الله صلى الله عليه وسلم‏:‏

‏ "‏ إن الله لا ينظر إلى أجسامكم ، ولا إلى صوركم، ولكن ينظر إلى قلوبكم وأعمالكم‏"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏
                  """,
      "arabicExplanation": """
علَّمَنا النبيُّ صلَّى اللهُ عليه وسلَّم أنَّ الناسَ لا تَتفاضَلُ بحُسْنِ المظاهِرِ أو كَثرةِ الأموالِ، وإنما تتفاضلُ بطَهارةِ القلوبِ، والخَشيةِ من اللهِ، والسَّعيِ في الأعمالِ الصالحةِ، كما في هذا الحَديثِ، حيثُ يقولُ النبيُّ صلَّى اللهُ عليه وسلَّم: "إنَّ اللهَ تعالى لا يَنظُرُ إلى صُوَرِكم، وأموالِكم"، أي: إنَّ اللهَ سبحانه وتعالى لا يَنظُرُ إلى أجسامِ العبادِ؛ هلْ هي كَبيرةٌ أو صَغيرةٌ، أو صَحيحةٌ أو سَقيمةٌ، ولا يَنظُرُ إلى الصُّوَرِ؛ هل هي جميلةٌ أو ذَميمةٌ؛ ولا يَنظُرُ إلى الأموالِ كثيرةٍ أو قليلةٍ؛ فلا يُؤاخِذُ اللهُ عزَّ وجلَّ عبادَه، ولا يُحاسبُهم على هذه الأمورِ وتَفاوُتِهم فيها، "ولكنْ يَنظُرُ إلى قُلوبِكم"، أي: إلى ما فيها من التَّقْوى واليقينِ، والصدقِ والإخلاصِ، وقصدِ الرياءِ والسُّمعةِ، وسائرِ الأخلاقِ الحَسنةِ والقبيحةِ، "وأعمالِكم"، أي: وينظُرُ إلى أعمالِكم من حيثُ صلاحُها وفسادُها؛ فيثيبُ ويُجازي عليها؛ فلَيسَ بَيْنَ اللهِ وبَيْنَ خلْقِه صِلةٌ إلَّا بِالتَّقْوى؛ فمَنْ كان للهِ أتْقَى كان من اللهِ أقربَ، وكان عندَ اللهِ أكرمَ؛ إذَنْ فعلى المَرْءِ ألَّا يَفخرَ بِمالِه ولا بِجَمالِه ولا بِبدنِه ولا بِأولادِه ولا بِقُصورِه، ولا بِشيءٍ من هذه الدُّنْيا أبدًا، إنَّما إذا وفَّقه اللهُ لِلتَّقوى؛ فهذا من فَضلِ اللهِ عليه؛ فَلْيحمدِ اللهَ عليه، وإنْ خُذِلَ فلا يَلومَنَّ إلَّا نفْسَه.
وفي الحديثِ: الحثُّ على الاعتمادِ على النيةِ وحُسنِ القصدِ، والتَّحذيرُ من الركونِ إلى الظاهرِ دُونَ إصلاحِ الباطِنِ.
وفي الحديث: بيانُ أثرِ القَلبِ في صَلاحِ الجَوارحِ وفَسادِها
                  """,
    },
    {
      "arabicText": """
عن أبي موسى عبد الله بن قيس الأشعرى رضي الله عنه قال‏:‏ سئل رسول الله صلى الله عليه وسلم عن الرجل يقاتل شجاعة، ويقاتل حميةً، ويقاتل رياء، أى ذلك في سبيل الله‏؟‏ فقال رسول الله صلى الله عليه وسلم‏:‏ ‏ "‏ من قاتل لتكون كلمة الله هى العليا فهو في سبيل الله‏"‏ ‏(‏‏(‏متفق عليه‏)‏‏)
                  """,
      "arabicExplanation": """
النِّيَّةُ الصالحةُ شَرطٌ لقَبولِ الأعمالِ عندَ اللهِ تعالَى، والعمَلُ الذي يَفقِدُ هذا الشَّرطَ يكونُ هَباءً مَنثورًا، ولا يَعودُ على صاحبِه بأيِّ نفْعٍ، سَواءٌ كان قِتالًا في سَبيلِ اللهِ، أو أيَّ عمَلٍ آخَرَ.وفي هذا الحديثِ يَروي أبو مُوسى الأشعريُّ رَضيَ اللهُ عنه أنَّ رجُلًا سأَلَ النبيَّ صلَّى اللهُ عليه وسلَّمَ عن حَقيقةِ القتالِ في سَبيلِ الله، وأخبَرَه أنَّ الرَّجلَ إمَّا يُقاتِلُ غضَبًا، أي: رَغبةً في الانتقامِ والثَّأرِ مِن العَدُوِّ، أو يُقاتِلُ حَمِيَّةً، وهي الأَنَفةُ والغَيرةُ دِفاعًا عن قَومِه، فأجابَهُ النبيُّ صلَّى اللهُ عليه وسلَّمَ أنَّ مَن قاتَلَ لتَكونَ كَلمةُ اللهِ هي العُلْيا، وكانت غايتُه ونِيَّتُه مِن قِتالِه أنْ تُصبِحَ كَلمةُ التَّوحيدِ هي الكلمةَ النَّافذةَ في هذه الأرضِ، الَّتي لها سُلطانُها الَّذي لا يُرَدُّ، وسَيطرتُها الَّتي لا تُحَدُّ؛ فهو في سَبيلِ اللهِ، وهو المجاهدُ الحَقيقيُّ، الَّذي إنْ قُتِل نال الشَّهادةَ، وإنْ رجَع رجَع بأجْرٍ وغَنيمةٍ. وفي الحديثِ: أنَّ النِّيةَ الصَّالحةَ شَرطٌ لقَبولِ العمَلِ عندَ اللهِ عزَّ وجلَّ.وفيه: ما أُعطِيَ صلَّى اللهُ عليه وسلَّمَ مِن الفَصاحةِ وجَوامعِ الكلِمِ. وفيه: أنَّ الفَضلَ الَّذي وَرَدَ في المُجاهدينَ يَختَصُّ بمَن قاتَلَ لإعلاءِ كَلِمةِ اللهِ تعالى.
                  """,
    },
    {
      "arabicText": """
عن أبي بكرة نفيع بن الحارث الثقفى رضي الله عنه أن النبي صلى الله عليه وسلم قال‏:‏ ‏"‏إذ التقى المسلمان بسيفيهما فالقاتل والمقتول في النار‏"‏ قلت يارسول الله، هذا القاتل فما بال المقتول‏؟‏ قال‏:‏ ‏"‏إنه كان حريصاً على قتل صاحبه‏"‏ ‏(‏‏(‏متفق عليه‏)‏‏)
                  """,
      "arabicExplanation": """
سَفْكُ الدَّمِ الحَرامِ مِن أكبَرِ المعاصي الَّتي قد يَلقَى الإنسانُ بها اللهَ تعالى، وقد تَوعَّدَ اللهُ سُبحانَه وتعالَى قاتلَ المُسلِمِ بغيرِ حقٍّ بالعذابِ المُقيمِ؛ ولذلك اعتَزَلَتْ فِئةٌ مِن أصحابِ النبيِّ صلَّى اللهُ عليه وسلَّمَ الفِتنةَ الَّتي وقعَتْ بعدَ مَقتلِ عُثمانَ بنِ عفَّانَ رَضيَ اللهُ عنه؛ خَشيةَ أنْ يَتورَّطوا في دَمٍ حرامٍ يَسأَلُهم اللهُ تعالَى عنه يومَ القِيامةِ، وكان ممَّنْ اعتزَلَ القِتالَ أبو بَكْرةَ نُفيعُ بنُ الحارثُ رَضيَ اللهُ عنه.وفي هذا الحَديثِ أنَّ أبا بَكْرةَ رَضيَ اللهُ عنه لَمَّا رأَى الأحْنَفَ بنَ قَيسٍ مُتوجِّهًا للقِتالِ، قال له: أين تُريدُ؟ قال: أنصُرُ هذا الرجُلَ، يعْني: عليَّ بنَ أبي طالبٍ رَضيَ اللهُ عنه في حَرْبِه يومَ الجَمَلِ سنةَ 36 هِجْريَّةً، وهي مَوقعةٌ فيها فِتنةٌ كَبيرةٌ، حدَثَت بالبصرةِ بيْنَ عليٍّ رَضيَ اللهُ عنه ومَن معَه، والزُّبيرِ وطَلْحةَ وعائشةَ رَضيَ اللهُ عنهم ومَن معَهم، وكان ذَهابُ عائشةَ رَضيَ اللهُ عنها للإصلاحِ، وليس للقِتالِ، ثمَّ اضطرَبَت الأمورُ وحدَثَ ما حدَثَ. فقال أبو بَكْرةَ رَضيَ اللهُ عنه للأحنَفِ: ارجِعْ، ثمَّ أخبَرَه أنَّه سَمِعَ رسولَ اللهِ صلَّى اللهُ عليه وسلَّمَ يقولُ: إنَّ المسلِمَينِ إذا الْتَقَيَا بسَيفَيْهما وتقاتلَا على الدُّنيا أو بغَيرِ تَأويلٍ شرعيٍّ سائغٍ، فالقاتلُ والمقتولُ يَستحقَّانِ دُخولَ النَّارَ.فقال أبو بَكْرةَ رَضيَ اللهُ عنه مُستفهِمًا: «يا رسولَ اللهِ، هذا القاتلُ؛ فما بالُ المقتولِ؟»، يعني: فلماذا يَدخُلُ النارَ مع أنه هو الذي قُتِلَ؟ فأجابَه النبيُّ صلَّى اللهُ عليه وسلَّمَ بقولِه: «إنَّه كان حَريصًا على قتْلِ صاحبِه» فكان يُريدُ قتْلَ صاحبِه، ولو سنَحَتْ له الفُرصةُ لَفَعلَ، ولا يَدخُلُ في هذا المسلِمُ الذي يَدفَعُ صائلًا مُسلِمًا، فيُقاتِلُ دُونَ مالِه أو عِرضِه سواءٌ قتَلَ أو قُتِلَ.وكوْنُ الاثنينِ في النارِ لا يَعني خُلودَهما فيها، ولكنْ هذا عقابٌ على هذه المَعصيةِ، ثمَّ يكونُ أمْرُهما إلى اللهِ تعالَى: إنْ شاء عاقَبَهما ثمَّ أخرَجَهما مِن النارِ كسائرِ الموَحِّدينَ، وإنْ شاء عَفا عنْهما فلمْ يُعاقِبْهُما أصلًا، وإنَّما الخُلودُ لِمَنِ استحَلَّ القتْلَ.وفي الحديثِ: أنَّ قِتالَ المسلِمِ لأخيه المُسلِمِ بغَيرِ وجْهٍ شَرعيٍّ كبيرةٌ مِن الكبائرِ، وأنَّ صاحبَ الكبيرةِ لا يَكْفُرُ بفِعلِها؛ لأنَّ النبيَّ صلَّى اللهُ عليه وسلَّمَ سمَّى المُتقاتلَيْنِ مُسلِمَينِ. 
                  """,
    },
    {
      "arabicText": """
عن أبي هريرة رضي الله عنه قال رسول الله صلى الله عليه وسلم ‏:‏ ‏ "‏صلاة الرجل في جماعة تزيد على صلاته في سوقه وبيته بضعاً وعشرين درجه وذلك أن أحدهم إذا توضأ فأحسن الوضوء ثم أتى المسجد لا يريد إلا الصلاة، لا ينهزه إلا الصلاة، لم يخط خطوة إلا رفع له بها درجة، وحط عنه بها خطيئة حتى يدخل المسجد، فإذا دخل المسجد كان في الصلاة ما كانت الصلاة هى تحبسه، والملائكة يصلون على أحدكم ما دام في مجلسه الذى صلى فيه، ما لم يحدث فيه‏"‏ ‏(‏‏(‏متفق عليه، وهذا لفظ مسلم‏)‏‏)‏‏.‏
وقوله صلى الله عليه وسلم‏:‏ '‏‏ ‏ينهزه‏ ‏ هو بفتح الياء والهاء وبالزاى‏:‏ أى يخرجه وينهضه
                  """,
      "arabicExplanation": """
الصَّلاةُ عِمادُ الدِّينِ، ورُكنُ الإسلامِ الرَّكينُ، وقد حثَّنا الشَّرعُ المُطهَّرُ على الإسراعِ إليها، وعدَمِ التَّخلُّفِ عن الجَماعةِ؛ لِما فيه مِن الثَّوابِ والأجرِ المضاعَفِ.وفي هذا الحديثِ يُبَيِّنُ النبيُّ صلَّى اللهُ عليه وسلَّم فَضْلَ صَلاةِ الجماعةِ، فيُخبِرُنا أنَّ الصَّلاةَ في جَماعةٍ تَزيدُ على المُصلِّي مُنفرِدًا في بَيتِه، أو في سُوقِه؛ بخمْسٍ وعشرينَ دَرَجةً، وفي الصَّحيحَينِ: «بسَبْعٍ وعِشْرينَ دَرَجةً»، وهذا الاختِلافُ راجعٌ لاختلافِ أحوالِ المُصلِّينَ والصَّلاةِ، فيكونُ لبعضِهم خمْسٌ وعِشرونَ، ولبعضِهم سَبْعٌ وعِشرونَ؛ وذلك بحسَبِ كَمالِ الصَّلاةِ، ومُحافظتِه على هَيئتِها، وخُشوعِها، وكَثرةِ جَماعتِها، وفضْلِهم، وشَرفِ البُقعةِ. وقيلَ غيرُ ذلك.ثمَّ ذكَرَ صلَّى اللهُ عليه وسلَّم سَبَبَ هذه الزِّيادةِ، وهي أنَّه إذا تَوضَّأَ المسلمُ فأسْبَغَ الوضوءَ، مع مُراعاةِ سُنَنِه وآدابِه، وأتى المسجِدَ، لا يُريدُ إلَّا الصَّلاةَ، لا يَقصِدُ غيرَ ذلك؛ لم يَخْطُ خَطوةً إلَّا رَفَعَه اللهُ بها دَرَجةً وحَطَّ عنه خَطيئةً حتى يَدخُلَ المسجِدَ، وإذا دَخَلَ المسجِدَ كان في صَلاةٍ ما دام سَبَبُ وُجودِه في المسجِدِ هو الصَّلاةَ، وتُصَلِّي عليه الملائكةُ -أي: تَدْعو له- ما دامَ في مُصَلَّاه الذي صَلَّى فيه، فصَلاةُ الملائكةِ عليه مَشروطةٌ بدَوامِه وبقائِه في مُصَلَّاه، ويَظَلُّ له هذا الفضْلُ والأجرُ والخيرُ ما لم يَحصُلْ منه ما يَنقُضُ الطَّهارةَ، فإنْ أَحْدَث حُرِمَ استغفارَهم ولو استمَرَّ جالسًا، وقيل: معناهُ: ما لم يُحْدِثْ حَدَثًا في الإسلامِ؛ يعني: ما لم يَعْصِ. ثمَّ ذَكَر أنَّ الملائكةَ تَدْعو له وتقولُ في دُعائِها له: «اللهُمَّ اغْفِرْ له، اللَّهُمَّ ارْحَمْه»، والفرقُ بيْن المَغفرةِ والرَّحمةِ أنَّ المغفرَةَ سَتْرُ الذُّنوبِ والتَّجاوُزُ عنها، والرَّحمةَ إفاضةُ الإحسانِ إليه.وفي الحديثِ: عِظَمُ فَضْلِ صَلاةِ الجماعةِ وكَبيرُ ثَوابِها.وفيه: فَضْلُ مَنِ انتظَرَ الصَّلاةَ، وأنَّه يَفوزُ باستغفارِ الملائكَةِ له.وفيه: حثٌّ على إسباغِ الوُضوءِ.
                  """,
    },
    {
      "arabicText": """
عن أبي العباس عبد الله بن عباس بن عبد المطلب رضي الله عنهما، عن رسول الله، صلى الله عليه وسلم، فيما يروى عن ربه، تبارك وتعالى قال‏:‏ ‏ "‏ إن الله كتب الحسنات والسيئات ثم بين ذلك‏:‏ فمن همّ بحسنة فلم يعملها كتبها الله تبارك وتعالى عنده حسنة كاملة، وإن هم بها فعملها كتبها الله عشر حسنات إلى سبعمائه ضعف إلى أضعاف كثيرة، وإن هم بسيئة فلم يعملها كتبها الله عنده حسنة كاملة، وإن همّ بها فعملها كتبها الله سيئة واحدة ‏"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏
                  """,
      "arabicExplanation": """
اللهُ عَزَّ وجَلَّ واسِعُ الرَّحمةِ، جَزيلُ العَطاءِ، ومُعاملتُه لعِبادِه دائرةٌ بيْن العَدلِ والفَضلِ.
وفي هذا الحديثِ بَيانٌ لِكَرَمِ اللهِ عَزَّ وجَلَّ مع العِبادِ في كِتابةِ الحَسَناتِ والسَّيِّئاتِ؛ فيَروي النَّبيُّ صلَّى اللهُ عليه وسلَّم في هذا الحديثِ القُدسيِّ الذي يَرْويه عن ربِّه عزَّ وجلَّ: أنَّ اللهَ أمَرَ المَلائِكةَ الحفَظةَ بكِتابةِ الحَسَناتِ والسَّيِّئاتِ للعبْدِ؛ ليُجازيَه بِهما في الدَّارِ الآخرةِ، أو أنَّ اللهَ عَزَّ وجَلَّ قَدَّرَ الحَسَناتِ والسَّيِّئاتِ قَديمًا وَفْقَ عِلْمِه سُبحانَه، ثمَّ بيَّن للمَلَكينِ كيْف يَكتُبانِها، «فمَن هَمَّ بحَسَنةٍ» والهَمُّ هو النيَّةُ وعَقدُ العَزمِ، والمعنى: فمَن نَوَى حَسَنةً وأراد أنْ يَفعَلَها، ولكنَّه لم يَفعَلْها لمانعٍ، أو لغيرِ مانعٍ، كَتَبها اللهُ عِنده حَسَنةً كاملةً غيْرَ مَنقوصةٍ، واطِّلاعُ المَلَكِ على النيَّةِ التي هي مِن فِعلِ القَلبِ يَكونُ بإطْلاعِ اللهِ تَعالى إيَّاه، فإذا همَّ العَبدُ بالحَسَنةِ فعَمِلها، كَتَبها اللهُ عزَّ وجلَّ وضاعفَها مِن عَشْرِ حَسَناتٍ، إلى سَبعِ مِائةِ ضِعفٍ، إلى أضعافٍ كَثيرةٍ، كما قال تعالى: {مَثَلُ الَّذِينَ يُنْفِقُونَ أَمْوَالَهُمْ فِي سَبِيلِ اللَّهِ كَمَثَلِ حَبَّةٍ أَنْبَتَتْ سَبْعَ سَنَابِلَ فِي كُلِّ سُنْبُلَةٍ مِائَةُ حَبَّةٍ وَاللَّهُ يُضَاعِفُ لِمَنْ يَشَاءُ وَاللَّهُ وَاسِعٌ عَلِيمٌ} [البقرة: 261]؛ وذلك بحسَبِ الإخلاصِ وصِدقِ العَزمِ، وحُضورِ القَلبِ، وتَعدِّي النَّفعِ. ومَن نَوى عَمَلَ سيِّئةٍ فلمْ يَعمَلْها -خوْفًا مِن اللهِ وحَياءً منه- كَتَبها اللهُ عِنده حَسنةً كاملةً؛ لا يَنقُصُ مِن ثَوابِها شَيءٌ، فإنْ همَّ بها فعَمِلها، كَتَبها اللهُ عليه سيِّئةً واحدةً دونَ زِيادةٍ أو مُضاعَفةٍ كما في الحَسَناتِ.
وفي الحَديثِ: بَيانُ سَعةِ فضْلِ اللهِ على هذه الأمَّةِ؛ إذ لوْلا ذلك كاد لا يَدخُلُ أحدٌ الجنَّةَ؛ لأنَّ عَمَلَ العبادِ للسَّيِّئاتِ أكثرُ مِن عَملِهم للحَسَناتِ. 
                  """,
    },
    {
      "arabicText": """
عن أبي عبد الرحمن عبد الله بن عمر بن الخطاب، رضي الله عنهما قال‏:‏ سمعت رسول الله صلى الله عليه وسلم يقول‏:‏ ‏"‏ انطلق ثلاثة نفر ممن كان قبلكم حتى آواهم المبيت إلى غار فدخلوه، فانحدرت صخرة من الجبل فسدت عليهم الغار، فقالوا‏:‏ إنه لا ينجيكم من هذه الصخرة إلا أن تدعوا الله بصالح أعمالكم‏.‏ قال رجل منهم‏:‏ اللهم كان لي أبوان شيخان كبيران، وكنت لا أغبق قبلهما أهلاً ولا مالاً‏.‏ فنأى بى طلب الشجر يوماً فلم أرح عليهما حتى ناما فحلبت لهما غبوقهما فوجدتهما نائمين فكرهت أن أوقظهما وأن أغبق قبلهما أهلاً أو مالاً، فلبثت- والقدح على يدى- أنتظر استيقاظهما حتى برق الفجر والصبية يتضاغون عند قدمى- فاستيقظا فشربا غبوقهما‏.‏ اللهم إن كنت فعلت ذلك ابتغاء وجهك ففرج عنا ما نحن فيه من هذه الصخرة، فانفرجت شيئاً لا يستطيعون الخروج منه‏.‏ قال الآخر‏:‏ اللهم إنه كانت لي ابنة عم كانت أحب الناس إلىّ ‏"‏ وفى رواية‏:‏ ‏"‏كنت أحبها كأشد ما يحب الرجال النساء، فأردتها على نفسها فامتنعت منى حتى ألمّت بها سنة من السنين فجاءتنى فأعطيتها عشرين ومائة دينار على أن تخلى بينى وبين نفسها ففعلت، حتى إذا قدرت عليها‏"‏ وفى رواية‏:‏ ‏"‏فلما قعدت بين رجليها، قالت‏:‏ اتق الله ولا تفض الخاتم إلا بحقه، فانصرفت عنها وهى أحب الناس إلى وتركت الذهب الذى أعطيتها، اللهم إن كنت فعلت ذلك ابتغاء وجهك فافرج عنا ما نحن فيه، فانفرجت الصخرة غير أنهم لا يستطيعون الخروج منها‏.‏ وقال الثالث‏:‏ اللهم استأجرت أجراء وأعطيتهم أجرهم غير رجل واحد ترك الذى له وذهب، فثمرت أجره حتى كثرت منه الأموال، فجاءنى بعد حين فقال‏:‏ يا عبد الله أدّ إلى أجرى، فقلت‏:‏ كل ما ترى من أجرك‏:‏ من الإبل والبقر والغنم والرقيق‏.‏ فقال‏:‏ يا عبد الله لا تستهزئ بى‏!‏ فقلت‏:‏ لا أستهزئ بك، فأخذه كله فاستاقه فلم يترك منه شيئاً، اللهم إن كنتُ فعلت ذلك ابتغاء وجهك فافرج عنا ما نحن فيه، فانفرجت الصخرة فخرجوا يمشون‏"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏
                  """,
      "arabicExplanation": """
الدُّعاءُ والتَّقرُّبُ إلى اللهِ تعالَى بصالِحِ الأعمالِ والإخلاصِ سَبَبٌ لتَفْريجِ كُلِّ كَرْبٍ.
وفي هذا الحديثِ يَحكِي النَّبيُّ صلَّى اللهُ عليه وسلَّمَ أنَّه انطَلَقَ ثَلاثةُ رَهْطٍ مِنَ الأُمَمِ السَّابقةِ -والرَّهْطُ: ما دونَ العَشَرَةِ مِنَ الرِّجالِ لا يكونُ فيهِمُ امْرأةٌ، وإنَّما جاز تَمييزُ الثَّلاثةِ بالرَّهطِ؛ لأنَّه في معْنى الجماعةِ- حتَّى لَجَؤوا إلى غارٍ لِيَبيتوا فيه، وفي الصَّحيحَينِ: أنَّهم دَخَلوه بسَببِ نُزولِ الأَمْطارِ، والغارُ: الكَهْفُ في الجَبَلِ، فنَزَلَتْ مِن أعلى الجبلِ صَخرةٌ فأغلَقَتْ مَخْرَجَ الغارِ الَّذي يَخرُجون منه، فَحُبِسَ الثَّلاثَةُ داخِلَ هذا الكهْفِ، فقال بَعضُهم لبَعضٍ: إنَّه لا يُنْجِيكُمْ مِن هذه الصَّخرةِ إلَّا أنْ تَتوسَّلوا إلى اللهِ وتَدْعوهُ بما كان مِن عَملِكُم الصَّالِحِ؛ حتَّى يَستجيبَ لكم، فيُبعِدَ تلك الصَّخرةَ عن بابِ الكهْفِ.
فقال رَجُلٌ منهم: «اللَّهُمَّ كان لي أَبَوانِ شَيْخانِ كَبيرانِ، وكنتُ لا أَغْبِقُ قَبْلَهما»، أي: لا أُقَدِّمُ عليهما أحدًا في شُرْبِ لَبنِ العَشِيِّ؛ لا أهلًا ولا مالًا، وهذا كِنايةٌ عن شِدَّةِ بِرِّهِ بهما؛ بأنْ يَجعَلَهما أوَّلَ الشاربينَ مِن لَبَنِ العَشاءِ وأوَّلَ الطاعِمينَ، ثمَّ أخبَرَ أنَّه ذاتَ يومٍ طال بهِ الوقتُ خارجَ البيتِ؛ لِبُلوغِ بَعضِ الحاجةِ، فلمْ يَرجِعْ إلى البيتِ حتَّى نام الأَبَوانِ، فَحَلَبَ لهما اللَّبَنَ الَّذي يَشْرَبانِهِ قَبْلَ نَوْمِهما، ولكنَّه لمَّا ذهَبَ إليهما لِيَسقِيَهما وَجَدَهما قدْ ناما، وكَرِهَ أنْ يُخلِفَ عادتَه، فامْتَنَعَ عن أنْ يَشرَبَ هو مِن هذا اللَّبنِ أو أنْ يَسقِيَ أَحَدًا قَبْلَهما، قال الرَّجلُ: «فَلَبِثْتُ والقَدَحُ على يَدي أَنْتَظِرُ استِيقاظَهما حتَّى بَرَقَ الفجرُ»، أي: ظَهَرَ ضِياؤُهُ، والقَدَحُ: الوِعاءُ الَّذي يُشرَبُ فيه، فتَرَكَهما نائمَيْنِ مُفَضِّلًا السَّهَرَ في انتظارِهما على أنْ يُوقِظَهما مِن نَومِهما حتَّى يكونَا هما المُسْتَيقِظَينِ مِن تِلقاءِ أنفُسِهما، قال الرَّجلُ: «اللَّهُمَّ إنْ كُنْتُ فعَلْتُ ذلك ابتِغاءَ وَجهِكَ»، وطَلَبًا لِمَرضاتِكَ، «ففَرِّجْ عنَّا ما نحنُ فيه مِن هذه الصَّخرةِ»، واجعَلْ لنا منها مَخْرَجًا، فأخبَرَ النَّبيُّ صلَّى اللهُ عليه وسلَّمَ أنَّ بابَ الغارِ فُتِحَ قَدْرًا يَسيرًا، ولكنْ لا يَستطيعون الخُروجَ.
ثمَّ قال الرجُلُ الثاني: اللَّهُمَّ كانتْ لي بِنْتُ عَمٍّ كانت أَحَبَّ النَّاسِ إلَيَّ، وأردْتُ أنْ أَزْنِيَ بها، فامْتَنَعَتْ منِّي، حتَّى نَزَلَتْ بها مَضَرَّةٌ جعَلَتْها في حاجةٍ وفَقْرٍ، فجاءتْ تَطلُبُ منِّي المُساعَدةَ، فأعطيْتُها عِشرينَ ومِئةَ دِينارٍ، وشَرَطْتُ عليها أنْ تُمكِّنَني مِن نفْسِها مُقابِلَ المالِ، فوافقَتْ، حتَّى إذا تَمكَّنتُ منها، واقترَبْتُ مِن جِماعِها، قالَتْ لي: «يا عبدَ اللهِ، اتَّقِ اللهَ» -كما في الصَّحيحَينِ- «لا أُحِلُّ لك أنْ تَفُضَّ الخاتَمَ إلَّا بِحَقِّهِ»، فذكَّرَتْه باللهِ عزَّ وجلَّ وتَقْواه، وسَألَتْهُ أنْ يَنتَهيَ عنها ولا يُواقِعَها، وألَّا يُزِيلَ بَكارَتَها إلَّا بالزَّواجِ الَّذي أحلَّهُ اللهُ، فتَجنَّبها ولم يَزْنِ بها؛ لِمَا ذكَّرَتْهُ به مِن حقِّ الله فيها، قال الرَّجُلُ: «وهي أَحَبُّ النَّاسِ إلَيَّ»، وفي هذا إشارةٌ إلى أنَّ حُبَّهُ لها كان أَدْعى إلى الوقوعِ عليها، ومع ذلك انْصرَفَ عنها، وترَكَ لها المالَ الَّذي قد أَخَذَتْهُ منه، ثمَّ قال: «اللَّهُمَّ إنْ كُنتُ فعَلْتُ ذلك ابتغاءَ وَجهِكَ فافْرِجْ عنا ما نحنُ فيه»، فأخبَرَ النَّبيُّ صلَّى اللهُ عليه وسلَّمَ أنَّ بابَ الغارِ فُتِحَ قَدْرًا يسيرًا، ولكنْ لا يَستطيعون الخُروجَ.
ثمَّ قال الثَّالِثُ: اللَّهمَّ إنِّي اسْتَأجَرْتُ عُمَّالًا يَعمَلونَ عِندي مُقابِلَ أَجْرٍ، فأعْطَيتُهم أجْرَهم إلَّا عامِلًا واحدًا ذهَبَ ولم يَأخُذْ أُجْرَتَهُ، «فثَمَّرْتُ أَجْرَهُ» وتاجَرْتُ له به، «حتَّى كَثُرَتْ منه الأموالُ»، فزادَ نَماءُ هذه الأُجْرةِ، ثمَّ جاءني الأجيرُ الَّذي تَرَكَ أُجرَتَهُ بعْدَ مُدَّةٍ مِنَ الزَّمنِ، فَطَلَبَ منِّي أُجْرتَهُ التي تَرَكَها، فقُلتُ له: كُلُّ أنواعِ المالِ الَّتي أمامَ نَظَرِكَ مِنَ الإبلِ والبَقَرِ والغَنَمِ والرَّقيقِ، هو أَجْرُكَ الَّذي ترَكْتَ، والرَّقيقُ: هُمُ العَبيدُ المَملوكونَ، فقال الأجيرُ: «يا عبدَ اللهَ، لا تَستهزِئْ بي!» يَستنكِرُ عليه ما يَدَّعيهِ مِن أنَّ أُجْرتَهُ قدْ بلَغَتْ كُلَّ ذلك، فقال له: «إنِّي لا أَستهزِئُ بك»، فأخَذَ الأجيرُ كُلَّ ذلك المالِ الَّذي أشار به إليه، وفي ذلك إشارةٌ إلى أنَّ الرَّجُلَ لم يَطمَعْ في شَيءٍ مِن ذلك، ولو بِقَدْرِ ما يَترُكُ له الأجيرُ مِن مُكافَأَةٍ له نَظيرَ فِعْلِهِ، قال الرَّجلُ: «اللَّهمَّ فإنْ كنتُ فعَلْتُ ذلك ابتغاءَ وَجهِكَ فافْرِجْ عنَّا ما نحنُ فيه»، فأخبَرَ النَّبيُّ صلَّى اللهُ عليه وسلَّمَ أنَّ الصَّخرةَ انْفَرَجَت كلُّها، فَتَمَّ لهم بتِلك الدَّعوةِ فَتْحُ بابِ الغارِ، فخَرَجوا يَمْشُونَ.
وفي الحديثِ: التَّوسُّلُ إلى اللهِ تعالَى بالأعمالِ الصَّالحةِ.
وفيه: بَيانُ فَضلِ الإخلاصِ.
وفيه: بَيانُ فضْلِ بِرِّ الوالِدَيْن، وفَضلِ تَقديمِهما على سائِرِ الأهلِ والأقارِبِ.
وفيه: فَضلُ التَّعفُّفِ عن الحَرامِ ومُراقبةِ اللهِ تعالَى والخوفِ مِنه.
وفيه: الحَثُّ على بَذْلِ الخيرِ للآخَرينَ دونَ تَلَمُّسِ أَجْرٍ منهم على ذلك، والحَذرُ مِن الطَّمَعِ.
                  """,
    },
    {
      "arabicText": """
عن أبي هريرة رضي الله عنه قال‏:‏ سمعت رسول الله صلى الله عليه وسلم يقول‏:‏ ‏ "‏والله إني لأستغفر الله وأتوب إليه في اليوم أكثر من سبعين مرة ‏"‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏
                  """,
      "arabicExplanation": """
مِن لُطفِ اللهِ عزَّ وجلَّ بعِبادِه أنْ يَسَّرَ لهمْ أبوابَ التَّوبةِ، والاستغفارَ.
وفي هذا الحديثِ يُقسِمُ رَسولُ اللهِ صلَّى اللهُ عليه وسلَّم -وهو الصَّادقُ المصْدوقُ- أنَّه يَتُوبُ إلى اللهِ تعالَى ويَستغفِرُه في اليومِ أكثرَ مِن سَبعينَ مرَّةً، مع أنَّه المعصومُ مِن ربِّ العالَمِين؛ وذلك تَشريعًا وتَعليمًا لأُمَّتِه صَلواتُ ربِّي وسَلامُه عليه، وطَلَبًا لفضْلِ اللهِ تعالَى وكَرَمِه. والقَسَمُ لتَأكيدِ الخَبَرِ، وإنْ لم يكُنْ عندَ السَّامِعِ فيه شكٌّ.
وجاء عنه صلَّى اللهُ عليه وسلَّم -كما في صَحيحِ مُسلِمٍ-: «يا أيُّها النَّاسُ، تُوبُوا إلى اللهِ واستَغْفِروه؛ فإنِّي أَتوبُ في اليومِ مِائَةَ مَرَّةٍ»، فالعددُ: المرادُ مِنه الإشارةُ للكثرةِ وليس المرادُ الحَصرَ فيه، واللهُ أعلَمُ، وظاهرُ الكَلامِ أنَّه صلَّى اللهُ عليه وسلَّم يَطلُبُ المَغفرةَ ويَعزِمُ على التَّوْبةِ، بأيِّ صِيغةٍ كانت، ويَحتمِلُ أنْ يكونَ المرادُ قولَ هذا اللَّفظِ بعَينِه: «أسْتَغفِرُ اللهَ وأتوبُ إليه». 
                  """,
    },
    {
      "arabicText": """
عن الأغر بن يسار المزنى رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏ "‏ ياأيها الناس توبوا إلى الله واستغفروه فإنى أتوب في اليوم مائه مرة‏"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)
                  """,
      "arabicExplanation": """
مِن لُطفِ اللهِ عزَّ وجلَّ بعِبادِه أنْ يَسَّرَ لهمْ أبوابَ التَّوبةِ، والاستغفارَ.
وفي هذا الحديثِ يُقسِمُ رَسولُ اللهِ صلَّى اللهُ عليه وسلَّم -وهو الصَّادقُ المصْدوقُ- أنَّه يَتُوبُ إلى اللهِ تعالَى ويَستغفِرُه في اليومِ أكثرَ مِن سَبعينَ مرَّةً، مع أنَّه المعصومُ مِن ربِّ العالَمِين؛ وذلك تَشريعًا وتَعليمًا لأُمَّتِه صَلواتُ ربِّي وسَلامُه عليه، وطَلَبًا لفضْلِ اللهِ تعالَى وكَرَمِه. والقَسَمُ لتَأكيدِ الخَبَرِ، وإنْ لم يكُنْ عندَ السَّامِعِ فيه شكٌّ.
وجاء عنه صلَّى اللهُ عليه وسلَّم -كما في صَحيحِ مُسلِمٍ-: «يا أيُّها النَّاسُ، تُوبُوا إلى اللهِ واستَغْفِروه؛ فإنِّي أَتوبُ في اليومِ مِائَةَ مَرَّةٍ»، فالعددُ: المرادُ مِنه الإشارةُ للكثرةِ وليس المرادُ الحَصرَ فيه، واللهُ أعلَمُ، وظاهرُ الكَلامِ أنَّه صلَّى اللهُ عليه وسلَّم يَطلُبُ المَغفرةَ ويَعزِمُ على التَّوْبةِ، بأيِّ صِيغةٍ كانت، ويَحتمِلُ أنْ يكونَ المرادُ قولَ هذا اللَّفظِ بعَينِه: «أسْتَغفِرُ اللهَ وأتوبُ إليه». 
                  """,
    },
    {
      "arabicText": """
عن أبي حمزة أنس بن مالك الأنصارى خادم رسول الله صلى الله عليه وسلم، رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏"‏ لله أفرح بتوبة عبده من أحدكم سقط على بعيره وقد أضله في أرض فلاة ‏"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏

وفى رواية لمسلم‏:‏ لله أشد فرحا بتوبة عبده حين يتوب إليه من أحدكم كان على راحلته بأرض فلاة، فانفلتت منه وعليها طعامه وشرابه فأيس منها، فأتى شجرة فاضطجع في ظلها، وقد أيس من راحلته، فبينما هو كذلك إذا هو بها، قائمة عنده ، فأخذ بخطامها ثم قال من شدة الفرح‏:‏ اللهم أنت عبدي وأنا ربك، أخطأ من شدة الفرح‏"‏‏.‏
                  """,
      "arabicExplanation": """
مِن لُطفِ اللهِ عزَّ وجلَّ بعِبادِه أنْ يَسَّرَ لهم أبْوابَ التَّوبةِ والاستغفارِ حتى يرجِعَ المذنِبُ إلى رَبِّه ويتوبَ مِن ذُنوبِه مهما كانت عظيمةً، ولكِنْ ينبغي للعاقِلِ أن يرى ذُنوبَه وقبائِحَه كما وصَفَها الشَّرعُ، ولا يستهينَ بها.
وفي هذا الحَديثِ وصَفَ عبدُ اللهِ بنُ مَسعودٍ رَضِيَ اللهُ عنه حالَ المُؤمِنِ مع ذُنوبِه، وشبَّهه برجُلٍ قاعدٍ تحْتَ جبَلٍ يَخافُ أنْ يَقَعَ عليه؛ ومَن وقَعَ عليه الجبلُ فلا يُظَنُّ له نَجاةٌ، فالمُؤمِنُ ينظُرُ إلى عَظَمةِ اللهِ عزَّ وجَلَّ، وجَلالِه، وعِزِّ سُلطانِه، وغناه عن خَلْقِه، وفَقْرِ خَلْقِه إليه، وأنَّ يَسيرَ المعصيةِ له جَلَّ جَلالُه ليس بيسيرٍ عند المُؤمِنِ؛ فلذلك يرى كأنَّه قاعدٌ تحت جَبَلٍ؛ مِن خَوفِ ما أتى.
بيْنَما يَنظُرُ الفاجِرُ -وهو الفاسِقُ المُستهترُ- لذُنوبِه باستخفافٍ، حتى إنَّه يرى كبائِرَ الذُّنوبِ سَهلةً يسيرةً، فكأنَّها ذُبابٌ مرَّ على أنْفِه فأشار بيَدِه، فذَهَب الذُّبابُ ولم يُؤثِّرْ فيه، لا لخِفَّةِ ذُنوبِه، ولكِنْ لخِفَّةِ إيمانِه باللهِ سُبحانَه.
ثُمَّ ذَكَر رَضِيَ اللهُ عنه ما يُخفِّفُ على المؤمِنِ خَوْفَه مِن ذُنوبه؛ فذَكَر حَديثَ النَّبيِّ صلَّى اللهُ عليه وسلَّم أنَّه قال: «لَلَّهُ» بلامِ التَّوكيدِ «أَفْرَحُ» بصِيغةِ التَّفضيلِ «بتَوبةِ العبْدِ» مِن مَعصِيَتِه «مِن رَجُلٍ نَزَل منزِلًا»، أي: مكانًا «وبه مَهْلَكَةٌ»، فهذا المكانُ مَظِنَّةُ الهلاكِ، وفي رِوايةِ النَّسائيِّ في الكُبرى: «بِدَوِّيَّةٍ مَهْلَكَةٍ»، والدَّوِّيَّةُ: هي الأرضُ القَفْرُ والفَلَاةُ الخالِيَةُ، والبَرِّيَّةُ والصَّحْراءُ الَّتِي لا نَباتَ فيها، وكان معه في رِحْلَتِه هذه «راحِلَتُه»، وهي ما يَركَبُه مِن الدَّوَابِّ، مِثلُ النَّاقةِ أو الفَرَسِ أو ما في معنى ذلك من الركائِبِ التي يَحمِلُ عليها طعامَه وشرابَه، وبعد تَعَبٍ مِنَ السَّيرِ أخلد للرَّاحةِ «فوَضَع رأْسَه» وهذا كنايةٌ عن الاستلقاءِ، فنام نَوْمةً لا يَشعُرُ بما حوله ولا يحفَظُ راحِلَتَه، ثم استَيقظ وقدْ ذهبَتْ راحلتُه وابتعَدَت وتاهت في هذه الصَّحراءِ، وبعد البَحثِ عنها لم يجِدْها، وظَلَّ يَبحَثُ حتَّى اشْتَدَّ عليه الحرُّ والعَطَشُ أو ما شاءَ اللهُ مِن أنواع البَلاءِ الأُخرَى، فقال لنَفْسِه بعْدَ مُحاوَلةِ البَحثِ عن الرَّاحلةِ: «أَرجِع إلى مَكاني» الَّذِي كان قد نام فيه؛ ينتظِرُ قضاءَ اللهِ فيه، يقصِدُ الموتَ، ويحتَمِلُ أنَّه رجع إلى هذا المكانِ؛ لأنَّ عادةَ الحيوانِ أنَّه إذا ضاع أو تاه يَتْبَعُ آثارَ خُطُواتِه ويرجِعُ إلى المكانِ الأوَّلِ، «فرَجَع الرَّجُلُ فنام نَوْمةً، ثُمَّ رفَع رأْسَه» بعد الاستيقاظِ، «فإذا راحلتُه عِندَه» قد رجَعَت إلى مكانها عِندَه، ولا شَكَّ أنَّ مَن هذه حالُه يَفرَحُ فرحًا شديدًا، وفي روايةِ مُسلمٍ مِن حَديثِ أنَسِ بنِ مالِكٍ رَضِيَ اللهُ عنه أنَّه قال من شِدَّةِ الفَرَحِ: «اللَّهُمَّ أنت عبدِي وأنا ربُّك، أَخْطَأَ مِن شِدَّةِ الفَرَحِ، فاللهُ أشدُّ فَرَحًا بتَوبةِ عبْدِه مِن ذلك الرَّجُلِ»، فاللهُ سُبحانَه أفرَحُ بتوبةِ عِبادِه إليه من فَرَحِ هذا الرَّجُلِ برُجوعِ دابَّتِه إليه التي فيها حياتُه بعد أن يَئِسَ للموتِ.
والتوبةُ فَرضٌ مِنَ اللهِ تعالى على كُلِّ من عَلِمَ مِن نَفْسِه ذنبًا صغيرًا أو كبيرًا؛ لقَولِه تعالى: {يَا أَيُّهَا الَّذِينَ آمَنُوا تُوبُوا إِلَى اللَّهِ تَوْبَةً نَصُوحًا} [التحريم: 8]، وقال: {وَتُوبُوا إِلَى اللَّهِ جَمِيعًا أَيُّهَ الْمُؤْمِنُونَ لَعَلَّكُمْ تُفْلِحُونَ} [النور: 31]، وقال تعالى: {إِنَّمَا التَّوْبَةُ عَلَى اللَّهِ لِلَّذِينَ يَعْمَلُونَ السُّوءَ بِجَهَالَةٍ ثُمَّ يَتُوبُونَ مِنْ قَرِيبٍ} [النساء: 17]، فكُلُّ مُذنِبٍ فهو عند مواقَعةِ الذَّنبِ جاهِلٌ وإن كان عالِمًا، ومن تاب قبل الموتِ تاب من قَريبٍ.
وفي الحَديثِ: إثباتُ صِفةِ الفَرحِ للهِ عزَّ وجلَّ، على ما يَليقُ بكَمالِه وجَلالِه؛ {لَيْسَ كَمِثْلِهِ شَيْءٌ وَهُوَ السَّمِيعُ الْبَصِيرُ} [الشورى: 11].
وفيه: قَبولُ التَّوبةِ الصَّادِقةِ وفَرَحُ اللهِ تعالى بها، ورضاه عن صاحِبِها، فالتَّوبةُ مَقبولةٌ حتى تَطلُعَ الشَّمسُ مِن مَغرِبِها، كما في ثبت في الأحاديثِ. 
                  """,
    },
    {
      "arabicText": """
عن أبي موسى عبد الله بن قيس الأشعرى رضي الله عنه عن النبي صلى الله عليه وسلم قال‏:‏ ‏ "‏ إن الله تعالى يبسط يده بالليل ليتوب مسيء النهار، ويبسط يده بالنهار ليتوب مسيء الليل حتى تطلع الشمس من مغربها‏"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)
                  """,
      "arabicExplanation": """
رَحمةُ اللهِ وَسِعَت كُلَّ شيءٍ ومِن رَحمتِه أنَّه فَتحَ بابَ التَّوبةِ لعِبادِه باللَّيلِ والنَّهارِ، وهو سُبحانه يُحِبُّ التَّائبينَ ويَدعو عِبادَه إلى التَّوبةِ ويُرَغِّبُهم فيها، فيَتوبُ على مَن تابَ ويَغفِرُ الذَّنْبَ، ويَصبِرُ على العُصاةِ، ولا يُعجِّلُ لهم العقابَ حتَّى يَتوبوا ويَرجِعوا إليه.
وفي هذا الحديثِ يُبيِّنُ النَّبيُّ صلَّى اللهُ عليه وسلَّمَ عَظيمَ فَضلِ اللهِ تَعالَى وَسَعَةِ رَحمتِه وأنَّ اللهَ عزَّ وجَلَّ «يَبْسُطُ يَدَهُ باللَّيلِ ليَتُوبَ مُسِيءُ النَّهارِ، ويَبْسُطُ يَدَه بالنَّهارِ لِيَتُوبَ مُسِيءُ اللَّيلِ» والمعنى: أنَّه سُبحانه يَقبَلُ التَّوبةَ مِن عِبادِه وإنْ تَأخَّرت بَعدَ ارتِكابِ الذَّنبِ، فالتَّوبةُ وإنْ كانتْ مَأمورًا بِها على الفَورِ إلَّا أَنَّها إذا تَأخَّرت قَبِلَها اللهُ عزَّ وجلَّ، فإنْ أَذنَبَ العَبدُ ذَنبًا بالنَّهارِ وَتابَ باللَّيلِ قَبِلَ اللهُ تَوبَتَه، وإنْ أَذنَبَ ذَنبًا باللَّيلِ وَتابَ بالنَّهارِ قَبِلَ اللهُ تَوبَتَه، وبَسَطَ يَدَه سُبحانَه يَتَلقَّى بِهما تَوبةَ التَّائبِ فَرحًا بِها وقَبولًا لَها.
ولا يَزالُ الأَمرُ كَذلكَ بالعِبادِ حتَّى تَطلُعَ الشَّمسُ مِن مَغرِبِها، فإذا طَلعَتْ مِن مَغرِبِها قَبيلَ يَومِ القِيامةِ فإنَّ بابَ التَّوبةِ يُغلَقُ، فلا تُقبَلُ بَعدَ تِلكَ العَلامةِ تَوبةُ أحدٍ، ولا يَنْفَعُ الإيمانُ مَن لم يُؤمِنْ مِن قبْلُ، وهو معنى قولِه تَعالَى: {يَوْمَ يَأْتِي بَعْضُ آيَاتِ رَبِّكَ لَا يَنْفَعُ نَفْسًا إِيمَانُهَا لَمْ تَكُنْ آمَنَتْ مِنْ قَبْلُ أَوْ كَسَبَتْ فِي إِيمَانِهَا خَيْرًا} [الأنعام: 158]، وللتَّوبةِ حَدٌّ آخَرُ؛ وهو أنْ يتوبَ الإنسانُ قبْلَ غَرْغرةِ الموتِ، وهي وُصولُ الرُّوحِ إلى الحُلقومِ، كما قال تَعالَى: {وَلَيْسَتِ التَّوْبَةُ لِلَّذِينَ يَعْمَلُونَ السَّيِّئَاتِ حَتَّى إِذَا حَضَرَ أَحَدَهُمُ الْمَوْتُ قَالَ إِنِّي تُبْتُ الْآنَ} [النساء: 18].
ولعلَّ الحكمةَ مِن مَنعِ التَّوبةِ عندَ طُلوعِ الشَّمسِ مِن مَغربِها أو عندَ الموتِ: أنَّ النَّاسَ في هذا التَّوقيتِ تَنكشِفُ لهم الحقائقُ، ويُشاهِدون مِن الأهوالِ ما يَلْوي أعناقَهُم إلى الإقرارِ والتَّصديقِ باللهِ وآياتِه، وحُكمُهم في ذلك حُكمُ مَن عايَنَ بَأْسَ اللهِ، كما قال تَعالَى: {فَلَمَّا رَأَوْا بَأْسَنَا قَالُوا آمَنَّا بِاللَّهِ وَحْدَهُ وَكَفَرْنَا بِمَا كُنَّا بِهِ مُشْرِكِينَ * فَلَمْ يَكُ يَنْفَعُهُمْ إِيمَانُهُمْ لَمَّا رَأَوْا بَأْسَنَا} [غافر: 84، 85].
وللتَّوبةِ شُروطٌ؛ الأوَّلُ: الإقلاعُ عن المعصيةِ، والثَّاني: النَّدمُ على فِعلِها، والثَّالثُ: العزمُ على ألَّا يَعودَ إليها أبدًا، هذا إنْ كانت في حُقوقِ اللهِ تَعالَى، وإنْ كانت مُتعلِّقةً بحقٍّ مِن حُقوقِ العبادِ، فيُشترَطُ لصِحَّةِ التَّوبةِ أنْ يُؤدِّيَ ذلك الحقَّ إلى صاحبِه، أو يَعفُوَ عنه صاحبُ الحقِّ.
وفي الحديثِ: مَحبَّةُ اللهِ للتَّوبةِ.
وفيه: إِثباتُ صِفةِ اليدِ للهِ عَزَّ وجلَّ، فنُؤمِن بها مِن غيرِ تَأويلٍ ولا تَمثيلٍ، ومِن غيرِ تَحريفٍ ولا تَعطيلٍ.
وفيه: تَطييبٌ لنُفوسِ العبادِ، وتَنشيطٌ للتَّوبةِ، وبَعثٌ عليها قبْلَ فَواتِ الأوانِ.
وفيه: رَدعٌ عن اليأسِ والقُنوطِ، وأنَّ الذُّنوبَ وإنْ جَلَّت فإنَّ عَفْوَ اللهِ سُبحانه أجَلُّ، وكَرمَه أعظَمُ.
وفيه: بَيانُ أنَّ طُلوعَ الشَّمسِ مِن مَغرِبها إحدى عَلاماتِ السَّاعةِ الكُبرى.

                  """,
    },
    {
      "arabicText": """
عن أبي هريرة رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏ "‏ من تاب قبل أن تطلع الشمس من مغربها تاب الله عليه‏"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.
                  """,
      "arabicExplanation": """
حَثَّ النَّبيُّ صلَّى اللهُ عليه وسلَّمَ على الإسراعِ والمُبادَرَةِ بالتَّوبةِ النَّصوحِ قَبْلَ أن يَأتيَ وَقْتٌ لا تُقْبَلُ فيه التَّوبةُ.
وفي هذا الحديثِ يُخبِرُ النَّبيُّ صلَّى اللهُ عليه وسلَّمَ أن مَن تاب في حَياتِه، فأقلَعَ عن المعاصي وعن الذُّنوبِ ولوْ كان مُشرِكًا، فأسْلَمَ ورجَعَ إلى طَريقِ اللهِ، وذلك قَبْلَ أنْ تَطْلُعَ الشَّمسُ مِن مَغرِبِها؛ لأنَّه إذا حَدَثَ ذلك تأكد قُرْبِ قِيامِ السَّاعةِ، وحِينئذٍ لم تَنْفَعِ التَّوبَةُ ولم يَنْفَعِ الإيمانُ! وهذا حَدٌّ لقَبولِ التَّوبَةِ؛ فلا تَزالُ التَّوبةُ مَقبولَةً، حتَّى إذا طَلُعتِ الشَّمسُ مِن مَغرِبِها امتَنَعتِ التَّوبةُ على مَن لم يَكُنْ تاب قَبْلَ ذلك، وهو معنى قولِه تَعالَى: {يَوْمَ يَأْتِي بَعْضُ آيَاتِ رَبِّكَ لَا يَنْفَعُ نَفْسًا إِيمَانُهَا لَمْ تَكُنْ آمَنَتْ مِنْ قَبْلُ أَوْ كَسَبَتْ فِي إِيمَانِهَا خَيْرًا} [الأنعام: 158]، وللتَّوبةِ حَدٌّ آخَرُ؛ وهو أنْ يَتوبَ الإنسانُ قبْلَ غَرْغرةِ الموتِ، وهي وُصولُ الرُّوحِ إلى الحُلقومِ، كما قال تَعالَى: {وَلَيْسَتِ التَّوْبَةُ لِلَّذِينَ يَعْمَلُونَ السَّيِّئَاتِ حَتَّى إِذَا حَضَرَ أَحَدَهُمُ الْمَوْتُ قَالَ إِنِّي تُبْتُ الْآنَ} [النساء: 18].
ولعلَّ الحكمةَ مِن مَنعِ التَّوبةِ عندَ طُلوعِ الشَّمسِ مِن مَغربِها أو عندَ الموتِ: أنَّ النَّاسَ في هذا التَّوقيتِ تَنكشِفُ لهم الحقائقُ، ويُشاهِدون مِن الأهوالِ ما يَلْوي أعناقَهُم إلى الإقرارِ والتَّصديقِ باللهِ وآياتِه، وحُكمُهم في ذلك حُكمُ مَن عايَنَ بأْسَ اللهِ، كما قال تَعالَى: {فَلَمَّا رَأَوْا بَأْسَنَا قَالُوا آمَنَّا بِاللَّهِ وَحْدَهُ وَكَفَرْنَا بِمَا كُنَّا بِهِ مُشْرِكِينَ * فَلَمْ يَكُ يَنْفَعُهُمْ إِيمَانُهُمْ لَمَّا رَأَوْا بَأْسَنَا} [غافر: 84، 85].
وللتَّوبةِ شُروطٌ؛ الأوَّلُ: الإقلاعُ عن المعصيةِ، والثَّاني: النَّدمُ على فِعلِها، والثَّالثُ: العزمُ على ألَّا يَعودَ إليها أبدًا، هذا إنْ كانت في حُقوقِ اللهِ تَعالَى، وإنْ كانت مُتعلِّقةً بحقٍّ مِن حُقوقِ العبادِ، فيُشترَطُ لصِحَّةِ التَّوبةِ أنْ يُؤدِّيَ ذلك الحقَّ إلى صاحبِه، أو يَعفُوَ عنه صاحبُ الحقِّ.
وفي الحديثِ: تَطييبٌ لنُفوسِ العبادِ، وتَنشيطٌ للتَّوبةِ والحثِّ عليها قبْلَ فَواتِ الأوانِ.
وفيه: رَدعٌ عن اليأسِ والقُنوطِ، وأنَّ الذُّنوبَ وإنْ جَلَّت فإنَّ عَفْوَ اللهِ سُبحانه أجَلُّ، وكَرمُه أعظَمُ.
وفيه: بَيانُ أنَّ طُلوعَ الشَّمسِ مِن مَغربِها إحدى عَلاماتِ السَّاعةِ الكُبرى. 
                  """,
    },
    {
      "arabicText": """
عن أبي عبد الرحمن عبد الله بن عمر بن الخطاب رضي الله عنهما عن النبي صلى الله عليه وسلم قال‏:‏ ‏ "‏ إن الله عز وجل يقبل توبة العبد ما لم يغرغر‏"‏ ‏(‏‏(‏رواه الترمذي وقال‏:‏ حديث حسن‏)‏‏)‏‏.‏
                  """,
      "arabicExplanation": """
خلَقَ اللهُ سُبحانَه الخلْقَ وهداهم إلى الخَيرِ والحقِّ، وعرَّفَهم صِفاتِ الشَّرِّ؛ ليجْتنِبوها، ولِعِلْمِه سُبحانَه بضعْفِ خلْقِه فيمَن يقَعُ منهم في فِتَنِ الدُّنيا، فتَحَ لهم بابَ التَّوبةِ.
وفي هذا الحديثِ يُخبِرُ عبدُ اللهِ بنُ عمرَ، أنَّ النَّبيَّ صَلَّى اللهُ عليه وسلَّمَ قال: "إنَّ اللهَ يقبَلُ توبةَ العبْدِ ما لم يُغرْغِرْ"، أي: يقبَلُ مِن عبْدِه التَّوبةَ والرُّجوعَ إلى الحقِّ، والاعترافَ بالذَّنْبِ والتَّبرُّؤَ منه طوالَ حَياتِه، ما دام واعيًا ولم يُدْرِكْه الموتُ، لا أنْ يكونَ في حالةِ الاحتضارِ، ففي هذه الحالةِ لا يقبَلُ اللهُ توبةً؛ وذلك أنَّ العبدَ يَرى ملائكةَ ربِّه، ويتيقَّنُ أنَّه ميِّتٌ، ولا اختيارَ له في العودةِ؛ فإنَّ التَّوبةَ بعدَ التَّيقُّنِ بالموتِ لا يُعتَدُّ بها، فالمُعتبَرُ هو الإيمانُ بالغيبِ، والمُرادُ بالغرْغرةِ، أي: ما لم تبلُغْ رُوحُه حُلْقومَه، فيكونُ بمنزلةِ الشَّيءِ الَّذي يتغرغَرُ به المريضُ، وهذا مِصداقُ قولِه تعالى: {إِنَّمَا التَّوْبَةُ عَلَى اللَّهِ لِلَّذِينَ يَعْمَلُونَ السُّوءَ بِجَهَالَةٍ ثُمَّ يَتُوبُونَ مِنْ قَرِيبٍ فَأُولَئِكَ يَتُوبُ اللَّهُ عَلَيْهِمْ وَكَانَ اللَّهُ عَلِيمًا حَكِيمًا * وَلَيْسَتِ التَّوْبَةُ لِلَّذِينَ يَعْمَلُونَ السَّيِّئَاتِ حَتَّى إِذَا حَضَرَ أَحَدَهُمُ الْمَوْتُ قَالَ إِنِّي تُبْتُ الْآنَ} [النساء: 17، 18].
وفي الحديثِ: بَيان سَعَةِ رَحمةِ اللهِ بخلْقِه.
وفيه: الحثُّ على الإسراعِ إلى التَّوبةِ قبْلَ سَكراتِ الموتِ، التي لا يَدري الإنسانُ متَى تأتِيه. 
                  """,
    },
    {
      "arabicText": """
عن زر بن حبيش قال‏:‏ أتيت صفوان بن عسال رضي الله عنه أسأله عن المسح على الخفين فقال‏:‏ ما جاء بك يازر‏؟‏ فقلت‏:‏ ابتغاء العلم، فقال‏:‏ إن الملائكة تضع أجنحتها لطالب العلم رضي بما يطلب، فقلت‏:‏ من أصحاب النبي صلى الله عليه وسلم ، فجئت أسألك‏:‏ هل سمعته يذكر في ذلك شيئاً‏؟‏ قال‏:‏ نعم، كان يأمرنا إذا كنا سفراً- أو مسافرين- أن لا ننزع خفافناً ثلاثة أيام ولياليهن إلا من جنابة، ولكن من غائط وبول ونوم‏.‏ فقلت‏:‏ سفر، فبينا نحن عنده إذ ناداه أعرابى بصوت له جهورى‏:‏ يا محمد، فأجابه رسول الله صلى الله عليه وسلم نحواً من صوته‏:‏ ‏"‏هاؤم‏"‏ فقلت له‏:‏ ويحك اغضض من صوتك فإنك عند النبي صلى الله عليه وسلم ، وقد نهيت عن هذا‏!‏ فقال‏:‏ والله لا أغضض‏.‏ قال الأعرابى‏:‏ المرء يحب القوم ولما يلحق بهم‏؟‏ قال النبي صلى الله عليه وسلم‏:‏ ‏"‏ المرء مع من أحب يوم القيامة‏"‏ فما زال يحدثنا حتى ذكر باباً من المغرب مسيرة عرضه أو يسير الراكب في عرضه أربعين أو سبعين عاماً‏.‏ قال سفيان أحد الرواة قبل الشام خلقه الله تعالى يوم خلق السماوات والأرض مفتوحاً للتوبة لا يغلق حتى تطلع الشمس منه‏"‏ ‏(‏‏(‏رواه الترمذي وغيره وقال‏:‏ حديث حسن صحيح‏)‏‏)‏‏.‏
                  """,
      "arabicExplanation": """
كان التَّابعونَ رَضيَ اللهُ عنهم يَحرِصونَ كُلَّ الحِرْصِ على تَعلُّمِ أمورِ الدِّينِ وسُنَّةِ النبيِّ صلَّى اللهُ عليه وسلَّم مِنَ الصَّحابةِ رِضوانُ اللهِ عليهم، فكانوا يأتونهم فيَسألونَهم ويَسْتفتونَهم فيُفتونَهم ويُعلِّمونَهم.
وفي هذا الحديثِ يقولُ التَّابِعيُّ الجليلُ زِرُّ بنُ حُبيشٍ: "أَتيتُ صَفوانَ بنَ عسَّالٍ المُراديَّ، أَسْألُهُ عَنِ المَسْحِ على الخُفَّينِ"، أي: ذَهْبتُ إلى الصحابيِّ الجليلِ صَفوانَ بنِ عسَّالٍ لكي أَسْألَه عن حُكْمِ المَسْحِ على الخُفَّينِ، "فقال: ما جاء بك يا زِرُّ؟"، أي: ما سببُ مَجيئكَ يا زِرُّ؟ "فقلتُ: ابْتِغاءُ العِلْمِ"، أي: فقال زِرٌّ: جئتُ أَطْلُبُ مِنْكَ العِلْمَ، فقال صفوانُ: "إنَّ الملائكةَ لَتَضَعُ أَجْنحتَها لطالبِ العِلْمِ رِضًا بما يَطْلُبُ"، أي: إنَّ الملائكةَ تَفْتَرِشُ أَجْنحتَها لِمَنْ يَطْلُبُ العِلْمَ وتَجْعَلُ أَجْنحتَها فِراشًا له مِنْ شِدَّةِ رِضاهُمْ عنهُ لطَلَبِهِ العِلْمَ، وقيل: تَفْعَلُ الملائكةُ ذلك تَواضُعًا لطالبِ العِلْمِ، وتعظيمًا لشأنِهِ وإجلالًا له، وقيل: المعنى على الحقيقةِ؛ حيثُ إنَّ الملائكةَ تَضَعُ أَجْنحتَها وتَنْزلُ لاسْتِماعِ العِلْمِ.
قال زِرٌّ: "فقلتُ: إنَّه حَكَّ في صَدْرِي المُسْحُ على الخُفَّينِ بَعْدَ الغائطِ والبَولِ"، أي: إنِّي شَككتُ في أَمْرِ المَسْحِ على الخُفَّينِ بَعْدَ التَّبرُّزِ أو التَّبوُّلِ؛ فهَلْ هو جائزٌ بَعْدَ التَّبرُّزِ أو التَّبوُّلِ أَمْ لا؟ "وكنتَ امرأً مِنْ أصحابِ النبيِّ صلَّى اللهُ عليه وسلَّم"، أي: وكنتَ أنتَ يا صفوانُ مِنَ الذين عاصَروا النبيَّ صلَّى اللهُ عليه وسلَّم وتعلَّموا منه وأَخَذوا منه الدِّينَ والعِلْمَ، "فجئتُ أَسْألُكَ: هل سَمِعتَه يَذْكُرُ في ذلك شيئًا؟"، أي: وحضرتُ إليكَ يا صفوانُ؛ لكي أَسْألَكَ هل سَمِعتَ مِنَ النبيِّ صلَّى اللهُ عليه وسلَّم شيئًا في المَسْحِ على الخُفَّينِ؟ "قال: نَعَمْ"، أي: قال صفوانُ: نَعَمْ، سَمِعتُ مِنَ النبيِّ صلَّى اللهُ عليه وسلَّم في المَسْحِ على الخُفَّينِ شيئًا؛ قال: "كان يَأمُرُنا إذا كُنَّا سَفَرًا - أو مُسافِرينَ - ألَّا نَنْزعَ خِفافَنا ثلاثةَ أيامٍ ولياليَهنَّ إلَّا مِنْ جَنابةٍ"، أي: كان النبيُّ صلَّى اللهُ عليه وسلَّم يَأْمُرُنا إذا كُنَّا مُسافِرينَ أَنْ نَمْسَحَ على الخُفَّينِ لمُدَّةِ ثلاثةِ أيَّامٍ بلياليهِنَّ ولا نَخْلعهما إلَّا إذا أصابتْ أَحَدَنا جَنابةٌ فأرادَ أنْ يَغْتَسِلَ خَلَعَ خُفَّيهِ واغْتَسَلَ، "لكِنْ مِنْ غائطٍ وبولٍ ونومٍ"، أي: ولَمْ يأمُرْنا النبيُّ صلَّى اللهُ عليه وسلَّم أنْ نَخْلَعَ الخُفَّينِ بَعْدَ التَّبرُّزِ أو التَّبوُّلِ أو النَّومِ، ولكِنْ نَمْسَحُ عليهِما ولا نَخْلعُهما.
"قال فقُلْتُ: هَلْ سَمِعتَهُ يَذْكُرُ في الهوى شيئًا"، أي: قال زِرٌّ لصَفوانَ سائلًا إيَّاه: هَلْ سَمِعتَ النبيَّ صلَّى اللهُ عليه وسلَّم يتكلَّمُ عَنِ الحُبِّ أو يَذْكُرُ فيه شيئًا؟ "قال: نَعَمْ"، أي: قال صفوانُ: نَعَمْ، سَمِعتُ مِنَ النبيِّ صلَّى اللهُ عليه وسلَّم حديثًا عَنِ الحُبِّ، كُنَّا مَعَ رسولِ اللهِ صلَّى اللهُ عليه وسلَّم في سَفَرٍ "فبينا نَحْنُ عِنْدَهُ"، أي: فبينما نحن عِنْدَ رسولِ اللهِ صلَّى اللهُ عليه وسلَّم، "إذْ ناداهُ أعرابيٌّ بصوتٍ له جَهْوَرِيٍّ: يا مُحمَّدُ"، أي: جاء أعرابيٌّ من البَدْوِ الذين يَسْكنونَ الصَّحراءَ فنَادى على النبيِّ صلَّى اللهُ عليه وسلَّم بصوتٍ عالٍ ومُرْتَفِعٍ فقال: يا مُحمَّدُ، "فأَجابَهُ رَسولُ اللهِ صلَّى اللهُ عليه وسلَّم نحوًا مِنْ صوتِهِ"، أي: فرَدَّ النبيُّ صلَّى اللهُ عليه وسلَّم على الأعرابيِّ بصوتٍ عالٍ ومُرْتَفِعٍ مِثْلِ الصَّوتِ الذي ناداهُ به، وهذا مِن حُسنِ خُلُقِه وجميلِ شَمائِلِه صلَّى الله عليه وسلَّم، وقال له: "هاؤُم"، أي: تَعالَ أنا هُنا، "فقُلْنا له: اغْضُضْ مِنْ صوتِكَ؛ فإنَّكَ عِنْدَ النبيِّ صلَّى اللهُ عليه وسلَّم، وقد نُهيتَ عن هذا"، أي: فقال الصَّحابةُ للأعرابيِّ: اخْفِضْ صوتَكَ؛ فإنَّكَ عِنْدَ النبيِّ صلَّى اللهُ عليه وسلَّم ولا يَجوزُ رَفْعُ الصَّوتِ عِنْدَ النبيِّ صلَّى اللهُ عليه وسلَّم؛ فإنَّ اللهَ قَدْ نَهى المؤمنينَ عن ذلك حيثُ قال: {يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَرْفَعُوا أَصْوَاتَكُمْ فَوْقَ صَوْتِ النَّبِيِّ وَلَا تَجْهَرُوا له بِالْقَوْلِ كَجَهْرِ بَعْضِكُمْ لِبَعْضٍ أَنْ تَحْبَطَ أَعْمَالُكُمْ وَأَنْتُمْ لَا تَشْعُرُونَ} [الحجرات: 2]، "فقال: واللهِ لا أَغْضُضُ"، أي: فقال الأعرابيُّ للصحابةِ رَضيَ اللهُ عنهم: واللهِ لَنْ أَخْفِضَ صَوْتي، "قال الأعرابيُّ: المرءُ يُحِبُّ القومَ ولَمَّا يَلْحَقْ بِهم"، أي: سأل الأعرابيُّ النبيَّ صلَّى اللهُ عليه وسلَّم عَنِ الرَّجُلِ يُحِبُّ أُناسًا في اللهِ ولا يَستطيعُ أنْ يَعْمَلَ بِمِثْلِ أعمالِهم مِنْ أبوابِ الخيرِ، ويُريدُ أنْ يَكونَ مَعَهُم يومَ القيامةِ في دَرَجتِهِمْ، ولا يُريدُ أنْ يُفرَّقَ بَيْنَه وبين أحِبَّتِهِ، "قال النبيُّ صلَّى اللهُ عليه وسلَّم: المرءُ مَعَ مَنْ أَحَبَّ يومَ القيامةِ"، أي: قال النبيُّ صلَّى اللهُ عليه وسلَّم للأعرابيِّ مُجيبًا له: المرءُ يكونُ مَعَ أَحِبَّتِهِ يومَ القيامةِ وإنْ لَمْ يَعْمَلْ بمِثْلِ أعمالِهِمْ.
قال زِرُّ بنُ حُبيشٍ: "فما زال يُحدِّثنا"، أي: فما زال صفوانُ بنُ عسَّالٍ يُحدِّثُنا عَنِ النبيِّ صلَّى اللهُ عليه وسلَّم، "حتَّى ذَكَرَ بابًا مِنَ قِبَلَ المَغْرِبِ مَسيرةُ عَرْضِهِ، أو يَسيرُ الرَّاكِبُ في عَرْضِهِ أربعينَ أو سبعينَ عامًا"، أي: حتَّى ذَكَرَ صفوانُ حديثًا عَنِ النبيِّ صلَّى اللهُ عليه وسلَّم وذَكَرَ فيه أنَّ عِنْدَ مَغْرِبِ الشَّمْسِ بابًا للتَّوبةِ عَرْضُهُ مسيرةُ أربعينَ أو سبعينَ سَنَةً، "قال سُفيانُ" أَحَدُ رُواةِ الإسنادِ: "قِبَلَ الشَّامِ خَلَقَهُ اللهُ يومَ خَلَقَ السَّمواتِ والأرضَ مفتوحًا، يَعْني: للتَّوبةِ لا يُغْلَقُ حتَّى تَطْلُعَ الشَّمْسُ منه"، أي: هذا البابُ مِنْ ناحيةِ الشَّامِ، وقَدْ خَلَقَهُ اللهُ يومَ خَلَقَ السَّمواتِ والأرضَ، وجَعَله مَفْتوحًا للتَّوبةِ لا يُغْلَقُ أبدًا حتَّى تَطْلُعَ الشَّمْسُ منه، فإذا طَلَعَتْ منه فَقَدَ ذَهَبَ زمنُ التَّوبةِ، ولا يَقْبَلُ اللهُ تَوبةَ أَحَدٍ بَعْدَها.
وفي الحديث: فَضلُ طلبِ العِلمِ، وعِظَمُ منزلةِ طالبِ العِلمِ، واحتفاءُ الملائكةِ بطالبِ العلمِ.
وفيه: بيانُ حِرصِ التابعينَ على طَلبِ العِلمِ مِن الصَّحابةِ رضِيَ اللهُ عنهم.

                  """,
    },
    {
      "arabicText": """
عن أبي سعيد سعد بن مالك بن سنان الخدري رضي الله عنه أن نبي الله صلى الله عليه وسلم قال‏:‏ ‏ "‏ كان فيمن كان قبلكم رجل قتل تسعة وتسعين نفساً، فسأل عن أعلم أهل الأرض، فدل على راهب، فأتاه فقال‏:‏ إنه قتل تسعه وتسعين نفساً، فهل له من توبة‏؟‏ فقال‏:‏ لا، فقتله فكمل به مائةً، ثم سأل عن أعلم أهل الأرض، فدل على رجل عالم فقال‏:‏ إنه قتل مائة نفس فهل له من توبة‏؟‏ فقال‏:‏ نعم، ومن يحول بينه وبين التوبة‏؟‏ انطلق إلى أرض كذا وكذا، فإن بها أناساً يعبدون الله تعالى فاعبد الله معهم، ولا ترجع إلى أرضك فإنها أرض سوءٍ، فانطلق حتى إذا نصف الطريق أتاه الموت، فاختصمت فيه ملائكة الرحمة وملائكة العذاب‏.‏ فقالت ملائكة الرحمة‏:‏ جاء تائبا مقبلا بقلبه إلى الله تعالى، وقالت ملائكة العذاب‏:‏ إنه لم يعمل خيرا قط، فأتاهم ملك في صورة آدمي فجعلوه بينهم- أي حكماً- فقال‏:‏ قيسوا ما بين الأرضين فإلى أيتهما كان أدنى فهو له، فقاسوا فوجدوه أدنى إلى الأرض التي أراد، فقبضته ملائكة الرحمة‏"‏ ‏(‏‏(‏متفق عليه‏)‏‏)
                  """,
      "arabicExplanation": """
رَحمةُ اللهِ وَسِعَتْ كُلَّ شَيءٍ، ومِن رَحمَتِه أنَّه فَتَحَ بابَ التَّوبةِ لِعِبادِه باللَّيلِ والنَّهارِ، وحرَّمَ القُنوطَ واليأسَ مِن رَحمتِه.
وفي هذا الحديثِ يُخبِرُ صلَّى اللهُ عليه وسلَّمَ أنَّ رجُلًا مِن بَني إسرائيلَ كان قدْ قتَلَ تِسعًا وتِسعينَ إنسانًا بغَيرِ حقٍّ، فأراد التَّوبةَ، فجاء إلى راهبٍ، أي: عابدٍ مِن النَّصارى -وفي ذلك إشعارٌ بأنَّ ذلك وَقَعَ بعْدَ رفْعِ عِيسى عليه السَّلامُ؛ فإنَّ الرَّهبانيَّةَ إنَّما ابتَدَعها أتباعُه- فسَأَلَه عن التَّوبةِ، فقال له: لَيس لك توبةٌ، وقد وَقَعَ هذا الرَّاهبُ في خَطأَينِ: الأوَّلُ: أنَّه ضيَّقَ رَحمةَ اللهِ، والثَّاني: أنَّه أفْتى بغَيرِ عِلمٍ. فقتَلَه الرَّجلُ وأكمَلَ بقَتْلِه المئةَ نفْسٍ.
فلمْ يَيَئسْ، بلْ جَعَلَ يَسأَلُ مرَّةً أُخرى، إلى أنْ جاء إلى عالِمٍ مِن العُلماءِ، فسَأَلَه عن التَّوبةِ، فقال له العالِمُ: لا يَمنَعُك مِن التَّوبةِ شَيءٌ، وأمَرَه أنْ يَذهَبَ إلى قَريةٍ مُعيَّنةٍ، يُعبَدُ فيها اللهُ عزَّ وجلَّ، وكانت قَريتُه قَريةَ سَوْءٍ، فمات الرَّجُلُ في طَريقِه، ومِن رَحمةِ اللهِ عزَّ وجلَّ به أنَّه عِندما حَضَرَته الوفاةُ ناءَ بصَدْرِه، أي: مالَ بصَدْرِه مُقترِبًا مِن القَريةِ الصَّالحةِ التي تَوجَّهَ إليها للتَّوبةِ، ومُبتعِدًا عن قَريةِ السَّوءِ التي خَرَجَ منها.
فلمَّا مات تَخاصَمَتْ فيه -أي: تَنازَعَتْ- مَلائكةُ الرَّحمةِ ومَلائكةُ العذابِ، وزاد في رِوايةِ مُسلمٍ: أنَّ مَلائكةَ العَذابِ قالت: إنَّه لم يَفعَلْ خَيرًا قطُّ، ومَلائكةَ الرَّحمةِ قالت: إنَّه أَقبَل على اللهِ تائبًا، فحَكَّموا بيْنهما واحدًا، وهو مَلَكٌ أرْسَلَه اللهُ عزَّ وجلَّ إليهم في صُورةِ آدمِيٍّ، فقال لهم: قِيسُوا بيْن الأَرْضَينِ؛ القَريةِ الَّتي خَرَج منها، والقريةِ الَّتي كان ذاهبًا إليها؛ فإنْ كان أقرَبَ للَّتي خرَج منها أخَذَتْه مَلائكةُ العذابِ، وإنْ كان أقرَبَ للقريةِ الَّتي كان ذاهبًا إليها أخَذَتْه مَلائكةُ الرَّحمةِ. فأَوحَى اللهُ إلى أرضِ القَريةِ الَّتي كان ذاهبًا إليها: أنْ تَقرَّبي، فتَقارَبَتْ، وأَوحَى إلى الأُخرى: أنْ تَباعَدي، فتباعَدَتْ، وهذا مِن سَعةِ رَحمةِ اللهِ عزَّ وجلَّ بعِبادِه، فوَجَدوه أقرَبَ إلى القريةِ الَّتي كان ذاهبًا إليها بشِبرٍ واحدٍ فقطْ، فأخَذَتْه مَلائكةُ الرَّحمةِ، ولا يُعارَضُ هذا بما هو مُقرَّرٌ مِن أنَّ حُقوقَ العبادِ لا تَسقُطُ إلَّا باستيفائِها؛ فاللهُ تعالَى إذا رَضيَ عن المذنِبِ وقَبِل تَوبتَه، يُرْضِي عنه خَصْمَه.
وفي الحديثِ: حثُّ المُذْنبينَ على التَّوبةِ، ومَنْعُهم مِن اليَأسِ مِن رَحمةِ اللهِ تعالَى.
وفيه: بَيانُ فضْلِ العالِمِ على العابِدِ.
وفيه: أنَّ مِن أعظمِ أسبابِ المعصيةِ الصُّحبةَ السَّيِّئةَ وخُلطةَ أهلِ السُّوءِ، وأنَّ مِن أعظمِ أسبابِ الطاعةِ صُحبةَ المُطِيعينَ وخُلْطتَهم.
وفيه: سَعةُ فَضلِ اللهِ تعالَى وعَظيمُ رَحمتِه بالتَّائبِ.

                  """,
    },
    {
      "arabicText": """
عن عبد الله بن كعب بن مالك، وكان قائد كعب رضي الله عنه من بنيه حين عمي قال‏:‏ سمعت كعب بن مالك رضي الله عنه يحدث بحديثه حين تخلف عن رسول الله صلى الله عليه وسلم في غزوة تبوك‏.‏ قال كعب‏:‏ لم اتخلف عن رسول الله، صلى الله عليه وسلم ، في غزوة غزاها قط إلا في غزوة تبوك، غير أني قد تخلفت في غزوة بدر، ولم يعاتب أحد تخلف عنه، إنما خرج رسول الله صلى الله عليه وسلم والمسلمون يريدون عير قريش حتى جمع الله تعالى بينهم وبين عدوهم على غير ميعاد‏.‏ ولقد شهدت مع رسول الله صلى الله عليه وسلم ليلة العقبة حين تواثقنا على الإسلام، وما أحب أن لي بها مشهد بدرٍ، وإن كانت بدر أذكر في الناس منها‏.‏

وكان من خبري حين تخلف عن رسول الله، صلى الله عليه وسلم، في غزوة تبوك أني لم أكن قط أقوى ولا أيسر مني حين تخلفت عنه في تلك الغزوة، والله ما جمعت قبلها راحلتين قط حتى جمعتهما في تلك الغزوة، ولم يكن رسول الله صلى الله عليه وسلم يريد غزوة إلا ورى بغيرها حتى كانت تلك الغزوة، فغزاها رسول الله صلى الله عليه وسلم في حر شديد، واستقبل سفراً بعيداً ومفازاً، واستقبل عدداً كثيراً، فجلى للمسلمين أمرهم ليتأهبوا أهبة غزوهم فأخبرهم بوجههم الذي يريد، والمسلمون مع رسول الله كثير ولا يجمعهم كتاب حافظ ‏"‏يريد بذلك الديوان‏"‏ قال كعب‏:‏ فقل رجل يريد أن يتغيب إلا ظن أن ذلك سيخفى به مالم ينزل فيه وحي من الله، وغزا رسول الله صلى الله عليه وسلم تلك الغزوة حين طابت الثمار والظلال فأنا إليها أصعر فتجهز رسول الله صلى الله عليه وسلم والمسلمون معه، وطفقت أغدو لكي أتجهز معه، فأرجع ولم أقض شيئاً، وأقول في نفسي‏:‏ أنا قادر على ذلك إذا أردت، فلم يزل يتمادى بي حتى استمر بالناس الجد، فأصبح رسول الله صلى الله عليه وسلم غادياً والمسلمون معه، ولم أقض من جهازي شيئاً، ثم غدوت فرجعت ولم أقض شيئاً، فلم يزل يتمادى بي حتى أسرعوا وتفارط الغرو، فهممت أن أرتحل فأدركهم، فياليتني فعلت، ثم لم يقدر ذلك لي، فطفقت إذا خرجت في الناس بعد خروج رسول الله صلى الله عليه وسلم يحزنني أني أرى لي أسوة، إلا رجلاً مغموصاً عليه في النفاق، أو رجلاً ممن عذر الله تعالى من أسوة، إلا رجلاً مغموصاً عليه في النفاق، أو رجلاً ممن عذر الله تعالى من الضعفاء، ولم يذكرني رسول الله صلى الله عليه وسلم حتى بلغ تبوك، فقال وهو جالس في القوم بتبوك‏:‏ ما فعل كعب بن مالك‏؟‏ قَالَ رَجُلٌ مِنْ بَنِي سَلِمَةَ يَا رَسُولَ اللَّهِ حَبَسَهُ بُرْدَاهُ وَالنَّظَرُ فِي عِطْفَيْهِ.فقال له معاذ بن جبل رضي الله عنه بئس ما قلت‏!‏ والله يارسول الله ما علمنا عليه إلا خيراً ، فسكت رسول الله صلى الله عليه وسلم فبينا هو على ذلك رأى رجلا مبيضا يزول به السراب فقال رسول الله صلى الله عليه وسلم‏:‏ كن أبا خيثمة، فإذا أبو خيثمة الأنصاري وهو الذي تصدق بصاع التمر حين لمزه المنافقون، قال كعب‏:‏ فلما بلغني أن رسول الله صلى الله عليه وسلم قد توجه قافلاً من تبوك حضرني بثي، فطفقت أتذكر الكذب وأقول‏:‏ بم أخرج من سخطه غداً وأستعين على ذلك بكل ذي رأى من أهلي، فلما قيل‏:‏ إن رسول الله صلى الله عليه وسلم قد أظل قادماً زاح عني الباطل حتى عرفت أني لم أنج منه بشيء أبداً، فأجمعت صدقه، وأصبح رسول الله صلى الله عليه وسلم قادماً، وكان إذا قدم من سفر بدأ بالمسجد فركع فيه ركعتين ثم جلس للناس، فلما فعل فعل ذلك جاءه المخلفون يعتذرون إليه ويحلفون له، وكانوا بضعا وثمانين رجلاً فقبل منهم علانيتهم وبايعهم واستغفر لهم ووكل سرائرهم إلى الله تعالى حتى جئت‏.‏ فلما سلمت تبسم تبسم المغضب ثم قال‏:‏ تعال، فجئت أمشي حتى جلست بين يديه، فقال لي‏:‏ ما خلفك‏؟‏ ألم تكن قد ابتعت ظهرك‏!‏ قال قلت‏:‏ يارسول الله إني والله لو جلست عند غيرك من أهل الدنيا لرأيت أني سأخرج من سخطه بعذر، لقد أعطيت جدلاً، ولكنني والله لقد علمت لئن حدثتك اليوم حديث كذب ترضي به ليوشكن الله يسخطك علي، وإن حدثتك حديث صدق تجد علي فيه إني لأرجو فيه عقبى الله عز وجل، والله ما كان لي من عذر، والله ما كنت قط أقوى ولا أيسر مني حين تخلفت عنك‏.‏ قال‏:‏ فقال رسول الله صلى الله عليه وسلم ‏"‏ أما هذا فقد صدق، فقم حتى يقضي الله فيك‏"‏ وسار رجال من بني سلمة فاتبعوني، فقالوا لي‏:‏ والله ما علمناك أذنبت ذنبا قبل هذا، لقد عجزت في أن لا يكون اعتذرت إلى رسول الله صلى الله عليه وسلم بما اعتذر إليه المخلفون فقد كان كافيك ذنبك استغفار رسول الله صلى الله عليه وسلم لك‏.‏ قال‏:‏ فوالله ما زالوا يؤنبونني حتى أردت أن أرجع إلى رسول الله صلى الله عليه وسلم فأكذب نفسي، ثم قلت لهم‏:‏ هل لقي هذا معي من أحد‏؟‏ قالوا‏:‏ نعم لقيه معك رجلان قالا مثل ما قلت، وقيل لهما مثل ما قيل لك، قال قلت‏:‏ من هما‏؟‏ قالوا‏:‏ مرارة بن الربيع العمري، وهلال بن أمية الواقفي‏؟‏ قال‏:‏ فذكروا لي رجلين صالحين قد شهدا بدراً فيهما أسوة‏.‏ قال‏:‏ فمضيت حين ذكروهما لي‏.‏ ونهى رسول صلى الله عليه وسلم عن كلامنا أيها الثلاثة من بين من تخلف عنه، قال‏:‏ فاجتنبنا الناس- أو قال‏:‏ تغيروا لنا- حتى تنكرت لي في نفس الأرض، فما هي بالأرض التي أعرف، فلبثنا على ذلك خمسين ليلة‏.‏ فأما صاحباي فاستكانا وقعدا في بيوتهما يبكيان، وأما أنا فكنت أشب القوم وأجلدهم، فكنت أخرج فأشهد الصلاة مع المسلمين، وأطوف في الأسواق ولا يكلمني أحد، وآتي رسول الله صلى الله عليه وسلم فأسلم عليه، وهو في مجلسه بعد الصلاة، فأقول في نفسي ‏:‏ هل حرك شفتيه برد السلام أم ‏؟‏ ثم أصلي قريباً منه وأسارقه النظر، فإذا أقبلت على صلاتي نظر إلي، وإذا التفت نحوه أعرض عني، حتى إذا طال ذلك علي من جفوة المسلمين مشيت حتى تسورت جدار حائط أبي قتادة وهو ابن عمي وأحب الناس إلي، فسلمت عليه فوالله ما ردّ علي السلام، فقلت له‏:‏ يا أبا قتادة أنشدك بالله هل تعلمني أُحب الله ورسوله صلى الله عليه وسلم ‏؟‏ فسكت، فعدت فناشدته فسكت، فعدت فناشدته فقال‏:‏ الله ورسوله أعلم‏.‏ ففاضت عيناي، وتوليت حتى تسورت الجدار، فبينما أنا أمشى في سوق المدينة إذا نبطى من نبط أهل الشام ممن قدم بالطعام ببيعه بالمدينة يقول‏:‏ من يدل على كعب بن مالك‏؟‏ فطفق الناس يشيرون له إلي حتى جاءنى فدفع إلي كتاب من ملك غسان، وكنت كاتباً‏.‏ فقرأته فإذا فيه‏:‏ أما بعد فإنه قد بلغنا أن صاحبك قد جفاك، ولم يجعلك الله بدار هوان ولا مضيعة، فالحق بنا نواسك، فقلت حين قرأتها، وهذه أيضاً من البلاء فتيممت بها التنور فسجرتها، حتى إذا مضت أربعون من الخمسين واستلبث الوحى إذا رسول رسول الله صلى الله عليه وسلم يأتينى، فقال‏:‏ إن رسول الله صلى الله عليه وسلم يأمرك أن تعتزل امرأتك، فقلت‏:‏ أطلقها، أم ماذا أفعل‏؟‏ قال‏:‏ لا، بل اعتزلها فلا تقربنها، وأرسل إلى صاحبي بمثل ذلك‏.‏ فقلت لامرأتي‏:‏ ألحقي بأهلك فكوني عندهم حتى يقضي الله في هذا الأمر، فجاءت امرأة هلال بن أمية رسول الله صلى الله عليه وسلم فقالت له ‏:‏ يا رسول الله إن هلال بن أمية شيخ ضائع ليس له خادم، فهل تكره أن أخدمه‏؟‏ قال ‏:‏ لا، ولكن لا يقربنك‏.‏ فقالت‏:‏ إنه والله ما به من حركة إلى شيء، ووالله ما زال يبكي منذ كان من أمره ما كان إلى يومه هذا‏.‏ فقال لي بعض أهلي‏:‏ لو استأذنت رسول الله صلى الله عليه وسلم في امرأتك، فقد أذن لامرأة هلال بن أمية أن تخدمه‏؟‏ فقلت‏:‏ لا أستأذن فيها رسول الله صلى الله عليه وسلم، وما يدريني ماذا يقول رسول الله صلى الله عليه وسلم، إذا استأذنته فيها وأنا رجل شاب‏!‏ فلبثت بذلك عشر ليالٍ، فكمل لنا خمسون ليلة من حين نهى عن كلامنا‏.‏ ثم صليت صلاة الفجر صباح خمسين ليلة على ظهر بيت من بيوتنا، فبينما أنا جالس على الحال التى ذكر الله تعالى منا، قد ضافت علي نفسي وضاقت علي الأرض بما رحبت، سمعت صوت صارخ أوفى على سلع يقول بأعلى صوته‏:‏ يا كعب بن مالك أبشر فخررت ساجداً، وعرفت أنه قد جاء فرج‏.‏ فآذن رسول الله صلى الله عليه وسلم الناس بتوبة الله عز وجل علينا حين صلى صلاة الفجر فذهب الناس يبشروننا، فذهب قبل صاحبي مبشرون، وركض رجل إلي فرساً وسعى ساع من أسلم قبلي وأوفى على الجبل، فكان الصوت أسرع من الفرس، فلما جاءني الذى سمعت صوته يبشرني نزعت له ثوبي فكسوتهما إياه ببشراه، والله ما أملك غيرهما يومئذ، واستعرت ثوبين فلبستهما وانطلقت أتأمم رسول الله صلى الله عليه وسلم يتلقانى الناس فوجاً فوجاً يهنئوني بالتوبة ويقولون لي‏:‏ لتهنك توبة الله عليك، حتى دخلت المسجد فإذا رسول الله صلى الله عليه وسلم جالس حوله الناس، فقام طلحة بن عبيد الله رضي الله عنه يهرول حتى صافحني وهنأني، والله ما قام رجل من المهاجرين غيره، فكان كعب لا ينساها لطلحة‏.‏ قال كعب‏:‏ فلما سلمت على رسول الله صلى الله عليه وسلم قال‏:‏ وهو يبرق وجهه من السرور ‏:‏ أبشر بخير يوم مرّ عليك مذ ولدتك أمك، فقلت‏:‏ أمن عندك يا رسول الله أم من عند الله‏؟‏ قال ‏:‏ لا ، بل من عند الله عز وجل، وكان رسول الله صلى الله عليه وسلم إذا سر استنار وجهه حتى كأن وجهه قطعة قمر، وكنا نعرف ذلك منه، فلما جلست بين يديه قلت‏:‏ يا رسول الله إن من توبتي أن أنخلع من مالي صدقة‎ إلى الله وإلى رسوله‏.‏ فقال رسول الله صلى الله عليه وسلم ‏:‏ أمسك عليك بعض مالك فهو خير لك، فقلت‏:‏ إني أمسك سهمي الذى بخيبر‏.‏ وقلت‏:‏ يا رسول الله إن الله تعالى إنما أنجاني بالصدق، وإن من توبتي أن لا أحدثَ إلا صدقاً ما بقيت ، فو الله ما علمت أحداً من المسلمين أبلاه الله في صدق الحديث منذ ذكرت ذلك لرسول الله صلى الله عليه وسلم أحسن مما أبلاني الله تعالى ، والله ما تعمدت كذبة منذ قلت ذلك لرسول الله صلى الله عليه وسلم إلى يومي هذا، وإني لأرجو أن يحفظني الله تعالى فيما بقي، قال‏:‏ فأنزل الله تعالى‏:‏ ‏{‏لقد تاب الله على النبي والمهاجرين والأنصار الذين اتبعوه في ساعة العسرة‏)‏ حتى بلغ‏:‏ ‏{‏إنه بهم رؤوف رحيم ‏.‏ وعلى الثلاثة الذين خلفوا حتى إذا ضاقت عليهم الأرض بما رحبت‏}‏ حتى بلغ ‏:‏ ‏{‏اتقوا الله وكونوا مع الصادقين‏}‏ ‏(‏‏(‏التوبة 117، 119‏)‏‏)‏ قال كعب ‏:‏ والله ما أنعم الله علي من نعمة قط بعد إذ هداني الله للإسلام أعظم في نفسي من صدقي رسول الله صلى الله عليه وسلم أن لا أكون كذبته، فأهلك كما هلك الذين كذبوا، إن الله تعالى قال للذين كذبوا حين أنزل الوحي شر ما قال لأحد، فقال الله تعالى ‏:‏ ‏{‏سيحلفون بالله لكم إذا انقلبتم إليهم لتعرضوا عنهم فأعرضوا عنهم إنهم رجس ومأواهم جهنم جزاء بما كانوا يكسبون يحلفون لكم لترضوا عنهم فإن ترضوا عنهم فإن الله لا يرضى عن القوم الفاسقين‏}‏ ‏(‏‏(‏التوبة‏:‏ 95،96‏)‏‏)‏ ‏.‏

قال كعب ‏:‏ كنا خلفنا أيها الثلاثة عن أمر أولئك الذين قبل منهم رسول الله صلى الله عليه وسلم حين حلفوا له ، فبايعهم واستغفر لهم، وأرجأ رسول الله صلى الله عليه وسلم أمرنا حتى قضى الله تعالى فيه بذلك، قال الله تعالى ‏:‏ ‏{‏وعلى الثلاثة الذين خلفوا‏}‏ وليس الذي ذكر مما خلفنا تخلفنا عن الغزو، وإنما هو تخليفه إيانا وإرجاؤه أمرنا عمن حلف له واعتذر إليه فقبل منه‏.‏ متفق عليه‏.‏

وفى رواية ‏"‏أن النبي صلى الله عليه وسلم خرج في غزوة تبوك يوم الخميس، وكان يحب أن يخرج يوم الخميس‏"‏

وفى رواية‏:‏ ‏"‏وكان لا يقدم من سفر إلا نهاراً في الضحى، فإذا قدم بدأ بالمسجد فصلى فيه ركعتين ثم جلس فيه‏"‏ ‏.‏
                  """,
      "arabicExplanation": """
أمَرَ اللهُ عزَّ وجلَّ بالصِّدقِ، وجعَلَ النَّجاةَ في الدُّنْيا والآخِرةِ مَنوطةً به، حتَّى وإنْ بَدا في ظاهِرِ الأمْرِ أنَّ فيه الهَلاكَ لصاحِبِه، وحرَّمَ الكَذِبَ، وجعَلَه طَريقَ الخُسرانِ والبَوارِ في الدُّنْيا والآخِرةِ، حتَّى وإنْ بَدا في ظاهِرِ الأمْرِ أنَّ فيه النَّجاةَ.
وفي هذا الحَديثِ يَرْوي عَبدُ اللهِ بنُ كَعبِ، عن أبيه كَعبِ بنِ مالِكٍ رَضيَ اللهُ عنه قصَّةَ تَخلُّفِه عن غَزْوةِ تَبوكَ، وكان كَعبُ بنُ مالكٍ رَضيَ اللهُ عنه قدْ كُفَّ بَصَرُه في آخِرِ حَياتِه، وكان ولَدُه عَبدُ اللهِ قائدَه، وغَزْوةُ تَبوكَ آخِرُ غَزْوةٍ خرَجَ فيها رَسولُ اللهِ صلَّى اللهُ عليه وسلَّمَ بنفْسِه، وكانت في رجَبٍ سَنةَ تِسعٍ مِن الهِجْرةِ، وكانت معَ الرُّومِ، وتَبوكُ في أقْصى شَمالِ الجَزيرةِ العَربيَّةِ، وتقَعُ في شَمالِ المَدينةِ على بُعدِ 700 كم.
ويَحْكي كَعبُ بنُ مالِكٍ رَضيَ اللهُ عنه أنَّه لم يكُنْ مِن عادَتِه التَّخلُّفُ عنِ الجِهادِ؛ فهو رَضيَ اللهُ عنه قدْ حضَرَ جَميعَ غَزَواتِ الرَّسولِ صلَّى اللهُ عليه وسلَّمَ، ولم يتغَيَّبْ عن غَزْوةٍ منها عَدا غَزْوةِ بَدرٍ، وكانت في السَّنةِ الثَّانيةِ مِن الهِجْرةِ، بيْنَ المُسلِمينَ وكفَّارِ قُرَيشٍ، وقد نصَرَ اللهُ نَبيَّه صلَّى اللهُ عليه وسلَّمَ وأصْحابَه، ولمْ يُعاتبِ النَّبيُّ صلَّى اللهُ عليه وسلَّمَ أحدًا تَخلَّفَ عن هذه الغَزْوةِ؛ لأنَّ النَّبيَّ صلَّى اللهُ عليه وسلَّمَ عندَما خرَجَ مِن المَدينةِ لم يَخرُجْ لقِتالٍ، وإنَّما خرَجَ ليتَصَدَّى لقافِلةِ قُرَيشٍ التِّجاريَّةِ، ويَستَوْلي عليها لمَصْلَحةِ المُسلِمينَ، فأراد رَسولُ اللهِ صلَّى اللهُ عليه وسلَّمَ العيرَ، واخْتارَ اللهُ له النَّفيرَ، فكان القِتالُ.
ثمَّ ذكَرَ رَضيَ اللهُ عنه أنَّه إذا كان قدْ غاب عن غَزْوةِ بَدرٍ، فإنَّ اللهَ قد عَوَّضَه عنها بحُضورِ بَيْعةِ العَقَبةِ الثَّانيةِ؛ وذلك لأنَّ هذه البَيْعةَ كانت في أوَّلِ الإسْلامِ، ومنها فَشا الإسْلامُ، وتَأكَّدَت أسْبابُه وأساسُه، وكان يَعتَزُّ بها كَثيرًا ويقولُ: وإنْ كانت غَزْوةُ بَدرٍ أكثَرَ شُهْرةً وذِكرًا في النَّاسِ مِن بَيْعةِ العَقَبةِ، وكانت البيعةُ قبْلَ الهِجْرةِ بثَلاثةِ أشهُرٍ تَقْريبًا، وكان ذلك عندَ جَمْرةِ العَقَبةِ بمِنًى، وهي الَّتي بايَعَ الأنْصارُ فيها رَسولَ اللهِ صلَّى اللهُ عليه وسلَّمَ على الإسْلامِ، وأنْ يُؤْووهُ ويَنصُروه.
ويُخبِرُ كَعبٌ رَضيَ اللهُ عنه أنَّه عندَما دَعا رَسولُ اللهِ صلَّى اللهُ عليه وسلَّمَ لغَزْوةِ تَبوكَ، لم يكُنْ عندَه عُذرٌ ألبَتَّةَ في أنْ يَتخَلَّفَ عنِ الخُروجِ معَ رَسولِ اللهِ صلَّى اللهُ عليه وسلَّمَ؛ فقدْ جمَعَ بيْن القوَّةِ في البَدنِ، والسَّعةِ في المالِ، ولم يَجتمِعْ عندَه دابَّتانِ مُهيَّأتانِ للسَّفرِ مِن قبْلُ إلَّا في هذه الغَزْوةِ، وقدْ أفصَحَ رَسولُ اللهِ صلَّى اللهُ عليه وسلَّمَ عن وِجهَتِه في هذه الغَزْوةِ، على خِلافِ عادَتِه صلَّى اللهُ عليه وسلَّمَ مِن قبْلُ في جَميعِ غَزَواتِه؛ فقدْ كان صلَّى اللهُ عليه وسلَّمَ مِن عادَتِه: أنَّه لا يُريدُ غَزْوةً إلَّا وَرَّى بغَيرِها، أي: أوْهَمَ أنَّه يُريدُ غَيرَها، والتَّوْريةُ: أنْ تَذكُرَ لَفظًا يَحتَمِلُ مَعنَيَينِ، أحَدُهما أقرَبُ منَ الآخَرِ، فيُوهِمُ المُتحَدِّثُ إرادةَ القَريبِ، وهو في الحَقيقةِ يُريدُ البَعيدَ. وقدْ أوضَحَ رَسولُ اللهِ صلَّى اللهُ عليه وسلَّمَ لأصْحابِه حَقيقةَ وِجهَتِه في هذه الغَزْوةِ؛ ليَتأهَّبوا للأمْرِ؛ إذ كانت غَزْوةُ تَبوكَ في حَرٍّ شَديدٍ، وسيَقطَعُ المُسلِمونَ خلالَها مَسافةً كبيرةً وصَحْراءَ شاسعةً لا ماءَ فيها، وكان هَدَفُها غَزْوَ الرُّومِ، وقد تَجمَّعَ الرُّومُ في أعْدادٍ كَثيرةٍ، وتَأهَّبوا للقِتالِ، فكان لا بدَّ مِن إعْلامِ النَّاسِ حتَّى يُعِدُّوا للأمْرِ عُدَّتَه، وتجَهَّزَ رَسولُ اللهِ صلَّى اللهُ عليه وسلَّمَ والمُسلِمونَ معَه للخُروجِ، وتَخلَّفَ كَعبُ بنُ مالِكٍ رَضيَ اللهُ عنه، ويَذكُرُ كَعبٌ رَضيَ اللهُ عنه أنَّ المُسلِمينَ كان عدَدُهم كَبيرًا -كانوا يَزيدونَ عن عَشَرةِ آلافٍ، وقيلَ: العَشَرةُ آلافٍ كانوا الفُرسانَ، أمَّا إجْماليُّ الجَيشِ فقدْ زادَ عن ثَلاثينَ ألفًا- ولا يوجَدُ كِتابٌ يَجمَعُ ويَحفَظُ أسْماءَ المُجاهِدينَ حينَئذٍ، فمَن أرادَ التَّخلُّفَ عنِ الخُروجِ ظنَّ أنَّه سيَخْفى، ولنْ يَنكشِفَ حالُه، ما لم يَنزِلْ وَحْيٌ مِن اللهِ عزَّ وجلَّ يُخبِرُ النَّبيَّ صلَّى اللهُ عليه وسلَّمَ بحالِ مَن غاب عنِ الخُروجِ؛ لكَثرةِ الجَيشِ.
ويُخبِرُ كَعبُ بنُ مالِكٍ رَضيَ اللهُ عنه أنَّ هذه الغَزْوةَ كانت حينَ طابَتِ الثِّمارُ والظِّلالُ؛ فكان الباعِثُ على التَّثاقُلِ أشَدَّ وأقْوى في النُّفوسِ، فمِن ظلٍّ وثمَرٍ في المَدينةِ، إلى حرٍّ شَديدٍ، ومَكارِهِ السَّفرِ، والتَّنقُّلِ عبرَ الصَّحْراءِ. وأعدَّ رَسولُ اللهِ صلَّى اللهُ عليه وسلَّمَ عُدَّتَه للغَزْوِ، وتَجهَّزَ المُسلِمونَ معَه، وكان كَعبُ بنُ مالِكٍ رَضيَ اللهُ عنه يَخرُجُ صَباحًا ليَتجَهَّزَ معَهم، ولكنَّه كان مُتَثاقِلًا يَقْضي يومَه ويَعودُ دونَ أنْ يُنجِزَ شيئًا، ويُصبِّرُ نفْسَه بأنَّه قادرٌ على أنْ يُنجِزَ ما يُريدُ إعْدادَه مِن عَتادِ السَّفرِ وعُدَّةِ القِتالِ قبْلَ أنْ يَأذَنَ رَسولُ اللهِ صلَّى اللهُ عليه وسلَّمَ بالخُروجِ، وما زالَ في الوَقتِ سَعةٌ، حتَّى أسْرَعَ النَّاسُ واجْتَهَدوا في السَّيرِ، وخرَجَ رَسولُ اللهِ صلَّى اللهُ عليه وسلَّمَ والمُسلِمونَ معَه، ولم يَقضِ كَعبٌ رَضيَ اللهُ عنه مِن جَهازِه شيئًا، فقال لنفْسِه: أتَجهَّزُ بعْدَ خُروجِهم في يومٍ أو يَومَينِ، وألحَقُهم في الطَّريقِ.
وخرَجَ في أوَّلِ اليومِ بعْدَ خُروجِ رَسولِ اللهِ صلَّى اللهُ عليه وسلَّمَ ليَتجَهَّزَ، فعاد دونَ أنْ يَفعَلَ شيئًا، وفي اليومِ التَّالي فعَلَ مِثلَ ذلك، وظلَّ حالُه هكذا حتَّى تَفارَطَ الغَزوُ، أي: حتَّى تقدَّمَ الغُزاةُ، وتَباعَدَتِ المَسافةُ فيما بيْنَه وبيْنَهم، وفي أثْناءِ ذلك قصَدَ كَعبٌ رَضيَ اللهُ عنه أنْ يَخرُجَ إليهم فيُدرِكَهم في الطَّريقِ، ولكنَّه لم يَفعَلْ، ولم يَشأِ اللهُ له هذا، وتَمنَّى كَعبٌ أنْ لو كان خرَجَ بالفِعلِ.
ويَحْكي كَعبٌ رَضيَ اللهُ عنه أنَّه بعْدَ أنْ ذهَبَ رَسولُ اللهِ صلَّى اللهُ عليه وسلَّمَ، كان إذا خرَجَ في المَدينةِ ومَشى في النَّاسِ، يَحزَنُ؛ لأنَّه لا يَرَى مِن الرِّجالِ إلَّا مُنافقًا مَغْموصًا عليه النِّفاقُ، أي: مُتَّهمًا بالنِّفاقِ مَطْعونًا عليه في دِينِه، وقيلَ: مَعناه: مُستَحقَرًا، أو يَجِدُ رَجلًا مِن أصْحابِ الأعْذارِ الَّذين عذَرَهمُ اللهُ عزَّ وجلَّ، كالضُّعَفاءِ، والمَرْضى، والفُقَراءِ الَّذين لم يَجِدوا ما يَخرُجونَ به معَ رَسولِ اللهِ صلَّى اللهُ عليه وسلَّمَ.
ولم يتَذَكَّرِ النَّبيُّ صلَّى اللهُ عليه وسلَّمَ كَعبًا رَضيَ اللهُ عنه، حتَّى وصَلَ تَبوكَ، وهناك سألَ عنه، فردَّ رَجلٌ مِن بَني سَلِمةَ -وهو عَبدُ اللهِ بنُ أُنَيسٍ السَّلَميُّ رَضيَ اللهُ عنه، وبَنو سَلِمةَ: قَومُ كَعبِ بنِ مالكٍ رَضيَ اللهُ عنه- فقال: «يا رَسولَ اللهِ، حبَسَه بُرْداه ونَظَرُه في عِطْفِه»، العِطفُ: الجانبُ، يَتَّهِمُ كَعبًا رَضيَ اللهُ عنه بأنَّ الَّذي حبَسَه إعْجابُه بنفْسِه وكِبرُه، فردَّ مُعاذُ بنُ جَبلٍ رَضيَ اللهُ عنه غِيبَتَه، ودافَعَ عنه، وأثْنى عليه، وذكَرَ أنَّهم ما عَلِموا عن كَعبٍ رَضيَ اللهُ عنه إلَّا خَيرًا، فلم يكُنْ يومًا مُتكبِّرًا، ولا مُعجَبًا بنفْسِه، ولا مُتخلِّفًا عن رَسولِ اللهِ صلَّى اللهُ عليه وسلَّمَ، فلا بدَّ أنَّ هناك عُذرًا منَعَه، فسكَتَ رَسولُ اللهِ صلَّى اللهُ عليه وسلَّمَ ولم يقُلْ شيئًا.
ويَذكُرُ كَعبٌ رَضيَ اللهُ عنه أنَّه لمَّا علِمَ أنَّ رَسولَ اللهِ صلَّى اللهُ عليه وسلَّمَ في طَريقِه إلى المَدينةِ راجِعًا، تَجمَّعَ عليه الهَمُّ والحُزنُ؛ حَياءً مِن لِقاءِ رَسولِ اللهِ صلَّى اللهُ عليه وسلَّمَ بعْدَ تَخلُّفِه، وأخَذَ يُعِدُّ العُذرَ لرَسولِ اللهِ صلَّى اللهُ عليه وسلَّمَ إذا جاء، ويُهيِّئُ الكَلامَ، ويَحضُرُه الكَذِبُ فيما يُعِدُّه مِن أعْذارٍ، واسْتَعانَ في ذلك بأصْحابِ الرَّأيِ والمَشورةِ مِن أهْلِه.
فلمَّا تَأكَّدَ له أنَّ رَسولَ اللهِ صلَّى اللهُ عليه وسلَّمَ قدْ دَنا واقتَرَبَ قُدومُه، زالَ عنه الباطلُ، أيِ: الكَذِبُ الَّذي همَّ أنْ يَعتَذِرَ به لرَسولِ اللهِ صلَّى اللهُ عليه وسلَّمَ، وأيقَنَ أنَّه لنْ يُخرِجَه مِن سَخَطِ رَسولِ اللهِ صلَّى اللهُ عليه وسلَّمَ أيُّ عُذرٍ فيه كَذِبٌ، فعَقَدَ وعَزَمَ على ألَّا يَقولَ إلَّا الصِّدقَ؛ فلن يُنْجيَه إلَّا الصِّدقُ.
وعاد رَسولُ اللهِ صلَّى اللهُ عليه وسلَّمَ إلى المَدينةِ، وقيلَ: كان قُدومُه في شَهرِ رَمضانَ، وكان مِن عادَتِه صلَّى اللهُ عليه وسلَّمَ إذا رجَعَ مِن سَفرٍ بَدأَ بالمَسجِدِ، فيُصلِّي فيه رَكعَتَينِ، ويَجلِسُ بعضَ الوَقتِ في أصْحابِه قبْلَ أنْ يَدخُلَ بَيتَه، فجاءَه المُخلَّفونَ الَّذين خلَّفَهم كَسَلُهم ونِفاقُهم عنِ الخُروجِ معَ رَسولِ اللهِ صلَّى اللهُ عليه وسلَّمَ، وأخَذوا يُظهِرونَ له صلَّى اللهُ عليه وسلَّمَ الأعْذارَ، ويَحلِفونَ أنَّهم صادِقونَ فيما اعْتَذَروا به، وكان عددُ مَن تَخلَّفَ مِن الأنصارِ بِضْعةً وثَمانينَ رَجلًا، والبِضْعُ العَددُ مِن ثَلاثٍ إلى تِسعٍ، فقبِلَ منهم رَسولُ اللهِ صلَّى اللهُ عليه وسلَّمَ عُذرَهم على ظاهِرِ قَولِهم، وترَكَ حَقيقةَ أمْرِهم وما يُضمِرونَه للهِ عزَّ وجلَّ، وقيلَ: إنَّ المُعَذِّرينَ منَ الأعْرابِ من غيرِ الأنْصارِ كانوا أيضًا اثنَينِ وثَمانينَ رَجلًا مِن غِفارَ وغَيرِها، وأنَّ عَبدَ اللهِ بنَ أُبَيٍّ ومَن أطاعَه مِن قَومِه مِن غَيرِ هؤلاء كانوا كَثيرًا.
وجاء كَعبُ بنُ مالِكٍ رَضيَ اللهُ عنه إلى رَسولِ اللهِ صلَّى اللهُ عليه وسلَّمَ، فسلَّمَ عليه، فتبَسَّمَ له رَسولُ اللهِ صلَّى اللهُ عليه وسلَّمَ تبسُّمَ مَن يَظهَرُ عليه الغضَبُ، ودَعاه رَسولُ اللهِ صلَّى اللهُ عليه وسلَّمَ، فتَقدَّمَ كَعبٌ حتَّى جلَسَ بيْن يدَيْ رَسولِ اللهِ صلَّى اللهُ عليه وسلَّمَ، فسَألَه صلَّى اللهُ عليه وسلَّمَ عن سَببِ تَخلُّفِه عنِ الغَزوِ، وذكَرَ له صلَّى اللهُ عليه وسلَّمَ أنَّه كان قدِ اشْتَرى راحِلَتَه، وأعَدَّها للخُروجِ، فلماذا تَخلَّفَ؟ فلم يَكذِبْ كَعبُ بنُ مالِكٍ رَضيَ اللهُ عنه عندَما سَألَه النَّبيُّ صلَّى اللهُ عليه وسلَّمَ عن سَببِ تَخلُّفِه؛ بلْ أجابَه بكُلِّ صِدقٍ أنَّه لمْ يكُنْ يُوجَدُ ما يَمنَعُه مِن التَّخلُّفِ؛ أمَلًا أنْ يكونَ الصِّدقُ له مَنْجاةً مِن غضَبِ اللهِ ورَسولِه عليه. وذكَرَ لرَسولِ اللهِ صلَّى اللهُ عليه وسلَّمَ أنَّه لو جلَسَ عندَ أيِّ أحَدٍ مِن أهْلِ الدُّنْيا غيرِ رَسولِ اللهِ صلَّى اللهُ عليه وسلَّمَ؛ لاسْتَطاعَ أنْ يَخرُجَ مِن غضَبِه بعُذرٍ يَقبَلُه ويُرْضِيه؛ فقدْ أُعْطيَ جَدلًا، أي: فَصاحةً وقوَّةَ كَلامٍ، بحيث يَخرُجُ مِن عُهْدةِ ما يُنسَبُ إليه ممَّا يُقبَلُ ولا يُرَدُّ، قال: ولَكنِّي واللهِ، لقدْ علِمْتُ لئنْ حدَّثتُكَ اليومَ حَديثَ كَذِبٍ تَرْضى به عنِّي، لَيُوشِكَنَّ اللهُ أنْ يُسخِطَكَ علَيَّ، ولئنْ حدَّثتُكَ حَديثَ صِدقٍ تَجِدُ علَيَّ فيه -أي: تَغضَبُ علَيَّ فيه- إنِّي لَأرْجو فيه عَفوَ اللهِ، ثمَّ صارَحَ رَسولَ اللهِ صلَّى اللهُ عليه وسلَّمَ بحَقيقةِ أمْرِه، قائلًا: لا واللهِ، ما كان لي مِن عُذرٍ، واللهِ ما كُنتُ قطُّ أقْوى ولا أيسَرَ -منَ اليَسارِ، وهو الغِنى وسَعةُ العَيشِ- منِّي حينَ تَخلَّفْتُ عنكَ. فقال رَسولُ اللهِ صلَّى اللهُ عليه وسلَّمَ: «أمَّا هذا فقدْ صدَقَ، فقُمْ حتَّى يَقْضيَ اللهُ فيكَ»، أي: يَحكُمَ اللهُ في أمرِكَ وشأنِكَ.
وقام كَعبٌ رَضيَ اللهُ عنه مِن عندِ رَسولِ اللهِ صلَّى اللهُ عليه وسلَّمَ، فقام إليه رِجالٌ مِن أهلِه مِن بَني سَلِمةَ، ولَامُوه أشَدَّ اللَّومِ على ما فعَلَ، وذَكَروا له أنَّه كان يَنبَغي عليه أنْ يَعتَذِرَ لرَسولِ اللهِ بأيِّ عُذرٍ كما اعتَذَرَ المُخلَّفونَ غيرُه، وأنَّ استِغْفارَ رَسولِ اللهِ صلَّى اللهُ عليه وسلَّمَ له كما استَغفَرَ لغَيرِه، كافٍ له في مَحْوِ خَطيئتِه وتَكفيرِ ذَنْبِه، وتَأثَّرَ كَعبٌ رَضيَ اللهُ عنه بكَلامِهم، وهمَّ أنْ يَرجِعَ إلى رَسولِ اللهِ صلَّى اللهُ عليه وسلَّمَ، فيُغيِّرَ كَلامَه الَّذي قالَه لرَسولِ اللهِ صلَّى اللهُ عليه وسلَّمَ، ولكنْ عصَمَه اللهُ عزَّ وجلَّ؛ وذلك بأنْ سألَ: هلْ فعَلَ أحدٌ، وتَخلَّفَ عنِ الغَزْوةِ وصدَقَ رَسولَ اللهِ صلَّى اللهُ عليه وسلَّمَ غَيرِي؟ قالوا: نَعَمْ، رَجُلانِ؛ هما: مُرارةُ بنُ الرَّبيعِ العَمْريُّ، وهِلالُ بنُ أُمَيَّةَ الوَاقِفيُّ، رَضيَ اللهُ عنهما، قالا كما قُلتَ لرَسولِ اللهِ صلَّى اللهُ عليه وسلَّمَ، وأجابَهم رَسولُ اللهِ صلَّى اللهُ عليه وسلَّمَ بنفْسِ الجَوابِ الَّذي أجابَه لكَ. فذكَرَ كَعبٌ رَضيَ اللهُ عنه صَلاحَ هَذَين الرَّجُليْنِ، وأنَّهما قد شَهِدا بَدرًا، وهو بَيانٌ وتَأكيدٌ لمَدى فَضلِهما، وأنَّ فيهما قُدوةً في المُضيِّ في طَريقِ الحقِّ، وفي الثَّباتِ على الصِّدقِ.
ثمَّ نَهى رَسولُ اللهِ صلَّى اللهُ عليه وسلَّمَ المُسلِمينَ عنِ التَّكلُّمِ معَ الثَّلاثةِ: كَعْبٍ، ومُرارةَ، وهِلالٍ رَضيَ اللهُ عنهم، فاجتَنَبَهم جَميعُ النَّاسِ، ولم يُكلِّمْهم أحدٌ، فاعتَزَلَ مُرارةُ وهِلالٌ رَضيَ اللهُ عنهما يَبْكيانِ في دارِهما، وأمَّا كَعبٌ رَضيَ اللهُ عنه، فكان أقْوى مِن الرَّجُليْنِ، وأكثَرَ منهما صَبْرًا وجَلَدًا، فكان يَمْشي بيْن النَّاسِ ويَشهَدُ صَلاةَ الجَماعةِ، ويَطوفُ في الأسْواقِ دونَ أنْ يَتكلَّمَ معَه أحدٌ، ويُخبِرُ أنَّه تَغيَّرَ عليه كلُّ شَيءٍ، حتَّى الأرْضُ الَّتي يَمْشي عليها تَغيَّرتْ، فما هي الأرْضُ الَّتي يَعرِفُها، وظلَّ على هذه الحالِ خَمسينَ يومًا.
ويَحْكي كَعبٌ رَضيَ اللهُ عنه بعضَ المَواقِفِ الَّتي حدَثَت معَه؛ فيَذكُرُ أنَّه كان يَشهَدُ الصَّلاةَ ويَأْتي إلى رَسولِ اللهِ صلَّى اللهُ عليه وسلَّمَ، فيُسلِّمُ على النَّبيِّ صلَّى اللهُ عليه وسلَّمَ وهو جالسٌ في مَجلِسِه بعْدَ الصَّلاةِ، فلا يَدْري هلْ حرَّكَ صلَّى اللهُ عليه وسلَّمَ شفَتَيْه وردَّ عليه السَّلامَ أمْ لا؟ وإنَّما لم يَجزِمْ كَعبٌ بتَحْريكِه صلَّى اللهُ عليه وسلَّمَ شفَتَيْه بالسَّلامِ؛ لأنَّه لم يكُنْ يُديمُ النَّظرَ إليه خَجلًا، ويَذكُرُ أنَّه كان يُصلِّي قَريبًا مِن رَسولِ اللهِ صلَّى اللهُ عليه وسلَّمَ، فيَنظُرُ إلى رَسولِ اللهِ صلَّى اللهُ عليه وسلَّمَ خُفْيةً، فإذا أقبَلَ كَعبٌ على صَلاتِه نظَرَ إليه النَّبيُّ صلَّى اللهُ عليه وسلَّمَ، وإذا الْتَفَتَ كَعبٌ رَضيَ اللهُ عنه نحْوَ النَّبيِّ صلَّى اللهُ عليه وسلَّمَ أعرَضَ عنه.
ويَحْكي رَضيَ اللهُ عنه أنَّه لمَّا طال به إعْراضُ النَّاسِ عنه، حاوَلَ أنْ يَتكلَّمَ معَ ابنِ عَمِّه -يَعني من أهلِه بَني سَلِمةَ- وأحَبِّ النَّاسِ إليه؛ أبي قَتادةَ الحارِثِ بنِ رِبْعيٍّ الأنْصاريِّ رَضيَ اللهُ عنه، فتَسَوَّرَ حائطَ حَديقَتِه، أي: عَلا جِدارَ بُستانِ أبي قَتادةَ رَضيَ اللهُ عنه، ثمَّ سلَّمَ عليه، فلمْ يرُدَّ عليه أبو قَتادةَ رَضيَ اللهُ عنه السَّلامَ؛ لعُمومِ نَهيِ النَّبيِّ صلَّى اللهُ عليه وسلَّمَ عن كَلامِه، وسَألَه كَعبٌ باللهِ عزَّ وجلَّ: هلْ تَعلَمُني أُحِبُّ اللهَ ورَسولَه؟ فلمْ يرُدَّ عليه، فكرَّرَ كَعبٌ عليه السُّؤالَ، فلمْ يرُدَّ عليه، فكرَّرَه  فلمْ يرُدَّ عليه سِوى بقَولِه: «اللهُ ورَسولُه أعلَمُ»، وليس ذلك تَكْليمًا لكَعبٍ رَضيَ اللهُ عنه؛ لأنَّه لم يُجِبْه إلى سُؤالِه؛ بل أظهَرَ اعتِقادَه في عِلمِ اللهِ ورَسولِه لكلِّ شَيءٍ، ولمَّا رَآى كَعبٌ رَضيَ اللهُ عنه منِ ابنِ عمِّه ما رَأى، فاضَتْ عَيْناه بالدَّمعِ باكيًا لحالِه الَّذي وصَلَ إليه، وعادَ فتَسوَّرَ جِدارَ الحَديقةِ ورجَعَ، فلمْ يدخُلْ أو يَخرُجْ مِن البابِ، ولكنَّه دخَلَ خُفْيةً خَوفًا وخَجلًا مِن النَّاسِ.
وذكَرَ كَعبٌ رَضيَ اللهُ عنه أنَّه بيْنَما يَمْشي بسُوقِ المَدينةِ، وجَدَ نَبَطيًّا مِن الشَّامِ -يَعني: رَجلًا فلَّاحًا- وكان نَصْرانيًّا قدِمَ ليَبيعَ طَعامًا بسُوقِ المَدينةِ، وجَدَه كَعبٌ رَضيَ اللهُ عنه يَسألُ عنه باسمِه قائلًا: مَن يدُلُّ على كَعبِ بنِ مالِكٍ؟ فأخَذَ النَّاسُ يُشيرونَ له إلى كَعبٍ رَضيَ اللهُ عنه، ولا يَتكلَّمونَ؛ مُبالَغةً في هَجرِه والإعْراضِ عنه، حتَّى جاءه هذا النَّبَطيُّ، فأعْطاه كِتابًا مِن ملِكِ غَسَّانَ -هو جَبَلةُ بنُ الأيْهَمِ، أو هو الحارِثُ بنُ أبي شَمِرٍ، وغَسَّانُ قيلَ: إنَّها ماءٌ باليمَنِ قُربَ سدِّ مأْرِبَ- يَدْعوه في كِتابِه هذا إلى تَركِ النَّبيِّ صلَّى اللهُ عليه وسلَّمَ، وتَركِ أصْحابِه، مُنتَهِزًا تلك الفُرصةَ؛ ليَفتِنَ كَعبَ بنَ مالِكٍ رَضيَ اللهُ عنه عن دِينِه، وكتَبَ له في هذا الكتابِ: «أمَّا بَعدُ؛ فإنَّه قد بَلَغَني أنَّ صَاحِبَكَ قدْ جَفاكَ، ولم يَجعَلْكَ اللهُ بِدارِ هَوانٍ، ولا مَضْيَعةٍ، فالْحَقْ بنا نُواسِكَ»، والمَعنى: أنَّه وصَلَنا أنَّ محمَّدًا -صلَّى اللهُ عليه وسلَّمَ- قدْ قاطَعَكَ، ولم يُرِدِ اللهُ لكَ أنْ تكونَ بدارِ ضَعفٍ وحَقارةٍ، ولا دارٍ يَضيعُ فيها حقُّكَ؛ فَأْتِ إلينا نُخفِّفْ مِن حُزنِكَ ومُصابِكَ. فلمَّا قَرأَ كَعبٌ رَضيَ اللهُ عنه هذه الصَّحيفةَ، قال: هذا واللهِ منَ البَلاءِ، وذَهَبَ بها إلى التَّنُّورِ -وهو الفُرنُ الَّذي يُخبَزُ فيه- وأشعَلَه بها فجَعَلَها مع الحَطَبِ الذي يُوقَدُ به، وهذا يدُلُّ على قوَّةِ إيمانِه، وشدَّةِ مَحبَّتِه للهِ ورَسولِه على ما لا يَخْفى.
فلمَّا مَضَتْ أرْبَعونَ لَيلةً مِن الخَمسينَ، جاءَه أمْرُ رَسولِ اللهِ صلَّى اللهُ عليه وسلَّمَ باعْتِزالِ امْرأتِه عُمَيْرةَ بنتِ جُبَيرِ بنِ صَخرِ بنِ أُميَّةَ الأنْصاريَّةِ أمِّ أوْلادِه الثَّلاثةِ، أو هي زَوْجَتُه الأُخْرى خَيْرةُ، وألَّا يَقرَبَها، ولا يُباشِرَها، وكذا الحالُ بالنِّسبةِ إلى صاحِبَيْه مُرارةَ بنِ الرَّبيعِ، وهِلالِ بنِ أُميَّةَ رَضيَ اللهُ عنهم، فذَهَبَت امْرأةَ هِلالٍ رَضيَ اللهُ عنهما -واسمُها خَوْلةُ بنتُ عاصمٍ- إلى رَسولِ اللهِ صلَّى اللهُ عليه وسلَّمَ واسْتأذَنَته في أنْ تَخدُمَ هِلالًا رَضيَ اللهُ عنه؛ لكَونِه شَيخًا كَبيرًا يَحْتاجُ مَن يَخدُمُه، وقاصِرًا عنِ القيامِ بشُؤونِ نفْسِه، فأذِنَ لها النَّبيُّ صلَّى اللهُ عليه وسلَّمَ أنْ تَظَلَّ معَه وتَخدُمَه، شَريطةَ ألَّا يُباشِرَها مُباشَرةَ الأزْواجِ، فأكَّدَتِ امْرأةُ هِلالٍ للنَّبيِّ صلَّى اللهُ عليه وسلَّمَ أنَّه لم يَقرَبْها منذُ أنِ ابْتَلاه اللهُ بهذا البَلاءِ، وما زال على حالٍ يَبْكي فيها نفْسَه.
ويَذكُرُ كَعبُ بنُ مالِكٍ رَضيَ اللهُ عنه أنَّه لمَّا جاءَه الأمرُ مِن رَسولِ اللهِ صلَّى اللهُ عليه وسلَّمَ باعْتِزالِ امْرأتِه، أمَرَها أنْ تَذهَبَ إلى أهْلِها، فتَبْقى عندَهم حتَّى يَقْضيَ اللهُ في هذا الأمرِ، ويَحْكي أنَّ بَعضَ أهْلِه قالوا له: لوِ اسْتأذَنْتَ رَسولَ اللهِ صلَّى اللهُ عليه وسلَّمَ في امْرَأتِكَ، أي: تَخدُمُكَ وتَقومُ على شأنِكَ، كما أذِنَ لامْرأةِ هِلالِ بنِ أُمَيَّةَ أنْ تَخدُمَه، فقال: واللهِ لا أسْتأْذِنُ فيها رَسولَ اللهِ صلَّى اللهُ عليه وسلَّمَ، وما يُدْريني ما يقولُ رَسولُ اللهِ صلَّى اللهُ عليه وسلَّمَ إذا اسْتأْذَنْتُه فيها وأنا رَجلٌ شابٌّ؟! يَعني أقْوى على خِدْمةِ نفْسي.
واستُشكِلَ هذا القَولُ معَ نَهيِه صلَّى اللهُ عليه وسلَّمَ النَّاسَ عن كَلامِ الثَّلاثةِ، وأُجيبَ بأنَّ النَّهيَ عنِ المُكالَمةِ لم يكُنْ عامًّا لكلِّ أحدٍ؛ بلْ هو شامِلٌ لمَن لا تَدْعو حاجةُ هؤلاء إلى مُخالَطَتِه، ولكَلامِه مِن زَوْجةٍ وخادِمٍ ونحوِ ذلك؛ بدَليلِ بَقاءِ زَوْجاتِهم معَهم حتَّى هذا الحينِ، واسْتِئذانِ زَوْجةِ هِلالٍ رَضيَ اللهُ عنهما في خِدمَتِه، فنَهاها صلَّى اللهُ عليه وسلَّمَ عن أنْ يَقرَبَها، وأباحَ لها خِدمَتَه كما كانت تَخدُمُه، ولا بدَّ في ذلك مِن مُخالَطةٍ وكلامٍ، فلعلَّ الَّذي قال لكَعبٍ مِن أهْلِه ممَّن له أنْ يُكلِّمَه.
ويَحْكي كَعبٌ رَضيَ اللهُ عنه أنَّه لَمَّا صلَّى صَلاةَ الفَجرِ صُبحَ خَمْسينَ لَيلةً منَ المُقاطَعةِ والهجرانِ، وهو على تلك الحالةِ الَّتي وصَفَها اللهُ عزَّ وجلَّ بقولِه: {حَتَّى إِذَا ضَاقَتْ عَلَيْهِمُ الْأَرْضُ بِمَا رَحُبَتْ وَضَاقَتْ عَلَيْهِمْ أَنْفُسُهُمْ} [التوبة: 118]، قدْ ضاقَتْ عليهم أنفُسُهم، أي: قُلوبُهم، فلا يَسَعُهم أنَسٌ ولا سُرورٌ من فَرطِ الوَحْشةِ والغَمِّ، وضاقَتْ عليهمُ الأرضُ بما رَحُبَت، أي: مع سَعَتِها، وهو مَثلٌ للحَيْرةِ في أمرِه، كأنَّه لا يجِدُ فيها مَكانًا يَقَرُّ فيه، فبيْنَما كَعبٌ رَضيَ اللهُ عنه هكذا، إذ سمِعَ صَوتَ رَجلٍ يُنادي بأعْلى صَوتِه، صعِدَ فَوقَ جبَلِ سَلْعٍ، وهو جَبلٌ بالمَدينةِ، وصارَ يُنادي: يا كَعبُ بنَ مالِكٍ أبشِرْ، فخَرَّ كَعبٌ رَضيَ اللهُ عنه ساجِدًا حَمْدًا للهِ تعالَى، وشُكرًا له على تَوبتِه عليه، وعلِمَ أنَّه قدْ جاء الفرَجُ مِن اللهِ عزَّ وجلَّ، وأعلَنَ رَسولُ اللهِ صلَّى اللهُ عليه وسلَّمَ بتَوْبةِ اللهِ على الثَّلاثةِ المُخَلَّفينَ، وذهَبَ النَّاسُ يُبشِّرونَهم بتَوْبةِ اللهِ عليهم، فذهَبَ إلى صاحِبَيْه مُرارةَ وهِلالٍ رَضيَ اللهُ عنهما مُبشِّرونَ بذلك، وأسرَعَ الزُّبَيرُ بنُ العوَّامِ رَضيَ اللهُ عنه على فرَسٍ له إلى كَعبٍ رَضيَ اللهُ عنه، وصعِدَ رَجلٌ مِن قَبيلةِ أسلَمَ -قيلَ: هو حَمْزةُ بنُ عَمرٍو الأسْلَميُّ- على جبَلٍ وصرَخَ بصَوْتِه مُبشِّرًا له، قال كَعبٌ: وكان الصَّوتُ أسرَعَ مِن الفرَسِ، فلمَّا جاء صاحِبُ الصَّوتِ -حَمْزةُ بنُ عَمرٍو الأسْلَميُّ رَضيَ اللهُ عنه- إلى كَعبٍ رَضيَ اللهُ عنه، نزَعَ له كَعبٌ ثَوبَه وأعْطاه له هَديَّةً ومُكافأةً على بُشْراه له، قال كَعبٌ: واللهِ ما أملِكُ غَيرَهما يَومَئذٍ، واستَعَرْتُ ثَوْبَينِ فلَبِسْتُهما، وذهَبَ إلى رَسولِ اللهِ صلَّى اللهُ عليه وسلَّمَ، وكان النَّاسُ وهو في طَريقِه إلى مَسجِدِ النَّبيِّ صلَّى اللهُ عليه وسلَّمَ يُقابِلونَه أفْواجًا يُهَنِّئونَه بتَوْبةِ اللهِ عليه، فلمَّا دخَلَ المَسجِدَ وجَدَ رَسولَ اللهِ صلَّى اللهُ عليه وسلَّمَ جالِسًا، والنَّاسُ حَولَه، فبادَرَ إليه طَلْحةُ بنُ عُبَيدِ اللهِ رَضيَ اللهُ عنه يُهَروِلُ -وهو السَّيرُ بيْن المَشيِ والجَريِ- فصافَحَه وهنَّأه، قال كَعبٌ رَضيَ اللهُ عنه: ولا أنْساها لطَلْحةَ، أي: ولا أنْسى هذا المَوقِفَ لطَلْحةَ، وهذا الإحْسانَ منه إليَّ، واقتَرَبَ كَعبٌ مِن رَسولِ اللهِ صلَّى اللهُ عليه وسلَّمَ، فسلَّمَ عليه، فقال له رَسولُ اللهِ صلَّى اللهُ عليه وسلَّمَ وهو في شِدَّةِ الفَرَحِ: «أبشِرْ بخَيْرِ يَومٍ مَرَّ عليكَ منذُ ولدَتْكَ أُمُّكَ»، أي: سِوى يومِ إسْلامِه، وهو مُستَثنًى تَقْديرًا، وإنْ لم يَنطِقْ به صلَّى اللهُ عليه وسلَّمَ، أو أنَّ يومَ تَوْبتِه مُكمِّلٌ ليومِ إسْلامِه؛ فيومُ إسْلامِه بِدايةُ سَعادتِه، ويَومُ تَوْبتِه مُكمِّلٌ لهذه السَّعادةِ، فهو خَيرٌ مِن جَميعِ أيَّامِه، وإنْ كان يومُ إسْلامِه خَيرَها.
فسَألَ كَعبٌ رَسولَ اللهِ صلَّى اللهُ عليه وسلَّمَ: أمِن عندِكَ يا رَسولَ اللهِ أمْ مِن عِندِ اللهِ؟ فأجابَه النَّبيُّ صلَّى اللهُ عليه وسلَّمَ: «لا، بلْ مِن عندِ اللَّهِ». ويَذكُرُ كَعبٌ رَضيَ اللهُ عنه أنَّ رَسولَ اللهِ صلَّى اللهُ عليه وسلَّمَ كان إذا حصَلَ له سُرورٌ، اسْتَنارَ وَجهُه حتَّى كأنَّه قِطعةُ قَمرٍ، قيلَ: السِّرُّ في التَّقْييدِ بالقِطعةِ معَ كَثرةِ ما ورَدَ في كَلامِ البُلَغاءِ مِن تَشْبيهِ الوَجهِ بالقَمرِ مِن غَيرِ تَقْييدٍ؛ احْتِرازًا مِن السَّوادِ الَّذي في القمَرِ، أو إشارةً إلى مَوضِعِ الاسْتِنارةِ، وهو الجَبينُ الَّذي فيه يَظهَرُ السُّرورُ، قال: وكنَّا نَعرِفُ ذلك منه صلَّى اللهُ عليه وسلَّمَ، أي: نَعرِفُ الَّذي يَحصُلُ له منِ اسْتِنارةِ وَجهِه عندَ السُّرورِ.
وأرادَ كَعبٌ أنْ يتَصَدَّقَ بمالِه كُلِّه في سَبيلِ اللهِ، ولكِنَّ رَسولَ اللهِ صلَّى اللهُ عليه وسلَّمَ أمَرَه أنْ يُمسِكَ عليه بَعضَ مالِه، أي: يتَصَدَّقَ بالبَعضِ فقطْ، ويُبْقيَ عندَه شَيئًا مِن مالِه؛ لكَي يُنفِقَ به على نفْسِه وعيالِه؛ خَوفًا عليه مِن تَضرُّرِه بالفَقرِ، فقال كَعبٌ رَضيَ اللهُ عنه: فإنِّي أُمسِكُ سَهْمي الَّذي بخَيْبرَ، وكانت خَيْبرُ قَريةً يَسكُنُها اليَهودُ، وكانت ذاتَ حُصونٍ ومَزارِعَ على بُعدِ 173 كيلو تَقْريبًا مِن المَدينةِ إلى جِهةِ الشَّامِ، فتَحَها رَسولُ اللهِ صلَّى اللهُ عليه وسلَّمَ سَنةَ سَبعٍ منَ الهِجْرةِ.
وعاهَدَ كَعبٌ رَسولَ اللهِ صلَّى اللهُ عليه وسلَّمَ ألَّا يَتحدَّثَ إلَّا بالصِّدقِ أبدًا ما بَقيَ حيًّا؛ فما نَجَّاه اللهُ عزَّ وجلَّ إلَّا بالصِّدقِ، قال كَعبٌ رَضيَ اللهُ عنه ذاكرًا نِعمةَ اللهِ عليه: «فواللهِ ما أعلَمُ أحَدًا مِن المُسلِمينَ أبْلاهُ اللهُ في صِدْقِ الحَديثِ منذُ ذكَرْتُ ذلك لرَسولِ اللهِ صلَّى اللهُ عليه وسلَّمَ، أحسَنَ ممَّا أبْلاني»، والبَلاءُ والإبْلاءُ يكونُ في الخَيرِ والشَّرِّ، لكنْ إذا أُطلِقَ كان للشَّرِّ غالبًا، فإذا أُريدَ الخَيرُ قُيِّدَ كما قيَّدَه هنا، والمَعنى: ما عَلِمْتُ أحدًا مِن المسلمينَ أبْلاهُ اللهُ تعالَى بصِدقِ الحديثِ إبلاءً أحسَنَ ممَّا أبْلاني اللهُ تعالَى به مِن وَقْتِ ذِكْري ذلك الأمرَ لرَسولِ اللهِ صلَّى اللهُ عليه وسلَّمَ إلى يَومي هذا الذي أتحدَّثُ فيه الآنَ. وأخبَرَ كَعبٌ رَضيَ اللهُ عنه أنَّه ما تعَمَّدَ أنْ يَكذِبَ كَذبًا منذ أنْ ذكَرَ ذلك لرَسولِ اللهِ صلَّى اللهُ عليه وسلَّمَ إلى يَومِ أنْ حدَّثَ بهذا الحَديثِ، وإنَّه لَيَرْجو أنْ يَحفَظَه اللهُ فيما بَقيَ من عُمرٍ، ويَظلَّ مُلازِمًا الصِّدقَ.
وأنزَلَ اللهُ عزَّ وجلَّ قولَه: {لَقَدْ تَابَ اللَّهُ عَلَى النَّبِيِّ وَالْمُهَاجِرِينَ وَالْأَنْصَارِ الَّذِينَ اتَّبَعُوهُ فِي سَاعَةِ الْعُسْرَةِ مِنْ بَعْدِ مَا كَادَ يَزِيغُ قُلُوبُ فَرِيقٍ مِنْهُمْ ثُمَّ تَابَ عَلَيْهِمْ إِنَّهُ بِهِمْ رَءُوفٌ رَحِيمٌ * وَعَلَى الثَّلَاثَةِ الَّذِينَ خُلِّفُوا حَتَّى إِذَا ضَاقَتْ عَلَيْهِمُ الْأَرْضُ بِمَا رَحُبَتْ وَضَاقَتْ عَلَيْهِمْ أَنْفُسُهُمْ وَظَنُّوا أَنْ لَا مَلْجَأَ مِنَ اللَّهِ إِلَّا إِلَيْهِ ثُمَّ تَابَ عَلَيْهِمْ لِيَتُوبُوا إِنَّ اللَّهَ هُوَ التَّوَّابُ الرَّحِيمُ * يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ وَكُونُوا مَعَ الصَّادِقِينَ} [التوبة: 117- 119]، ويَحلِفُ كَعبٌ رَضيَ اللهُ عنه: فواللهِ ما أنعَمَ اللهُ علَيَّ مِن نِعْمةٍ قطُّ بعْدَ أنْ هَداني اللهُ للإسْلامِ أعظَمَ في نَفْسي مِن صِدْقي لرَسولِ اللهِ صلَّى اللهُ عليه وسلَّمَ أنْ أكونَ كَذَبتُه، فأهْلِكَ كما هلَكَ الَّذين كَذَبوا؛ فقدْ قال اللهُ عزَّ وجلَّ لمَن كذَبَ رَسولَ اللهِ صلَّى اللهُ عليه وسلَّمَ، واعتَذَرَ بالأعْذارِ المُختَلَقةِ، قال لهمْ شرَّ القَولِ الكائنِ لأحدٍ منَ النَّاسِ: {سَيَحْلِفُونَ بِاللَّهِ لَكُمْ إِذَا انْقَلَبْتُمْ إِلَيْهِمْ لِتُعْرِضُوا عَنْهُمْ فَأَعْرِضُوا عَنْهُمْ إِنَّهُمْ رِجْسٌ وَمَأْوَاهُمْ جَهَنَّمُ جَزَاءً بِمَا كَانُوا يَكْسِبُونَ * يَحْلِفُونَ لَكُمْ لِتَرْضَوْا عَنْهُمْ فَإِنْ تَرْضَوْا عَنْهُمْ فَإِنَّ اللَّهَ لَا يَرْضَى عَنِ الْقَوْمِ الْفَاسِقِينَ} [التوبة: 95، 96]، وأخبَرَ كَعبٌ رَضيَ اللهُ عنه أنه تَخلَّفَ هو وَصاحباهُ هِلالُ بنُ أُميَّةَ، ومُرارةُ بنُ الرَّبيعِ رَضيَ اللهُ عنهم، عن أمْرِ أولئك الَّذين قَبِلَ منهم رَسولُ اللهِ صلَّى اللهُ عليه وسلَّمَ حينَ حَلَفوا له أنَّ تَخلُّفَهم كان لعُذرٍ، فبايَعَهم رَسولُ اللهِ صلَّى اللهُ عليه وسلَّمَ، واستَغْفَرَ لهم، وأخَّرَ رَسولُ اللهِ صلَّى اللهُ عليه وسلَّمَ أمْرَنا نحن الثَّلاثةَ حتَّى قَضى اللهُ فيه، فبذلك قال اللهُ: {وَعَلَى الثَّلَاثَةِ الَّذِينَ خُلِّفُوا}، فليس معنى {الَّذِينَ خُلِّفُوا}، أي: تَخلَّفوا عَنِ الغَزْوِ، وإنَّما المعنى: الذين أخَّرَ النَّبيُّ عليه الصَّلاةُ والسَّلامُ الحُكمَ في أمْرِهم إلى أنْ يَحكُمَ اللهُ تعالَى فيهم، بخِلافِ مَن حلَفَ له صلَّى اللهُ عليه وسلَّمَ واعتَذَرَ إليه، فقَبِلَ منه صلَّى اللهُ عليه وسلَّمَ.
وفي الحَديثِ: فائدةُ الصِّدقِ، وعاقِبتُه الحَميدةُ.
وفيه: التَّبشيرُ بالخَيرِ، والتَّهْنِئةُ بالنِّعْمةِ، كما فعَلَ أصْحابُ النَّبيِّ صلَّى اللهُ عليه وسلَّمَ، وأنَّ إعْطاءَ البَشيرِ مِن مَكارِمِ الأخْلاقِ والشِّيَمِ وعادةِ الأشْرافِ.
وفيه: تَهْنِئةُ مَن تَجَدَّدَت له نِعْمةٌ دينيَّةٌ، والقِيامُ إليه إذا أقبَلَ ومُصافَحتُه.
وفيه: أنَّ خَيرَ أيَّامِ العَبدِ على الإطْلاقِ وأفْضَلَها، يَومُ تَوْبتِه إلى اللهِ وقَبولِ اللهِ تَوْبتَه.
وفيه: فَضيلةُ أهلِ بَدرٍ والعَقَبةِ.
وفيه: عِظَمُ أمْرِ المَعْصيةِ، والتَّشْديدُ في أمرِها، وأنَّها تُهلِكُ صاحِبَها إنْ لم يُدرِكْه اللهُ بتَوْبةٍ.
وفيه: إخْبارُ المَرءِ عن تَقْصيرِه وتَفْريطِه.
وفيه: مَشْروعيَّةُ التَّصريحِ بجِهةِ الغَزْوِ إذا لم تَقتَضِ المَصْلَحةُ سَتْرَه.
وفيه: أنَّ الإمامَ إذا استَنفَرَ الجَيشَ عُمومًا لَزِمَهمُ النَّفيرُ، ولحِقَ اللَّومُ بكلِّ فَردٍ إنْ تخلَّفَ.
وفيه: أنَّ العاجِزَ عنِ الخُروجِ بنَفْسِه أو بمالِه لا لَومَ عليه.
وفيه: مَشْروعيَّةُ مَدْحِ المَرءِ بما فيه مِن الخَيرِ إذا أُمِنَت الفِتْنةُ.
ومنها: تَسْليةُ المَرءِ نفْسَه عمَّا لم يَحصُلْ له بما وقَعَ لنَظيرِه.
وفيه: مَشْروعيَّةُ التَّوْريةِ عنِ المَقصِدِ.
وفيه: فضْلُ ردِّ الغِيبةِ عنِ المُسلِمِ.
وفيه: مَشْروعيَّةُ اسْتِعارةِ الثِّيابِ.
وفيه: دَليلٌ على عَدمِ تَصدُّقِ الإنسانِ بجَميعِ مالِه؛ حتَّى لا يَبْقى عالةً على غَيرِه.
وفيه: مُصافَحةُ القادِمِ، والقيامُ له إكْرامًا، والهَرْوَلةُ إلى لِقائِه بَشاشةً وفَرحًا.
وفيه: أنَّ الإمامَ لا يُهمِلُ مَن تَخلَّفَ عنه في بعضِ الأُمورِ؛ بل يُذكِّرُه ليُراجِعَ التَّوبةَ.
وفيه: الحُكمُ بالظَّاهِرِ، وقَبولُ المَعاذيرِ.
وفيه: تَركُ السَّلامِ على مَن أذنَبَ، ومَشْروعيَّةُ هَجْرِه أكثَرَ مِن ثَلاثٍ بقَصدِ رُجوعِه عنِ الذَّنبِ، وأمَّا النَّهيُ عنِ الهَجرِ فوقَ ثَلاثٍ فمَحمولٌ على مَن لم يكُنْ هُجْرانُه شَرعيًّا.
وفيه: بيانُ فائدةِ الصِّدقِ، وشُؤمِ عاقبةِ الكَذِبِ. 
                  """,
    },
    {
      "hadithNumber": "22",
      "arabicText": """
عن أبي نجيد- ضم النون وفتح الجيم - عمران بن الحصين الخزاعى رضي الله عنهما أن امرأة من جهينة أتت رسول الله صلى الله عليه وسلم وهى حبلى من الزنى، فقالت‏:‏ يا رسول الله أصبت حداً فأقمه علي، فدعا نبي الله صلى الله عليه وسلم وليها فقال‏:‏ أحسن إليها، فإذا وضعت فأتني، ففعل فأمر بها نبي الله صلى الله عليه وسلم، فشدت عليها ثيابها، ثم أمر بها فرجمت، ثم صلى الله عليه وآله وسلم عليها‏.‏ فقال له عمر‏:‏ تصلى عليها يا رسول الله وقد زنت، قال‏:‏ لقد تابت توبة لو قمست بين سبعين من أهل المدينة لوستعتهم، وهل وجدت أفضل من أن جادت بنفسها لله عز وجل ‏؟‏‏!‏ ‏"‏ رواه مسلم‏.‏
                  """,
      "arabicExplanation": """
لا يوجد شرح لهذا الحديث الشريف
                  """,
    },
    {
      "arabicText": """
عن ابن عباس رضي الله عنهما أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏ "‏ لو أن لابن آدم وادياً من ذهب أحب أن يكون له واديان، ولن يملأ فاه إلا التراب، ويتوب الله على من تاب‏"‏ ‏(‏‏(‏متفق عليه‏)‏‏)
                  """,
      "arabicExplanation": """
المالُ مِن الأشياءِ المُحبَّبةِ إلى القُلوبِ، وله جاذبيَّتُه الَّتي لا تَنْتَهي، ولذلك جاءت النصوصُ وكَثُرت في التحذيرِ مِنَ الحِرصِ عليه وجمعِه واكتِنازِه.
وفي هذا الحَديثِ يُبَيِّنُ النَّبيُّ صلَّى اللهُ عليه وسلَّم أنَّه لَوْ كان لابنِ آدَمَ مِثلُ وادٍ ممتَلِئٍ بالمالِ، لأَحَبَّ أنْ يكونَ له وادٍ آخَرُ مماثلٌ له، والوادي: هو كلُّ مُنفَرِجٍ بيْنَ جِبالٍ أو آكامٍ، وَهو مَنْفَذُ السَّيلِ. وأخبر صلَّى اللهُ عليه وسلَّم أنَّه لا يَملَأُ عَيْنَ ابنِ آدَمَ إلَّا التُّرابُ؛ وذلك لأنَّ الإنسانَ بطَبْعِه ميَّالٌ إلى حُبِّ المالِ، وفيه طمَعٌ، ولا يَشبَعُ منه، وليْس له حدٌّ يَنْتَهي إليه، إلَّا ما كان مِن مادَّتِه، وهو التُّرابُ، وقيل: معناه: أنَّه لا يزالُ حريصًا على الدُّنيا حتى يموتَ ويمتَلِئَ جَوفُه مِن تُرابِ قَبْرِه.
وهذا الحديثُ خرج على حُكمِ غالِبِ بني آدَمَ في الحِرصِ على الدُّنيا، ويؤيِّدُه قَولُه صلَّى اللهُ عليه وسلَّم: «وَيَتوبُ اللَّهُ على مَن تابَ» أي: يَقبَلُ تَوبةَ الحَريصِ على الرُّجوعِ إلى طريقِ الحَقِّ بعد الغَيِّ، كَما يَقبَلُها مِن غَيرِهِ. ثم أخبر ابنُ عَبَّاسٍ رضِيَ اللهُ عنهما: أنَّه يشُكُّ هل الحَديثُ المَذكورُ مِنَ القُرآنِ الذي نُسِخَ لَفظُه، أمْ لا؟
وَقال عطاءُ بنُ أبي رباحٍ: سَمِعْتُ عبدَ اللهِ بنَ الزُّبَيرِ يَقولُ ذلك الحديثَ على المِنْبَرِ بِمَكَّةَ المُشَرَّفَةِ.
وفي الحَديثِ: التحذيرُ مِن الانشِغالِ بِالمالِ، والفِتنةِ بِه.
وفيه: أنَّ المُؤمِنَ يَنبَغي أنْ يَكونَ أكْبَرُ هَمِّهِ العَمَلَ لِلآخِرةِ، وألَّا يَشغَلَ بالدُّنيا وشَهَواتِها.
وفيه: ذمُّ الحِرْصِ والشَّرَهِ.

                  """,
    },
    {
      "arabicText": """
عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏ "‏يضحك الله سبحانه وتعالى إلى رجلين يقتل أحدهما الآخر يدخلان الجنة، يقاتل هذا في سبيل الله فيقتل، ثم يتوب الله على القاتل فيسلم فيستشهد‏"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏
                  """,
      "arabicExplanation": """
اللهُ عَزَّ وجَلَّ واسِعُ الرَّحمةِ، جَزيلُ العَطاءِ لِمَن آمَنَ وعَمِلَ صالِحًا، فمهْما بَلَغتْ ذُنوبُ العَبدِ وكَثُرتْ خَطاياهُ، ثمَّ تابَ وأنابَ إلى اللهِ؛ تابَ اللهُ عليه، وقَبِلَه وأجْزَلَ له المَثوبةَ.
وفي هذا الحَديثِ يُخبِرُ النَّبيُّ صلَّى اللهُ عليه وسلَّمَ أنَّ اللهَ عَزَّ وجَلَّ يَضحَكُ إلى رَجُلَيْنِ، ضَحِكًا يَليقُ به سُبحانَه وتَعالى، مِن غَيرِ تَأويلٍ أو تَعطيلٍ أو تَشبيهٍ؛ وذلك لأنَّ هذَيْن الرَّجُلَيْنِ قَتَلَ أحَدُهما الآخَرَ، وعلى الرَّغمِ مِن ذلك يَجمَعُ اللهُ تعالَى بيْنَهما في الجَنَّةِ؛ وذلك أنَّ القاتِلَ كان كافِرًا وقدْ قَتَلَ مُؤمِنًا، فمات المُؤمِنُ شَهيدًا في سَبيلِ اللهِ، فدَخَل الجَنَّةَ؛ كما وَعَدَ اللهُ تعالَى الشُّهداءَ، ثمَّ أسلَمَ القاتِلُ، وقاتَلَ في سَبيلِ اللهِ هو الآخَرُ، فاستُشهِدَ؛ فإنَّ اللهَ يُلحِقُه بصاحِبِه الذي قَتَلَه في الجَنَّةِ، وهذا الفِعلُ كان سَبَبًا لِضَحِكِ اللهِ تعالَى منهما في الآخِرةِ.
وفي هذا الحَديثِ: أنَّ كَرَمَه سُبحانَه وفَضْلَه مُتنَوِّعٌ مِن وُجوهٍ لا تُعَدُّ ولا تُحصَى.
وفيه: أنَّ مَن قُتِلَ في سَبيلِ اللهِ فهو في الجَنَّةِ.
وفيه: التَّرغيبُ في الدُّخولِ في الإسلامِ.
وفيه: فَتحُ أبوابِ التَّوبةِ بكُلِّ وَسيلةٍ؛ فإنَّ الإسلامَ يَجُبُّ ما قبْلَه.
وفيه: إثباتُ الضَّحِكِ للهِ تَعالى، وهو ضَحِكٌ يَليقُ به سُبحانَه وتَعالى، ولا يُشبِهُ ضَحِكَ المَخلوقينَ.
                  """,
    },
    {
      "arabicText": """
عن أبي مالك الحارث بن عاصم الأشعري رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏ "‏الطهور شطر الإيمان، والحمد لله تملأ الميزان، وسبحان الله والحمد لله تملآن -أو تملأ- ما بين السماوات والأرض، والصلاة نور، والصدقة برهان، والصبر ضياء، والقرآن حجة لك أو عليك‏.‏ كل الناس يغدو، فبائع نفسه فمعتقها، أو موبقها‏"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏
                  """,
      "arabicExplanation": """
هذا حَديثٌ عَظيمٌ، وأصلٌ من أُصولِ الإسلامِ، يَذكُرُ فيه النَّبيُّ صلَّى اللهُ عليه وسلَّم كُلَّ ما يُهِمُّ المسلمَ في حَياتِه وآخِرتِهِ؛ ففيه يُخبِرُ النَّبيُّ صلَّى اللهُ عليه وسلَّم أنَّ «الطُّهورَ» -وهو الوُضوءُ، والطَّهارةُ أصلُها: النَّظافةُ والتَّنَزُّهُ- «شَطْرُ الإِيمانِ»، أي: نِصفُهُ، والمرادُ أنَّ الأجرَ في الوُضوءِ يَنتهي إلى نِصفِ أجرِ الإيمانِ.
وقدِ اختُلِفَ في المُرادِ بكَونِ الطُّهورِ شَطرَ الإيمانِ؛ فقيل: المُرادُ أنَّ خِصالَ الإيمانِ منَ الأعمالِ والأقوالِ كلُّها تُطهِّرُ القَلبَ وتُزَكِّيه، وأمَّا الطَّهارةُ بالماءِ فهي تَختصُّ بتَطهيرِ الجسَدِ وتَنظيفِه؛ فصارَت خِصالُ الإيمانِ قِسمَينِ: أحدُهما يُطهِّرُ الظَّاهِرَ، والآخَرُ يُطهِّرُ الباطِنَ؛ فهُما نِصفانِ بهذا الاعتبارِ. أوِ المُرادُ بالإيمانِ هنا الصَّلاةُ، كما في قَولِ اللهِ تَعالَى: {وَمَا كَانَ اللَّهُ لِيُضِيعَ إِيمَانَكُمْ} [البقرة: 143]، والكَلامُ على تَقديرِ مُضافٍ، أي: إكمالُ الوُضوءِ شَطرُ كَمالِ الصَّلاةِ، والصلاةُ لا تُقبَلُ إلَّا بطُهورٍ؛ فصار الطُّهورُ شَطرَ الإيمانِ بهذا الاعتِبارِ، وليس يَلزَمُ في الشَّطرِ أن يكونَ نِصفًا حَقيقيًّا.
«والحمدُ للهِ تَملَأُ الميزانَ»، أي: إنَّها تُوزنُ وتَملأُ الميزانَ بالأجرِ والثَّوابِ، فتُرَجَّحُ كِفَّتُها، وذلك يومَ القيامةِ يومَ تُوزَنُ أعمالُ العبادِ، ويُجازي عليها اللهُ عزَّ وجلَّ، والميزانُ الذي تُوزَنُ به الأعمالُ يَومَ القيامةِ ميزانٌ حَقيقيٌّ لا يُشبِه مَوازينَ الخَلقِ، وهو من أُمورِ الغَيبِ التي يَجِبُ الإيمانُ بها، «وسُبحانَ اللهِ» ومعناه: التَّنزيه الكاملُ لله تَعالَى عن كلِّ نقصٍ، ووَصفُه بالكَمالِ التَّامِّ الَّذي يَليقُ بجَلالِه، «والحمْدُ للهِ»، ومعناها: الاعترافُ بأنَّ اللهَ هو المُستحِقُّ وحدَه لمعاني الشُّكرِ والثَّناءِ، وهاتان الجملتان «تَمْلَآنِ»، أي: إنَّ أجرَ ذِكرِهما يَملَأُ «ما بَيْنَ السَّمواتِ والأرضِ»؛ لاشتمالِهِما على تَنزيه اللهِ تَعالَى في قَولِه: «سُبحانَ اللهِ»، والتَّفويضِ والافتِقارِ إلى اللهِ في قَولِه: «الحَمْدُ للهِ» فهي: وَصفٌ للمَحمودِ بالكَمالِ معَ المَحبَّةِ والتَّعظيمِ.
«والصَّلاةُ نورٌ»، قيل: المَعنَى: إنَّ من أجرِها أن يَجعَلَ اللهُ عزَّ وجَلَّ نورًا لصاحِبِها يَومَ القيامةِ، ويَكونُ في الدُّنيا أيضًا على وَجهِه البَهاءُ، بخِلافِ مَن لم يُصَلِّ، وقيل: هي تَمنَعُ منَ المَعاصي وتَنهَى عنِ الفَحشاءِ والمُنكَرِ، وتَهدي إلى الصَّوابِ، كما أنَّ النُّورَ يُستَضاءُ به، وقيل: كُلُّ هذا؛ فهي نُورٌ للعَبدِ في قَلبِه، وفي وَجهِه، وفي قَبرِه، وفي حَشرِه.
«والصَّدَقةُ بُرهانٌ»؛ فهي دَليلٌ على إيمانِ المؤمِنينَ واختلافِهِم عَنِ المنافِقينَ؛ فإنَّ المُنافِقَ يَمتَنِعُ منها لكَونِه لا يَعتَقِدُها، فمَن تَصدَّق استُدِلَّ بصَدَقَتِه على صِدقِ إيمانِه. وقيل: تَكونُ بُرهانًا يَفزَعُ إليها كما يُفزَعُ إلى البَراهينِ، كأنَّ العَبدَ إذا سُئل يَومَ القيامةِ عن مَصرِفِ مالِه، كانت صَدَقاتُه بَراهينَ في جَوابِ هذا السُّؤالِ، فيَقولُ: تَصَدَّقتُ به.
«والصَّبْرُ ضِياءٌ»، والضِّياءُ هو النُّورُ الذي يَحصُلُ فيه نَوعُ حَرارةٍ وإحراقٍ، كضياءِ الشَّمسِ، بخِلافِ القَمَرِ؛ فإنَّه نورٌ مَحضٌ، فيه إشراقٌ بغَيرِ حَرارةٍ، ولمَّا كان الصَّبرُ شاقًّا على النُّفوسِ يَحتاجُ إلى مُجاهدةِ النَّفسِ وحَبسِها وكَفِّها عمَّا تَهواهُ، كان ضياءً؛ فإنَ مَعنَى الصَّبرِ في اللُّغةِ: الحَبسُ، ويُقصَدُ به هنا الوُقوفُ مع البَلاءِ بِحُسنِ الأدَبِ، والصَّبرُ المَحبوبُ في الشَّرعِ يَكونُ على طاعةِ اللهِ تَعالَى، والصَّبرُ عن مَعصيتِه، والصَّبرُ على النَّائباتِ وأنواعِ المَكاره في الدُّنيا؛ كلُّ هذا ضياءٌ لصاحبِه، والمُرادُ أنَّ الصَّبرَ مَحمودٌ، ولا يَزالُ صاحِبُه مُستضيئًا مُهتَديًا مُستَمِرًّا على الصَّوابِ.
«والقُرْآنُ حُجَّةٌ لكَ أو علَيْكَ»، أي: يَكونُ بتِلاوتِه والعملِ به حُجَّةً مع صاحبِه يومَ القيامةِ، ويَكونُ بِتَركِه دُونَ عَملٍ أو تِلاوةٍ حُجَّةً وخُسرانًا على صاحبِه.
وأخبَرَ صلَّى اللهُ عليه وسلَّم أنَّ «كلَّ النَّاسِ يَغْدُو» بمَعنَى يُبَكِّر، والغُدُوُّ: سَيرُ أوَّلِ النَّهارِ، «فَبايِعٌ نَفْسَه؛ فَمُعْتِقُها أَوْ مُوبِقُها»، أي: كلُّ إنسانٍ يَسعى بنفسِه إلى طاعةِ اللهِ، فيكونُ مُنقِذًا لها منَ النَّار، أو يَسعَى بنفسِه إلى طاعةِ الشَّيطانِ وهَواه، فَيُهلِكُها بدُخولِها النَّارَ.
وفي الحديثِ: فضلُ الوُضوءِ والطَّهارةِ وبَيانُ ما لهما من الأجرِ.
وفيه: بَيانُ بعضِ الأقوالِ والأعمالِ الإيمانيَّةِ التي تُعتِقُ صاحبَها من النَّارِ.
وفيه: تَنبيهٌ على أنَّ الإنسانَ يُؤخَذُ بجَريرةِ عملِه؛ فليَعمَل لنَفسِه ما أرادَ.

                  """,
    },
    {
      "arabicText": """
عن أبي سعيد سعد بن مالك بن سنان الخدري رضي الله عنهما‏:‏ ‏"‏أن ناساً من الأنصار سألوا رسول الله صلى الله عليه وسلم فأعطاهم، ثم سألوه فأعطاهم ، حتى نفد ما عنده، فقال لهم حين أنفق كل شيء بيده ‏:‏ ‏"‏ما يكن عندي من خير فلن أدخره عنكم ، ومن يستعفف يعفه الله، ومن يستغن يغنه الله، ومن يتصبر يصبره الله‏.‏ وما أعطي أحد عطاءً خيراً وأوسع من الصبر‏"‏ ‏(‏‏(‏متفق عليه‏)‏‏)
                  """,
      "arabicExplanation": """
كان رَسولُ اللهِ صلَّى اللهُ عليه وسلَّمَ أجوَدَ بالخَيرِ مِن الرِّيحِ المُرسَلةِ، وكان يُعطِي عَطاءَ مَن لا يَخْشَى الفقْرَ، ومع سَعةِ إنفاقِه وُجودِه صلَّى اللهُ عليه وسلَّمَ كان يُربِّي النُّفوسَ على العَفافِ والاستغناءِ، وأنَّ ما عندَ اللهِ خَيرٌ وأبْقى.
وفي هذا الحديثِ يَحكي أبو سَعيدٍ الخُدريُّ رَضيَ اللهُ عنه أنَّ ناسًا مِن الأنصارِ لم يُسَمِّهم سَأَلوا رَسولَ اللهِ صلَّى اللهُ عليه وسلَّمَ شَيئًا مِن المالِ فأعْطاهم، ثمَّ سَأَلوه فأعْطاهم، ثمَّ سَأَلوه فأَعْطاهم حتَّى نَفِدَ وانتَهى ما عِندَه مِن المالِ، فبيَّنَ لهم النبيُّ صلَّى اللهُ عليه وسلَّمَ أنَّه لا يَمنَعُ عنهم شيئًا مِن المالِ يكونُ عندَه فيَحتفَظ به لغَيرِهم.
ثمَّ أرشَدَهُم صلَّى اللهُ عليْه وسلَّمَ وحَثَّهم على الاستِعفافِ؛ فمَن تَخلَّقَ بالعِفَّةِ عمَّا حَرَّمَ اللهُ عليْه -سَواءٌ في مَأكَلٍ، أو مَشرَبٍ، أو مَلبَسٍ، ونَحوِ ذلك- أعانَه اللهُ عليْها وحَصَلَتْ له، ثمَّ حثَّهم صلَّى اللهُ عليْه وسلَّمَ على الاستِغناءِ، وهو أنْ يُسْتَغْنى الإنسانُ عمَّا في أيْدي النَّاسِ، ويَستَغنيَ بما عِندَه مِن اليَسيرِ عن المَسأَلةِ، فلا يَسألُ إلَّا إذا كان مُضطَرًّا، ومَن يَفعَلْ ذلك يَمُدَّه اللهُ عزَّ وجلَّ بالغِنى مِن عِندِه، ويَجعَلِ القَليلَ في عَينِه كَثيرًا، ثمَّ حثَّ صلَّى اللهُ عليْه وسلَّمَ على الْتِزامِ الصَّبرِ وتَعويدِ النَّفسِ عليْه؛ لأنَّ الإنسانَ إذا صَبَرَ استَعفَفَ واستَغْنى، ولم يَحصُلْ منه السُّؤالُ والإلْحافُ في المَسأَلةِ.
وقولُه: «ومَن يَتَصبَّرْ يُصَبِّرْه اللهُ»، أي: ومَن يُعالِجِ نفْسَه بالصَّبرِ ويَتَكلَّفْه على ضِيقِ العَيشِ وغَيرِه مِن مَكارِه الدُّنيا؛ يَملَأِ اللهُ قَلْبَه به، ومَن بَذَلَ الأسبابَ وحَرَصَ على الصَّبرِ؛ فإنَّ اللهَ تعالَى يُوفِّقُه لتَحصيلِه، ويَجعَلُه يَتَّصفُ به.
ثمَّ بيَّن أنَّه ما أعْطَى اللهُ أحدًا نِعمةً ولا خُلُقًا كَريمًا أفضَلَ ولا أوسَعَ مِن الصَّبرِ؛ لأنَّه يَتَّسِعُ لكُلِّ الفَضائلِ، فكُلُّها تَصدُرُ عنه، وتَعتَمِدُ عليْه؛ مِن عِفَّةٍ، وشَجاعةٍ، وعَزيمةٍ، وإرادةٍ، وإباءٍ، وغَيرِها، والإنسانُ إذا كان صَبورًا تَحمَّلَ كُلَّ مَكروهٍ بإذْنِ اللهِ تعالَى.
وفي الحَديثِ: أنَّ الأخلاقَ الكريمةَ يُمكِنُ اكتِسابُها والوصولُ إليها عن طَريقِ التعوُّدِ عليها.
وفيه: ما كان عليه النبيُّ صلَّى اللهُ عليه وسلَّمَ مِن الكَرَمِ والسَّخاءِ والإيثارِ على نفْسِه.
وفيه: الاعتِذارُ للسَّائلِ إذا لم يَجِدِ المسؤولُ ما يُعطِيه.
وفيه: الحَضُّ على الاستِغناءِ عن النَّاسِ بالصَّبرِ، والتَّوكُّلِ على اللهِ، وانتظارِ رِزقِ اللهِ سُبحانَه، وأنَّ الصَّبرَ أفضلُ ما أُعطيَه المؤمنُ، وكذلك الجَزاءُ عليه غيرُ مُقدَّرٍ ولا مَحدودٍ.

                  """,
    },
    {
      "arabicText": """
عن أبي يحيى صهيب بن سنان رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏ "‏عجبا لأمر المؤمن إن أمره كله له خير، وليس ذلك لأحد إلا للمؤمن ‏:‏ إن أصابته سراء شكر فكان خيراً له، وإن أصابته ضراء صبر فكان خيراً له‏"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏
                  """,
      "arabicExplanation": """
الصَّبرُ مِن الأخلاقِ الفاضِلةِ والخِصالِ النَّبيلةِ الَّتي أمَرَ اللهُ تعالَى بها، ورَغَّب فيها وبَيَّن فَضْلَها.
وفي هذا الحديثِ يقولُ النَّبيُّ صلَّى اللهُ عليه وسلَّمَ: «عَجَبًا لِأمرِ المُؤمنِ»؛ فأَظهَرَ النَّبيُّ صلَّى اللهُ عليه وسلَّمَ العَجبَ على وَجهِ الاستحسانِ لشَأنِ المُؤمِنِ وأحوالِه؛ وذلك لأنَّ أحوالَ المؤمنِ كلَّها فيها خَيرٌ، وليْسَ ذَلك لأحدٍ إلَّا المؤمنُ، فكُلُّ إِنسانٍ في قَضاءِ اللهِ وقَدَرِه بينَ أَمرينِ: مُؤمنٍ وغَيرِ مُؤمنٍ، فالمؤمنُ إنْ أَصابتْه سَرَّاءُ مِن نِعمةٍ دِينيَّةٍ؛ كالعِلمِ والعَملِ الصَّالحِ، ونِعمةٍ دُنيويَّةٍ؛ كالمالِ والبَنينَ والأَهلِ، شَكَرَ اللهَ، فهو يَعرِفُ حقَّ اللهِ في تلكَ النِّعمةِ وما قُدِّرَ له منها، فيقومُ بالطَّاعةِ والعبادةِ والقُربِ مِن اللهِ عزَّ وجلَّ امتنانًا وشُكرًا له سُبحانه، فيَحصُلُ له الأجْرُ في الآخِرةِ، ويُضافُ لهذا الشُّكرِ فَرَحُه الَّذي يَشمَلُه بتلكَ النِّعمةِ، وكذلك فإنَّ المؤمنَ إذا أصابتْه الضَّراءُ مِن فَقرٍ، أو مَرَضٍ، أو بَلِيَّةٍ، أو ضَرَرٍ؛ صَبرَ عَلى أَقدارِ اللهِ، وانْتَظَر الفَرَجَ مِن اللهِ، واحْتَسبَ الأجْرَ عَلى اللهِ، ولَجَأَ إليه تعالَى في كَشْفِها، فكان الصَّبرُ خَيرًا له؛ لأنَّه يُثابُ على صَبرِه، ويَحُوزُ أجْرَ الصَّابِرينَ الَّذين يُوفَّونَ أُجورَهم بغيرِ حِسابٍ؛ فكان أمرُه كُلُّه خيرًا، فَكان ذلكَ خَيرًا له.
فالإيمانُ بقَضاءِ اللهِ وقَدَرِه يَجعَلُ المؤمِنَ في رِضًا كامِلٍ على كُلِّ أَحوالِه، بخِلافِ غَيرِ المُؤمِنِ الَّذي يَكونُ في سَخَطٍ دائِمٍ عندَ وُقوعِ ضَررٍ عليه، وإذا ما حاز نِعمةً مِن اللهِ عزَّ وجلَّ انشَغَلَ بها عن طاعتِه، فضْلًا عن صَرفِها في مَعصيةٍ.

                  """,
    },
    {
      "arabicText": """
عن أنس رضي الله عنه قال‏:‏ لما ثقل النبي صلى الله عليه وسلم جعل يتغشاه الكرب فقالت فاطمة رضي الله عنها‏:‏ واكرب أبتاه‏.‏ فقال ‏:‏ ‏ "‏ليس على أبيك كرب بعد اليوم‏"‏ فلما مات قالت ‏:‏ يا أبتاه أجاب رباً دعاه، يا أبتاه جنة الفردوس مأواه، يا أبتاه إلى جبريل ننعاه، فلما دفن قالت ‏:‏ فاطمة رضي الله عنها‏:‏ أطابت أنفسكم أن تحثوا على رسول الله صلى الله عليه وسلم التراب‏؟‏ ‏(‏‏(‏رواه البخاري‏)‏‏)
                  """,
      "arabicExplanation": """
مَوتُ النَّبيِّ صلَّى اللهُ عليه وسلَّمَ كان أعظَمَ مُصيبةٍ حَلَّتْ بالمُسلِمينَ، ولنْ يُصابَ المُسلِمونَ بعْدَها بمِثلِها، وقدْ ظهَرَ فيها حُبُّ الصَّحابةِ لرَسولِ اللهِ صلَّى اللهُ عليه وسلَّمَ.
وفي هذا الحَديثِ يُخبِرُ أنَسُ بنُ مالِكٍ رَضيَ اللهُ عنه عن شدَّةِ مرَضِ النَّبيِّ صلَّى اللهُ عليه وسلَّمَ الَّذي مات فيه، وأنَّه لَمَّا رَأتْ فاطِمةُ رَضيَ اللهُ عنها أباها النَّبيَّ صلَّى اللهُ عليه وسلَّمَ قدِ اشتَدَّ عليه المرَضُ، وجعَلَ يتَغَشَّاه، أي: يَشتَدُّ به ويُغَطِّيه، قالت: «وَا كَربَ أبَاهُ!» والكَربُ هو ما اشتَدَّ مِن الغَمِّ، وأخْذِ النَّفْسِ، وفاطِمةُ رَضيَ اللهُ عنها بهذا تَندُبُ شدَّةَ الألَمِ والمرَضِ عليه صلَّى اللهُ عليه وسلَّمَ، ولم يكُنْ قَولُها هذا مِن النُّواحِ، أو رَفعِ الصَّوتِ في شَيءٍ؛ لأنَّه صلَّى اللهُ عليه وسلَّمَ لم يُنكِرْ عليها، وعندَما سَمِعَها صلَّى اللهُ عليه وسلَّمَ قال لها: «لَا كَرْبَ على أبيكِ بعْدَ اليَومِ»، أي: لا يُصِيبُه بعْدَ اليَومِ نصَبٌ، ولا يَجِدُ له كَرْبًا إذا ذهَبَ إلى دارِ الكَرامةِ.
فلمَّا مات صلَّى اللهُ عليه وسلَّمَ قالت: «يا أبَتاهُ، أجَابَ ربًّا دَعاهُ، يا أبَتاهُ، مَن جَنَّةُ الفِردَوْسِ مَأْواهُ»، أي: نُزُلُه ومُقامُه، «يا أبَتاهُ، إلى جِبْريلَ نَنْعاهُ»، النَّعْيُ: هو إذاعةُ خَبرِ الوَفاةِ، ويُؤخَذُ مِن هذا: أنَّ تلك الألفاظَ إذا كان الميِّتُ مُتَّصِفًا بها فلا يُمنَعُ ذِكرُها له بعْدَ مَوتِه، بخِلافِ ما إذا كانت فيه ظاهرًا وهو في الباطِنِ بخِلافِها، أو لا يَتحقَّقُ اتِّصافُه بها، فيَدخُلُ في المَنعِ.
فلمَّا دُفِنَ صلَّى اللهُ عليه وسلَّمَ قالت فاطِمةُ رَضيَ اللهُ عنها لأنَسٍ رَضيَ اللهُ عنه: يا أنَسُ، أي: كيف رَضيتُم في أنفُسِكم أنْ تُهيلوا التُّرابَ عليه مع شِدَّةِ مَحبَّتِكم له؟! وهذا سُؤالُ الحَزينِ المُتفجِّعِ المُتألِّمِ، وليس سُؤالَ المُعتَرِضِ على قَدَرِ اللهِ؛ فقدْ سلَّمَت أمْرَها للهِ، ونعَتْ أباها، ورَضِيَت له الجنَّةَ، وقدْ سكَتَ أنَسٌ رَضيَ اللهُ عنه عن جَوابِها رَضيَ اللهُ عنها رِعايةً وتأدُّبًا، ورِفقًا لها في شِدَّةِ حُزنِها.
وفي الحَديثِ: شِدَّةُ حبِّ فاطمةَ رَضيَ اللهُ عنها للنَّبيِّ صلَّى اللهُ عليه وسلَّمَ، وألَمِها لفِراقِه.
وفيه: مَشْروعيَّةُ البُكاءِ والحُزنِ على الميِّتِ معَ عدَمِ الاعْتِراضِ على الأقْدارِ.
وفيه: بَيانُ بَشريَّةِ النَّبيِّ صلَّى اللهُ عليه وسلَّمَ، وأنَّه أصابَه المرَضُ، والتَّعبُ، ثمَّ الموتُ.

                  """,
    },
    {
      "arabicText": """
عن أبي زيد أسامة بن زيد بن حارثة مولى رسول الله صلى الله عليه وسلم وحبه وابن حبه، رضي الله عنهما، قال‏:‏ أرسلت بنت النبي صلى الله عليه وسلم ‏:‏ إن ابني قد احتضر فاشهدنا، فأرسل يقرئ السلام ويقول‏:‏ ‏"‏إن لله ما أخذ، وله ما أعطى، وكل شيء عنده بأجل مسمى، فلتصبر ولتحتسب‏"‏ فأرسلت إليه تقسم عليه ليأتينها‏.‏ فقام ومعه سعد بن عبادة، ومعاذ بن جبل، وأبي بن كعب، وزيد بن ثابت، ورجال رضي الله عنهم، فرفع إلى رسول الله صلى الله عليه وسلم الصبي فأقعده في حجره ونفسه تقعقع، ففاضت عيناه، فقال سعد‏:‏ يا رسول الله ماهذا‏؟‏ فقال‏:‏ ‏"‏هذه رحمة جعلها الله تعالى في قلوب عباده‏"‏ وفى رواية ‏:‏ ‏"‏في قلوب من شاء من عباده وإنما يرحم الله من عباده الرحماء‏"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏
                  """,
      "arabicExplanation": """
عَلَّمَنا النبيُّ صلَّى اللهُ عليه وسلَّم الآدابَ الشَّرعيَّةَ اللازمةَ في مواقِفِ الحياةِ، كما عَلَّمَنا الرحمةَ والرِّفقَ فيما يتطَلَّبُ الشَّفَقةَ.
وفي هذا الحديثِ يَروي أسامةُ بنُ زَيدٍ رَضيَ اللهُ عنهما: أنَّه وسعْدَ بنَ أبي وقَّاصٍ وأُبَيَّ بنَ كَعْبٍ كانوا مع النَّبيِّ صلَّى اللهُ عليه وسلَّم، فأرسَلتْ له ابنتُه، وهي زينبُ رَضيَ اللهُ عنها، تُخبِرُه أنَّ ابنَتها قد حُضِرَت، أي: حضَرتْها الوفاةُ،
 وطلَبتْ مِن النَّبيِّ صلَّى اللهُ عليه وسلَّم أنْ يَحْضُرَ إليهم، فأرسَلَ إليها النَّبيُّ صلَّى اللهُ عليه وسلَّم يَدْعوها أنْ تَصْبِرَ وتَحْتَسِبَ، أي: تَطلُبَ الأجرَ من اللهِ، ولتجعَلَ الوَلَدَ في حسابِ اللهِ راضيةً بقِضائِه. وقال لها: إنَّ للهِ ما أخَذ وما أَعطى، فكلُّ مِنحةٍ يَتَحصَّلُ عليها العبدُ هي مِن اللهِ سُبحانه وتعالَى يُؤتيها مَن يَشاءُ، وكلُّ نِعمةٍ يَسْلُبُها اللهُ مِن العبدِ فهي أيضًا منه، يَنزِعُها ممَّن يَشاءُ، وكلُّ شَيءٍ راجعٌ إليه ومُقدَّرٌ عنْدَه سُبحانه وتعالَى، فلمَّا رأتْ زَيْنبُ ذلك أرسَلتْ إليه تُقسِمُ عليه أنْ يَحضُرَ، فأبَرَّ النَّبيُّ صلَّى اللهُ عليه وسلَّم قَسَمَها وذهَبَ إليها، فلمَّا حضَر رفَعوا له الطِّفلَ ووضَعُوه في حَجْرِه، ونفْسُه تَقَعْقَعُ، أي: تَضطرِبُ وتَتحرَّكُ ويُسمَعُ لها صَوتٌ، ففاضتْ عَينَا النَّبيِّ صلَّى اللهُ عليه وسلَّم بالدَّمعِ رَحمةً بالصَّغير، فلمَّا رَأى ذلك سَعدُ بنُ أبي وقَّاص رَضيَ اللهُ عنه قال للنَّبيِّ صلَّى اللهُ عليه وسلَّم: ما هذا يا رَسولَ اللهِ؟! يَسألُه عن بُكائِه، مُستغرِبًا صُدورَه من النبي صلَّى اللهُ عليه وسلَّم؛ لأنَّه خِلافُ ما يَعهَدُه منه مِن مُقاومةِ المُصيبةِ بالصَّبرِ، فأخْبَرَه النَّبيُّ صلَّى اللهُ عليه وسلَّم أنَّها رَحْمةٌ جَعَلها اللهُ في قُلوبِ الرُّحماءِ، وليس مِن بابِ الجَزَعِ وقِلَّةِ الصَّبر، وأنَّ رحمةَ اللهِ تختَصُّ بمن اتَّصف بالرَّحمةِ وتحقَّق بها، وبكاؤه صلَّى اللهُ عليه وسلَّم يدُلُّ على أنَّ المنهيَّ عنه من البكاءِ ما صَحِبَه النَّوحُ والجَزَعُ وعَدَمُ الصَّبرِ.
وقَولُه: «الرُّحماءُ» جمع رحيمٍ، من صِيَغِ المبالغةِ، ومقتضاه: أنَّ رحمةَ اللهِ تختصُّ بمن اتَّصَف بالرَّحمةِ وتحقَّق بها بخِلافِ من فيه أدنى رحمةٍ، لكن ثبت في حديثِ عبدِ اللهِ بنِ عَمرٍو عند أبي داودَ وغيرِه: «الراحمون يَرحمُهم الرَّحمنُ»، والراحمون جمعُ راحمٍ، فيدخُلُ كُلُّ من فيه أدنى رحمةٍ.
وفي الحَديثِ: الحثُّ على الاحتسابِ والصَّبرِ عند نزولِ المصيبةِ.
وفيه: مشروعيَّةُ استحضارِ أهلِ الفَضلِ والصَّلاحِ عند المحتضَرِ.
وفيه: أَمْرُ صاحِبِ المصيبةِ بالصَّبرِ قبل وقوعِ الموتِ؛ ليقَعَ وهو مستشعِرٌ بالرِّضا، مقاومًا للحُزنِ بالصَّبرِ.
وفيه: تقديمُ السَّلامِ على الكلامِ.

                  """,
    },
    {
      "arabicText": """
عن صهيب رضي الله عنه أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏ "‏ كان ملك فيمن كان قبلكم، وكان له ساحرٌ، فلما كبر قال للملك ‏:‏ إني قد كبرت فابعث إلى غلاماً أعلمه السحر؛ فبعث إليه غلاماً يعلمه، وكان في طريقه إذا سلك راهبٌ، فقعد إليه وسمع كلامه فأعجبه، وكان إذا أتى الساحر مر بالراهب وقعد إليه، فإذا أتى الساحر ضربه، فشكا ذلك إلى الراهب فقال‏:‏ إذا خشيت الساحر فقال‏:‏ حبسني أهلي، وإذا خشيت أهلك فقل‏:‏ حبسني الساحر‏.‏

فبينما هو على ذلك إذ أتى على دابةٍ عظيمةٍ قد حبست الناس فقال‏:‏ اليوم أعلم آلساحر أفضل أم الراهب أفضل‏؟‏ فآخذ حجراً فقال‏:‏ اللهم إن كان أمر الراهب أحب إليك من أمر الساحر فاقتل هذه الدابة حتى يمضي الناس، فرماها فقتلها ومضى الناس، فأتى الراهب فأخبره‏.‏ فقال له الراهب‏:‏ أي بني أنت اليوم أفضل مني، قد بلغ أمرك ما أرى، وإنك ستبتلى، فإن ابتليت فلا تدل علي؛ وكان الغلام يبرئ الأكمه والأبرص، ويداوي الناس من سائر الأدواء‏.‏ فسمع جليس للملك كان قد عمي، فأتاه بهدايا كثيرةٍ فقال‏:‏ ما هاهُنا لك أجمع إن أنت شفيتنى، فقال‏:‏ إني لا أشفي أحداً إنما يشفى الله تعالى، فإن آمنت بالله دعوت الله فشفاك، فآمن بالله تعالى فشفاه الله تعالى، فأتى الملك فجلس إليه كما كان يجلس فقال له الملك‏:‏ من ردّ عليك بصرك‏؟‏ فقال‏:‏ ربي قال‏:‏ ولك رب غيري ‏؟‏‏(‏ قال‏:‏ ربي وربك الله، فأخذه فلم يزل يعذبه حتى دل على الغلام، فجئ بالغلام فقال له الملك‏:‏ أى بني قد بلغ من سحرك ما تبرئ الأكمه والأبرص وتفعل وتفعل فقال‏:‏ إني لا أشفي أحداً، إنما يشفي الله تعالى، فأخذه فلم يزل يعذبه حتى دل على الراهب؛ فجيء بالراهب فقيل له‏:‏ ارجع عن دينك، فأبى ، فدعا بالمنشار فوضع المنشار في مفرق رأسه، فشقه حتى وقع شقاه، ثم جيء بجليس الملك فقيل له‏:‏ ارجع عن دينك فأبى، فوضع المنشار في مفرق رأسه، فشقه به حتى وقع شقاه، ثم جيء بالغلام فقيل له ارجع عن دينك فأبى، فدفعه إلى نفر من أصحابه فقال‏:‏ اذهبوا به إلى جبل كذا وكذا فاصعدوا به الجبل فقال‏:‏ اللهم اكفنيهم بما شئت، فرجف بهم الجبل فسقطوا، وجاء يمشي إلى الملك، فقال له الملك‏:‏ ما فعل أصحابك‏؟‏ فقال‏:‏ كفانيهم الله تعالى، فدفعه إلى نفر من أصحابه فقال ‏:‏ اذهبوا به فاحملوه في قرقور وتوسطوا به البحر، فإن رجع عن دينه وإلا فاقذفوه، فذهبوا به فقال‏:‏ اللهم اكفنيهم بما شئت، فانكفأت بهم السفينة فغرقوا، وجاء يمشي إلى الملك‏.‏ فقال له الملك ‏:‏ ما فعل أصحابك‏؟‏ فقال‏:‏ كفانيهم الله تعالى‏.‏ فقال الملك إنك لست بقاتلي حتى تفعل ما آمرك به‏.‏ قال ‏:‏ ما هو‏؟‏ قال ‏:‏ تجمع الناس في صعيد واحد، وتصلبني على جذع ، ثم خذ سهماً من كنانتي، ثم ضع السهم في كبد القوس ثم قل‏:‏ بسم الله رب الغلام ثم ارمني، فإنك إن فعلت ذلك قتلتني ‏.‏ فجمع الناس في صعيد واحد، وصلبه على جذع، ثم أخذ سهما من كنانته، ثم وضع السهم في كبد القوس، ثم قال‏:‏ بسم الله رب الغلام، ثم رماه فوقع السهم في صدغه، فوضع يده في صدغه فمات‏.‏ فقال الناس آمنا برب الغلام، فأتى الملك فقيل له‏:‏ أرأيت ما كنت تحذر قد والله نزل بك حذرك‏.‏ قد آمن الناس‏.‏ فأمر بالأخدود بأفواه السكك فخدت وأضرم فيها النيران وقال‏:‏ من لم يرجع عن دينه فأقحموه فيها أو قيل له ‏:‏ اقتحم ، ففعلوا حتى جاءت امرأة ومعها صبى لها، فتقاعست ان تقع فيها، فقال لها الغلام‏:‏ يا أماه اصبري فإنك على الحق‏"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏
                  """,
      "arabicExplanation": """

كان النَّبيُّ صلَّى اللهُ عليه وسلَّمَ يَقُصُّ لأصحابِه رَضيَ اللهُ عنهم قَصصَ المؤمنينَ مِن الأُمَمِ السَّابقةِ، وصَبْرَهم على الأذى وشِدَّةِ العذابِ مِن المشْركين والكفَّارِ، وتَحقُّقَ نَصرِ اللهِ لهم، وكلُّ ذلك لِيتأسَّى المسْلِمون بهم ويَصبِروا حتَّى يَرسَخَ الإيمانُ في قُلوبِهم.
وفي هذا الحديثِ يُخبِرُ رسولُ اللهِ صلَّى اللهُ عليه وسلَّمَ أنَّه كان مَلِكٌ مِن مُلوكِ الأُمَمِ السَّابقةِ، «وكان له سَاحِرٌ» يقومُ بأعمالِ العِرافةِ والكِهانةِ والتَّمويهِ على النَّاسِ والتَّخييلِ لهم، على ما كان مَشهورًا في تلكَ الأزمانِ، «فلمَّا كَبِر» ذلك السَّاحرُ في السِّنِّ وتَقدَّمَ به العُمرُ، أخبَرَ الملِكَ أنَّه قدْ كَبِر سِنُّه، ويَخْشى أنْ يَنقطِعَ عِلمُه عنهم بالمرضِ والموتِ، وطلَبَ منه أنْ يُرسِلَ له غُلامًا، وهو الصَّبِيُّ مِن الفِطَامِ إلى البُلوغ، والمرادُ وَلدٌ يُدرِكُ ويَفهَمُ حتَّى يُعلِّمَه السِّحرَ، فبَعَث إليه الملِكُ غُلامًا يُعلِّمُه، وكان في طَريقِ الغُلامِ وهو ذاهبٌ إلى السَّاحِرِ «رَاهِبٌ» وهو المتعبِّدُ مِن النَّصارَى المتخلِّي مِن أشغالِ الدُّنيا التارِكُ لِمَلاذِّها، فلمَّا عَلِم الغلامُ به قَعَد إليه يَسمَعُ مِن كَلامِه ووَعَظَه وما عِنده مِن عِلمٍ عن اللهِ عزَّ وجلَّ، فكان الغُلامُ إذا أراد أنْ يَصِلَ إلى السَّاحِر مرَّ بالراهِب؛ لكونِه في طريقِه، وقَعَد إليه ليَأخُذَ مِن عِلمِه، فإذا أتَى السَّاحِرَ ووَصَل إليه، ضرَبه لِتأخُّرِه عليه، فشَكَا الغلامُ ذلك إلى الرَّاهِبِ، فأمَرَه الرَّاهبُ أنَّه إذا تَأخَّرَ على السَّاحرِ، فلْيَتعذِرْ له أنَّ التَّأخيرَ في حُضورِه بسَببِ أهلِه، وكذلك العكسُ، فلوْ سَألَه أهلُه عن سَببِ تَأخيرِه، فلْيَتعذِرْ لهم بأنَّ السَّاحرَ سَببُ تَأخيرِه، ولعلَّ الرَّاهبَ أمَرَه بذلك -مع أنَّه كذِبٌ- لأنَّه رأى أنَّ المصلحةَ في هذا تَرْبو على مَفسَدةِ الكذبِ.
ويَحتمِلُ أنْ يكونَ ذلك تَوريةً لا كذِبًا؛ والتَّوريةُ في قولِه: «حَبَسَني أهْلي» أبيَنُ وأوضَحُ؛ لأنَّ الأهلَ حَقيقةً إنَّما هُم المرشِدون له إلى السَّعادةِ، فالمقصودُ بلَفظِ الأهلِ الراهبُ، وكذلك قولُه لأهلِه: «حبَسَني السَّاحرُ» يُمكِنُ تَأويلُه على التَّوريةِ بأنَّه لا يَصِلُ إلى أهلِه إلَّا بعْدَ المُكثِ عندَ السَّاحرِ والرَّاهبِ جميعًا، فيَصدُقُ قولُه: «حَبَسَني السَّاحرُ»؛ لأنَّه كان أحدَ الحابسينِ.
«فبَيْنَما هو على ذلك» مُتردِّدًا بيْن أهلِه والسَّاحرِ والرَّاهبِ مدَّةً مِن الزَّمنِ، إذْ خَرَجَت على النَّاسِ «دابَّةٌ عَظيمةٌ» قيل: كانت أسدًا، وقيل: حيَّةٌ (ثُعبانٌ)، فخافوا منها، فمَنَعتْهم مِن الوصولِ لِحوائجِهم، فقال الغلامُ في نفْسِه عِندما رَأى الدَّابَّةَ: اليومَ أَعلَمُ السَّاحِرُ أفضَلُ أمِ الرَّاهِبُ أفضَلُ؟ فيَنكشِفُ لي أيُّهم أنفَعُ اتِّباعًا واقتداءً به، فأمسَكَ الغلامُ بحَجرٍ، ثمَّ دعا اللهَ فقال: «اللَّهُمَّ إنَّ كان أمرُ الرَّاهبِ أحَبَّ إليك مِن أمرِ السَّاحِرِ» يُريدُ أيُّهما الَّذي على حقٍّ؟ «فاقتُلْ هذه الدَّابَّةَ» أي: عَقِبَ وُصولِ الحَجَرِ إليها؛ ليكونَ ذلك آيةً على أَحبِّيَّةِ الرَّاهبِ عندَك، «فرَماها» الغلامُ بالحجرِ «فقَتَلها» بتِلك الرَّمْيَةِ، ومَرَّ النَّاسُ في طَريقِهم، فجاء الغُلامُ إلى الرَّاهبِ، فأخبَرَه بما فعَله بالدَّابَّةِ وبما قاله ودَعا به، «فقال له الرَّاهبُ: أَيْ بُنَيَّ» وهو نِداءُ شَفقةٍ وتَلطُّفٍ به، «أنتَ اليومَ أفضلُ مِنِّي» أي: أعظَمُ دَرَجةً ومَنزِلةً عندَ اللهِ تعالَى «قد بَلَغ مِن أمرِك ما أَرَى» مِن كمالِ اليَقِينِ وصِدْقِ الاعتِقادِ، وما مَنَّ اللهُ به عليه مِن كَراماتٍ ومُعجِزاتٍ، «وإنَّك سَتُبتَلَى» أي: سيَفعَلُ اللهُ بكَ ما جرى مِن سُنَّتِه في أنبيائهِ، وأوليائهِ مِن ابتلائهِم بسُفهاءِ قَومِهم، «فإنِ ابتُلِيتَ فلا تَدُلَّ علَيَّ» خَشيةَ أنْ يَصِلوا إليه، فيَفتِنوه في دِينِه.
وانتَشَر أمرُ الغلامِ في النَّاسِ، وصار يُبْرِئُ الأَكْمَهَ والأَبْرَصَ، أي: جَعَله اللهُ سَببًا في شِفاءِ النَّاسِ، فكان يَدْعو لهم، فيَستجيبُ اللهُ دُعاءَه، والأَكْمَهُ: هو الَّذي وُلِد أَعْمَى، والأَبْرَصُ هو الَّذي ابْيَضَّ جِلْدُ جَسَدِهِ، وأصبَحَ يُداوِي النَّاسَ مِن جميعِ الأمراضِ والأسقامِ، حتَّى سَمِع به «جَلِيسٌ لِلْمَلِك» أحدُ خَواصِّه والمُقرَّبين إليه، وكان قدْ فقَدَ بصَرَه، فأتاه هذا الرَّجلُ بهدايَا كثيرةٍ، وأخبَره بأنَّها كلَّها له إن شَفَاه، فردَّ الغلامُ بأنَّه لا يَشفِي أحدًا، إنَّما الَّذي يَشفِي هو اللهُ عزَّ وجلَّ، «فإنْ آمَنْتَ» وصَدَقْتَ «باللهِ» وبوَحدانيَّتِه تعالَى وأقرَرْتَ برُبوبيَّتِه؛ «دعَوْتُ اللهَ» تعالَى لكَ بالشِّفاءِ، فيكونُ ذلك سَببًا في شِفائِكَ، «فآمَنَ» جَلِيسُ المَلِكِ بالله، فدَعا له الغُلامُ، فشَفاهُ اللهُ مِن العَمى ببرَكةِ الإيمانِ باللهِ تعالَى، فجاء الجَلِيسُ إلى الملِكِ، فجَلَسَ معه على عادتِه إلَّا أنَّه في تلكَ المرَّةِ كان يُبصِرُ، فسَأله المَلِكُ: «مَن ردَّ عليك بَصَرَك؟» أي: عالَجَكَ، قال: «ربِّي» أي: ردَّه ربِّي الَّذي خَلَقَني وربَّاني، «فقال المَلِكُ: وَلَكَ ربٌّ غيري؟!» وهذا ادِّعاءٌ للأُلوهيَّةِ، فردَّ الجليسُ: «ربِّي وربُّك اللهُ» المعبودُ الحقُّ، فأخَذَ الملِكُ جَليسَه، فلم يَزَلْ يُعذِّبُه حتَّى دلَّ وأخبَرَ عن الغلامِ، فأمَر الملِكُ بالغلامِ، فجِيءَ به إليه، فقال له المَلِكُ: «أيْ بُنَيَّ» وهو نِداءُ إشفاقٍ ولُطفٍ، وقيل: تَحقيرٌ وإهانةٌ له، «قدْ بَلَغ مِن سِحْرِكَ» أي: مِن عِلمِك بالسِّحرِ ما استَطعْتَ به أنْ تَشفِيَ المرضى، وخاصَّةً الأمراضَ الَّتي دَواءَ لها، فأجابَه الغلامُ أنَّه لا يَشفِي أحدًا، إنَّما الَّذي يَشْفِي هو اللهُ عزَّ وجلَّ، فأخَذَ المَلِكُ الصَّبيَّ، «فلم يَزَلْ يعذِّبُه» لِيَدُلَّ على مَن علَّمه ما هو فيه «حتَّى دلَّ على الرَّاهِبِ»، فأرسَلَ الملِكُ إلى الرَّاهبِ حتَّى جِيءَ به إلى الملِكِ، «فقِيل له: ارْجِعْ عن دِينِكَ» الَّذي هو التَّوحيدُ، فامتَنَع أشدَّ الامتِناع عن الرُّجوعِ عن دِينِه، «فدَعَا» الملِكُ «بالمِئْشارِ» وهو أداةٌ لِنَشْرِ الخَشَبِ وقَطْعِه، فوَضَعه في «مَفْرِقِ رأسِه» أي: وسَطَ الرَّأسِ، «فشَقَّه به» نِصفينِ طُولًا حتَّى وَقَع جانباه على الأرضِ، «ثُمَّ جِيءَ بجليسِ المَلِك» فحدَثَ معه مِثلُ ما حَدَث مع الرَّاهبِ.
«ثُمَّ جِيءَ بالغُلامِ» ولعلَّ تأخيرَه حتَّى يَرَى ما فُعِل بصاحِبَيْه فيرجِعَ عمَّا هو عليه، «فقيل له: ارجِعْ عن دِينِكَ» الَّذي هو دِينُ التَّوحيدِ، فرَفَض، فدَفَعه الملِكُ إلى نَفَرٍ مِن أَتباعِه وأعوانِه، والنَّفَرُ: الجَماعةُ مِن الرِّجالِ، خاصَّةً ما بيْن الثَّلاثةِ إلى العَشَرةِ، وأمَرَهم أنْ يَصعَدوا به إلى جَبلٍ -حدَّدَه لهم- حتَّى إذا بَلَغوا قِمَّتَه وأعْلى ما فيه، ألْقَوه منه ليَموتَ على الفورِ، «فإنْ رَجَع عن دِينِه» قبْلَ أنْ تُلقُوه فاترُكوه، «وإلَّا فاطْرَحوه»، أي: فأَلْقُوه من أعلى الجبلِ، «فذَهَبوا به فصَعِدوا به الجبلَ» وطَلَبوا منه الرُّجوعَ عن دِينِه، فتَضرَّعَ إلى اللهِ تعالَى، وقال في دُعائِه: «اللَّهُمَّ اكْفِنِيهِمْ» أي: كُنْ دافعًا عنِّي شَرَّهم بالَّذِي شِئتَ من أنواع الكفايةِ مِن مَكرِكَ لهم وحِفظِكَ لي؛ إمَّا بإهلاكِهم أو بغيرِه، «فرَجَف»، أي: تحرَّك واضْطَرَب «بِهم الجبلُ» حَرَكةً شَديدةً «فسَقَطوا» بسببِ اضطرابِه وهَلَكوا، «وجاء» الغلامُ وعاد «يَمْشي إلى المَلِكِ» لِيُرِيَه آيةَ الله تعالَى بنَصْرِ أهلِ دِينِه.
فقال له المَلِكُ: «ما فَعَل أصحابُك؟» والمرادُ بهم جُنودُه الَّذين ذَهَبوا به لِيُلْقُوه، فقال الغلامُ: «كَفانِيهم اللهُ» تعالَى، وحاق بهم سُوءُ فِعلِهم، «فدَفَعه» الملِكُ مرَّةً أُخرى «إلى نَفَرٍ» آخَرِينَ مِن أتباعِه وأعوانِه، فقال: «اذْهَبوا به فاحمِلوه في قُرْقُورٍ» والقُرْقورُ: السَّفِينةُ العَظِيمةُ، «فتوسَّطُوا به البحرَ»، والمرادُ بُلوغُهم أقْصى أعماقِه وبُعدُه على اليابسةِ، حتَّى إذا رَمَوه فيه غَرِقَ ولم يَستطِعِ النَّجاةَ، «فإنْ رَجَع عن دِينِهِ» قبْلَ أنْ تُلقُوه فاتْرُكوه وارْجِعوا به وإنْ لم يَرْجِعْ عنه، فارْمُوه بقُوَّةٍ في البحرِ، «فذَهَبوا به» حتَّى بَلَغوا وَسَطَ البحرِ، فقال الغلامُ: «اللَّهُمَّ اكْفِنِيهِمْ بما شئتَ، فانقَلَبَت بهم السَّفينةُ، فغَرِقوا، وفي رِوايةِ التِّرمذيِّ: «فانْطُلِقَ به إلى البحرِ، فغَرَّقَ اللهُ الَّذين كانوا معه وأنْجاهُ»، وجاء الغلامُ يَمْشي إلى المَلِكِ، وسَأله الملِكُ عن جُنودِه، فأخبَرَه أنَّ اللهَ عزَّ وجلَّ قدْ كَفاهُ شَرَّهم.
ثمَّ أخبَرَ الغلامُ المَلِكَ أنَّه لنْ يَستطيعَ قتْلَه، إلَّا إنْ فَعَلَ ما يَأمُرُه به الغلامُ، فسَألَه المَلِكُ عن هذا الشَّيءِ، فقال الغلامُ للملِكِ: «تَجمَعُ الناسَ في صَعِيدٍ واحدٍ»، أي: في أرضٍ ومَقامٍ واحدٍ، والمرادُ جمعُ النَّاسِ كلِّهم في أرضٍ واحدةٍ، «وتَصلُبُني» مِن الصَّلْبِ، وهو تعليقُ الإنسانِ للقَتْلِ «على جِذْعٍ» عُودٍ مِن أعوادِ الشَّجرِ، مِثلُ النَّخْلِ ونحوِه، «ثُمَّ خُذْ سَهْمًا مِن كِنانَتِي» وهي بَيتُ السِّهامِ وكِيسُه، «ثُمَّ ضَعِ السَّهْمَ في كَبِدِ» أي: وَسَطِ «القَوْسِ» وفي مِقبَضِها «ثُمَّ قُلْ» عندَ الرَّميِ: «بِاسْمِ اللهِ رَبِّ الغُلامِ، ثُمَّ ارْمِني» أي: أطلِقِ السَّهمَ نَحْوي، «فإنَّك إذا فعلتَ ذلك قَتَلْتَنِي»، ففَعل المَلِكُ ما قاله الغُلام ثُمَّ قال: «بِاسْمِ الله ربِّ الغُلامِ» أطلَقَ السَّهمَ عليه، «فوَقَع السهمُ في صُدْغِه» وهو ما بينَ العَيْنِ إلى شَحْمَةِ الأُذُنِ، «فوَضَع» الغلامُ «يدَه في صُدْغِه» لِتَأَلُّمِه مِنَ السَّهمِ «فمات»، فقال الناسُ لَمَّا رَأَوُا الآيةَ العُظمَى الشاهِدَةَ بالوحدانيَّة لله سُبحانَه وتَعالَى: «آمَنَّا برَبِّ الغلامِ آمَنَّا برَبِّ الغُلامِ، آمَنَّا برَبِّ الغُلامِ» ثَلاثًا؛ تَأكيدًا على صِدقِ إيمانِهم.
فجاء إلى الملِكِ أحدُ أتباعهِ وقال له: «أرأيتَ ما كُنتَ تَحْذَرُ؟» وهو خَشيةُ أنْ يُؤمِنَ النَّاسُ بدِينِ الرَّاهبِ والغلامِ وجَليسِ الملِكِ، وهو التَّوحيدُ للهِ تعالَى، «قد واللهِ نَزَلَ بك حَذَرُكَ» وفي رِوايةِ التِّرمذيِّ: «أجَزِعْتَ أنْ خالَفَكَ ثلاثةٌ؟! فهذا العالَمُ كلُّهم قدْ خالَفوكَ» وهو إيمانُ النَّاسِ كلِّهم، فأَمَرَ الملك «بالأُخْدُودِ» وهو الحفرةُ العظيمةُ، «في أَفْوَاهِ السِّكَكِ»، وهي مَداخلُ الطُّرُقِ وأوائلُها، وإنَّما شَقَّ الأُخدودَ على مَداخلِ الطُّرقِ؛ لئلَّا يَتمكَّنَ النَّاسُ مِن الهروبِ، «وأَضْرَم» أي: أشعَلَ وأوقَدَ في الأُخدودِ النِّيرانَ، وأمر الملك جنوده: «مَن لم يَرْجِعْ عن دِينِه» مِن الإيمانِ الَّذي صار إليه «فأَحْمُوه فيها»، أي: أَلْقُوه كُرْهًا فيها، مِن قولِهم: أَحْمَيْتُ الحديدةَ وغيرَها: إذا أَدْخَلْتَها النارَ لِتَحْمَى، أو قِيلَ لِمَنْ لم يَرجِعْ عن دِينِه: «اقْتَحِمْ» أي: النَّارَ فادْخُلْ فيها بإرادتِكَ، «ففَعَلوا» ما أُمِروا به من الأُخدُودِ وما بعدَه، واستَمَرُّوا كذلك «حتَّى جاءتِ امرأةٌ ومَعَها صَبِيٌّ لها» وهو الطِّفلُ الصَّغيرُ في عُمرِ الرَّضاعِ، كما صَرَّح به عندَ النَّسائيِّ في السُّننِ الكُبرى، فتَوقَّفتْ ولَزِمَتْ موضِعَها وكَرِهَتْ أن تَقَعَ به في النَّارِ، فنَطَق رَضيعُها وقال لها: «يا أُمَّاهُ، اصْبِرِي» على هذا العذابِ؛ فإنَّه يَؤُولُ إلى جَزِيل الثَّوابِ؛ «فإنَّكِ على» الدِّينِ «الحَقِّ»، أي: الإيمانِ والتَّوحيدِ.
وفي الحديثِ: إثباتُ كَراماتِ الأولياءِ.
وفيه: نَصْرُ مَن توكَّل على الله سُبحانه وانْتَصَر به وخرَج عن حَوْلِ نفْسِه وقُوَاها.
وفيه: صبرُ الصَّالحين على الابتلاءِ في ذاتِ اللهِ، وما يَلْزَمُهم مِن إظهارِ دِينِه والدُّعاءِ لتوحيدِه.
وفيه: أنَّ اللهَ عزَّ وجلَّ يُجيبُ دَعوةَ المُضطرِّ إذا دَعاه، فإذا دَعا الإنسانُ ربَّه في حالِ ضَرورةٍ مُوقِنًا أنَّ اللهَ يُجيبُه؛ فإنَّ اللهَ تعالَى يُجِيبُه.
وفيه: بَذلُ النَّفسِ في إظهارِ دِينِ اللهِ عزَّ وجلَّ.
وفيه: أهمِّيَّةُ تَربيةِ الأبناءِ، وقَصْدِهم بالعِلمِ في الصِّغرِ.
وفيه: ضَعفُ الملوكِ الجبابرةِ، وعدَمُ نُصحِهم لِرَعاياهم.
وفيه: المؤمنُ لا يُعرِّضُ نفْسَه وإيمانَه للفتنِ إذا كان ممَّن لا يَقْوى عليها.

                  """,
    },
    {
      "arabicText": """
عن أنس رضي الله عنه قال‏:‏ مر النبي صلى الله عليه وسلم بامرأة تبكي عند قبر فقال ‏:‏ ‏"‏اتقي الله واصبري‏"‏ فقالت ‏:‏ إليك عني ، فإنك لم تصب بمصيبتي ‍‍‍‏(‏ ولم تعرفه، فقيل لها ‏:‏ إنه النبي صلى الله عليه وسلم ، فأتت باب النبي صلى الله عليه وسلم، فلم تجد عنده بوابين، فقالت‏:‏ لم أعرفك، فقال‏:‏ ‏"‏إنما الصبر عند الصدمة الأولى‏"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ 
                  """,
      "arabicExplanation": """
كتَبَ اللهُ سُبحانَه وتعالَى على عِبادِه البَلاءَ في أنفُسِهم وأموالِهم وأولادِهم، ووعَدَ الصَّابرينَ على هذا البَلاءِ الأجرَ العظيمَ؛ فقال تعالى: {إِنَّمَا يوُفَّى الصَّابِرُونَ أَجْرَهُمْ بِغَيْرِ حِسَابٍ} [الزمر: 10].
وفي هذا الحديثِ يُخبِرُ التابعيُّ ثابِتٌ البُنانيُّ أنَّه سمع أنَسَ بنَ مالِكٍ رَضِيَ اللهُ عنه يُكَلِّمُ امْرَأَةً مِن أهْلِهِ، وسَأَلَها: تَعْرِفِينَ فُلَانَةَ؟ قالَتْ: نَعَمْ، فأخبرها أنَّه لَمَّا مرَّ النَّبيُّ صلَّى اللهُ عليه وسلَّم على هذه المرأةِ ووجَدَها تَبْكي على القَبرِ لِفقْدِ أحدِ أحبَّائِها، وفي روايةِ مُسلِمٍ: «تبكي على صبيٍّ لها»؛ قال لها ناصحًا: «اتَّقِي اللهَ واصْبِري»، أي: لا تَجزَعِي الجَزَعَ الذى يُحبِطُ الأجرَ، واسْتشعِري الصَّبْرَ على المُصيبةِ بما وعَدَ اللهُ على ذلك؛ ليحصُلَ لك الثَّوابُ، وخافي غَضَبَ اللهِ إن لم تَصْبري، فقالتِ المرأةُ: ابتَعِدْ عنِّي؛ فإنَّك لمْ تُصَبْ بما أُصِبْتُ به، فَجاوزَها النَّبيُّ صلَّى اللهُ عليه وسلَّم ومَضَى في طَريقِه، فعرَّفَها رجُلٌ بأنَّ مَن مَرَّ بها ونصحها بتقوى اللهِ والصَّبرِ على المصيبةِ هو النَّبيُّ صلَّى اللهُ عليه وسلَّم! فقالت: إنها لم تكُنْ تَعرِفُ أنَّه رَسولُ اللهِ صلَّى اللهُ عليه وسلَّم؛ إذ لو عرفَتْه لم تكُنْ لتخاطِبَه بهذا الخِطابِ، ثُمَّ جاءتْ إلى بَيتِه صلَّى اللهُ عليه وسلَّم، فلم تَجِدْ عليه بوَّابًا، وكان صلَّى اللهُ عليه وسلَّم أكثرَ النَّاسِ تَواضعًا؛ لا يَقِفُ على بابِه بوَّابٌ، أو حارسٌ، أو حاجِبٌ يمنعُ النَّاسَ من الدُّخولِ عليه، وفائِدةُ هذه الجُملةِ أنَّ المرأةَ لَمَّا استشعرت خوْفًا وهيبةً في نفسِها، تصَوَّرت أنَّ النَّبيَّ صلَّى اللهُ عليه وسلَّم مِثلُ الملوكِ له حاجِبٌ أو بوَّابٌ يمنعُ النَّاسَ مِن الوصولِ إليه، فوجدت الأمرَ بخلافِ ما تصوَّرَتْه، فلمَّا أتَتْهُ قالتْ له: واللهِ ما عرَفْتُك، وكأنها تعتَذِرُ عن سوءِ قَولِها وسُوءِ رَدِّها عليه، فأخبرها النَّبيُّ صلَّى اللهُ عليه وسلَّم أنَّ الصَّبرَ المحمودَ الذي يُؤجَرُ عليه الإنسانُ يكونُ عندَ صَدمةِ المُصيبةِ الأُولَى وبِدايتِها؛ لأنَّه هو الذي يَشُقُّ ويَعظُمُ تَحمُّلُه ومُجاهدةُ النَّفْسِ عليه، وأمَّا بعْدَ الصَّدمةِ الأُولى ومُرورِ الأيامِ فكلُّ أحدٍ يَصبِرُ ويَنسَى المُصيبةَ.
وفي الحَديثِ: بَيانُ تَواضُعِ النَّبيِّ صلَّى اللهُ عليه وسلَّم.
وفيه: مَوعظةُ المصابِ ونُصحُه عِندَ البُكاءِ على الميِّتِ.
وفيه: رِفقُه صلَّى اللهُ عليه وسلَّم وكريمُ خُلقِه؛ حيثُ لم يَنتهِرِ المرأةَ لَمَّا ردَّتْ عليه قولَه، بل عذَرَها بمُصيبتِها.

                  """,
    },
    {
      "arabicText": """
عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال ‏:‏ ‏ "‏ يقول الله تعالى ‏:‏ ما لعبدي المؤمن عندي جزاء إذا قبضت صفيه من أهل الدنيا ثم احتسبه إلا الجنة‏"‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏
                  """,
      "arabicExplanation": """
الصَّبرُ الجَميلُ على شدائِدِ الدُّنيا وعلى فَقدِ الأحبابِ والأصفياءِ؛ مِن أخلاقِ المُسلِمِ الحَقِّ، وقد جعل اللهُ جزاءَ هذا الصَّبرِ عَظيمًا.
وفي هذا الحديثِ القُدسيِّ يُخبِرُ رَسولُ اللهِ صلَّى اللهُ عليه وسلَّم عن اللهِ عزَّ وجلَّ أنَّه ليس للِعَبْدِ المؤمِنِ عِندَ اللهِ سُبحانَه جَزاءٌ وثَوابٌ وأجرٌ، إذا قبَضَ ونزعَ رُوحَ صَفِيِّه، وهو الحبيبُ المُصافي؛ كالولدِ والأخِ وكلِّ مَن أحَبَّه الإنسانُ، «مِن أهلِ الدُّنيا ثمَّ احتسَبَه»، أي: صبَرَ على ذلك راجيًا الثَّوابَ مِن اللهِ سُبحانَه؛ «إلَّا الجنَّةُ».
وفي الحديث: عِظَمُ أجْرِ المصيبةِ في كلِّ ما يُحِبُّه الإنسانُ مِن أهلِ الدُّنيا.

                  """,
    },
    {
      "arabicText": """
عن عائشة رضي الله عنها أنها سألت رسول الله صلى الله عليه وسلم عن الطاعون، فأخبرها أنه كان عذاباً يبعثه الله تعالى على من يشاء، فجعله الله تعالى رحمة للمؤمنين، فليس من عبد يقع في الطاعون فيمكث في بلده صابراً محتسباً يعلم أنه لا يصيبه إلا ما كتب الله له إلا كان له مثل أجر الشهيد‏"‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏
                  """,
      "arabicExplanation": """
جَعَل اللهُ سُبحانَه وتعالَى أمْرَ المؤمنِ كلَّه له خَيرًا، في السَّراءِ والضَّراءِ؛ فشُكْرُه في السَّرَّاءِ يُوجِبُ له الأجرَ على شُكرِ النِّعمةِ، وصَبْرُه في الضَّرَّاءِ يُوجِبُ له الأجرَ على الصَّبرِ على البلاءِ.
وفي هذا الحديثِ تَسأَلُ أمُّ المؤمنينَ عائشةُ رَضيَ اللهُ عنها النَّبيَّ صلَّى اللهُ عليه وسلَّمَ عن الطَّاعونِ، وهو المَرَضُ المُهلِكُ، وهو عبارةٌ عن خُرَّاجاتٍ وقُروحٍ وأورامٍ رَديئةٍ تَظهَرُ بالجسْمِ، وقيلَ: إنَّ الطَّاعونَ اسمٌ لكُلِّ وَباءٍ عامٍّ يَنتَشِرُ بسُرعةٍ، وقدْ سُمِّيَ طاعونًا لِسُرعةِ قَتْلِه. فبيَّنَ لها النَّبيُّ صلَّى اللهُ عليه وسلَّمَ أنَّ الطَّاعونَ إنَّما هو عَذابٌ يَبعَثُه اللهُ على مَن يَشاءُ مِن الكُفَّارِ والخارجينَ عن طاعتِه، وأنَّ اللهَ عزَّ وجلَّ جَعَلَه رَحمةً للمؤمنينَ إذا وَقَعَ بهم؛ لأنَّه إذا وقَع هذا الوباءُ في بَلَدٍ هو فيه، فصَبَرَ مُحتسِبًا للهِ تعالَى، وهو يعلَمُ أنَّه لا يُصيبُه إلَّا ما كَتَبه اللهُ عليه، فيظَلُّ داخِلَ البلدِ الَّذي وَقَع فيه الطَّاعونُ، ولا يَخرُجُ منه؛ ظنًّا منه أنَّ خُروجَه يُنجِيه مِن قَدَرِ اللهِ المكتوبِ عليه، فمات بالطَّاعونِ؛ فإنَّه يكونُ له مِثلُ أجْرِ شَهيدِ المعركةِ في الآخِرةِ، ولَيستْ لها أحكامُ شَهيدِ المَعرَكةِ في الدُّنيا؛ مِن تَرْكِ تَغسيلِه وتَكفينِه، ودَفْنِه في ثِيابِه التي ماتَ بها.
وفي أحاديثَ أُخرى في الصَّحيحينِ نَهى النَّبيُّ صلَّى اللهُ عليه وسلَّمَ عنِ الخروجِ مِن البلدِ الَّذي يقَعُ فيه الطَّاعونُ أصابَ الإنسانَ أو لم يُصِبْه، وعنِ الدُّخولِ إليه، فقال: «إذا سمِعْتُم به بأرضٍ فلا تَقدَمُوا عليه، وإذا وقَعَ بأرضٍ وأنتم بها فلا تَخرُجوا فِرارًا منه».
قيلَ: سَبَبُ كَونِ المَوتِ بالطَّاعونِ، ونَحوِه مِنَ المَوتِ بالبَطْنِ، أو تَحتَ الهَدْمِ، أوِ الغَرَقِ، وغَيرِها ممَّا جاءَ في الرِّواياتِ؛ شَهادةً: شِدَّةُ هذه المِيتةِ وعَظيمُ الألَمِ فيها، فجَزاهمُ اللهُ على ذلكَ بأنْ جَعَلَ لهم أجْرَ الشُّهَداءِ؛ تَفَضُّلًا منه سُبحانَه وكَرَمًا.
وفي الحديثِ: بَيانُ عِنايةِ اللهِ تعالَى بهذه الأُمَّةِ، حيثُ جَعَل ما عُدَّ عَذابًا لغيرِهم رَحمةً لهم. 
                  """,
    },
    {
      "arabicText": """
عن أنس رضي الله عنه قال‏:‏ سمعت رسول الله صلى الله عليه وسلم يقول ‏:‏ ‏ "‏إن لله عزوجل قال‏:‏ إذا ابتليت عبدي بحبيبتيه فصبر عوضته منهما الجنة‏"‏
(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏
                  """,
      "arabicExplanation": """
نِعمةُ البصَرِ مِن أجَلِّ النِّعمِ على الإنسانِ؛ ولذلك عَظُم ثَوابُ مَن فقَدها وصبَر، وابتَغى الأجرَ في ذلك.
وفي هذا الحَديثِ بُشرَى عَظيمةٌ لكلِّ مُؤمنٍ ابتلاهُ اللهُ عزَّ وجلَّ في بصَرِه؛ فيَروي النَّبيُّ صلَّى اللهُ عليه وسلَّم عن رَبِّ العِزَّةِ أنَّه قال: «إذا ابتَليتُ عَبدي بِحَبِيبَتَيْه»، أي: إذا ابْتَليتُه بعَينَيْه اللَّتينِ هما أحَبُّ حَواسِّه إليه، فذهَبَ عنه نُورُهما، فصَبَر على فِقدانِ بصَرِه مُحتسِبًا الثَّوابَ والأجرَ الذي أَعَدَّهُ اللهُ للصَّابرينَ؛ عوَّضتُه منهما الجنَّةَ.
وقد سمَّى العَينينِ بالمحبوبتينِ؛ لأنَّهما أحَبُّ أعضاءِ الإنسانِ إليه؛ لِمَا يَحصُلُ له بفَقْدِهما مِن الأسَفِ على فَواتِ رُؤيةِ ما يُريدُ رُؤيتَه مِن خيرٍ فيُسَرُّ به، أو شرٍّ فيَجتنِبُه.
وفي الحَديثِ: حَثٌّ لِمن ابتُلِيَ بذَهابِ بَصَرِه أو بفَقدِ جارِحةٍ من جوارِحِه أن يتلقَّى ذلك بالصَّبرِ والشُّكرِ والاحتسابِ، ولِيَرضَ باختبارِ اللهِ له ذلك؛ ليحصُلَ على أفضَلِ العِوَضَينِ وأعظَمِ النِّعَمَتينِ، وهي الجنَّةُ. 
                  """,
    },
    {
      "arabicText": """

                  """,
      "arabicExplanation": """

                  """,
    },
    {
      "arabicText": """

                  """,
      "arabicExplanation": """

                  """,
    },
    {
      "arabicText": """

                  """,
      "arabicExplanation": """

                  """,
    },
    {
      "arabicText": """

                  """,
      "arabicExplanation": """

                  """,
    },
    {
      "arabicText": """

                  """,
      "arabicExplanation": """

                  """,
    },
    {
      "arabicText": """

                  """,
      "arabicExplanation": """

                  """,
    },
    {
      "arabicText": """

                  """,
      "arabicExplanation": """

                  """,
    },
    {
      "arabicText": """

                  """,
      "arabicExplanation": """

                  """,
    },
    {
      "arabicText": """

                  """,
      "arabicExplanation": """

                  """,
    },
    {
      "arabicText": """

                  """,
      "arabicExplanation": """

                  """,
    },
    {
      "arabicText": """

                  """,
      "arabicExplanation": """

                  """,
    },
    {
      "arabicText": """

                  """,
      "arabicExplanation": """

                  """,
    },
    {
      "arabicText": """

                  """,
      "arabicExplanation": """

                  """,
    },
    {
      "arabicText": """

                  """,
      "arabicExplanation": """

                  """,
    },
    {
      "arabicText": """

                  """,
      "arabicExplanation": """

                  """,
    },
    {
      "arabicText": """

                  """,
      "arabicExplanation": """

                  """,
    },
    {
      "arabicText": """

                  """,
      "arabicExplanation": """

                  """,
    },
    {
      "arabicText": """

                  """,
      "arabicExplanation": """

                  """,
    },
    {
      "arabicText": """

                  """,
      "arabicExplanation": """

                  """,
    },
    {
      "arabicText": """

                  """,
      "arabicExplanation": """

                  """,
    },
    {
      "arabicText": """

                  """,
      "arabicExplanation": """

                  """,
    },
    {
      "arabicText": """

                  """,
      "arabicExplanation": """

                  """,
    },
    {
      "arabicText": """

                  """,
      "arabicExplanation": """

                  """,
    },
    {
      "arabicText": """

                  """,
      "arabicExplanation": """

                  """,
    },
    {
      "arabicText": """

                  """,
      "arabicExplanation": """

                  """,
    },
    {
      "arabicText": """

                  """,
      "arabicExplanation": """

                  """,
    },
    {
      "arabicText": """

                  """,
      "arabicExplanation": """

                  """,
    },
    {
      "arabicText": """

                  """,
      "arabicExplanation": """

                  """,
    },
    {
      "arabicText": """

                  """,
      "arabicExplanation": """

                  """,
    },
    {
      "arabicText": """

                  """,
      "arabicExplanation": """

                  """,
    },
    {
      "arabicText": """

                  """,
      "arabicExplanation": """

                  """,
    },
    {
      "arabicText": """

                  """,
      "arabicExplanation": """

                  """,
    },
    {
      "arabicText": """

                  """,
      "arabicExplanation": """

                  """,
    },
    {
      "arabicText": """

                  """,
      "arabicExplanation": """

                  """,
    },
    {
      "arabicText": """

                  """,
      "arabicExplanation": """

                  """,
    },
    {
      "arabicText": """

                  """,
      "arabicExplanation": """

                  """,
    },
    {
      "arabicText": """

                  """,
      "arabicExplanation": """

                  """,
    },
    {
      "arabicText": """

                  """,
      "arabicExplanation": """

                  """,
    },
    {
      "arabicText": """

                  """,
      "arabicExplanation": """

                  """,
    },
    {
      "arabicText": """

                  """,
      "arabicExplanation": """

                  """,
    },
  ]
};
