const List Asma2HosnaData = [
  {
    "name": "الله",
    "text":
        "المعنى: اسم «الله» دال على كونه مألوهاً معبوداً، تألهه الخلائق محبة، وتعظيماً، وخضوعاً وفزعاً إليه في الحوائج والنوائب، وهو الاسم الجامع لمعاني أسماء الله الحسنى. الورود: ورد في القرآن (٢٧٢٤) مرة."
  },
  {
    "name": "الرحمن",
    "text":
        "المعنى: يدل الاسمان على الرحمة الشاملة لجميع الخلائق بإيجادهم وإمدادهم، وعلى الرحمة الخاصة بالمؤمنين في الدنيا والآخرة. الورود: ورد اسم الرحمن (٥٧) مرة، أما اسم الرحيم فورد (١٢٣) مرة."
  },
  {
    "name": "الرحيم",
    "text":
        "المعنى: يدل الاسمان على الرحمة الشاملة لجميع الخلائق بإيجادهم وإمدادهم، وعلى الرحمة الخاصة بالمؤمنين في الدنيا والآخرة. الورود: ورد اسم الرحمن (٥٧) مرة، أما اسم الرحيم فورد (١٢٣) مرة."
  },
  {
    "name": "الملك",
    "text":
        "المعنى: الذي له ملك السماوات والأرض ومن فيهنّ، لا ملك فوقه، ولا شيء إلا دونه، له الملك المطلق، والتصرف في الكون كله، وهو المالك لكل شيء، والمليك دالٌ على عظیم ملکه تعالی. الورود: ورد اسم الملك (٥) مرات، أما اسم المليك فورد مرة واحدة، واسم المالك مرتان."
  },
  {
    "name": "القدوس",
    "text":
        "المعنى: الطاهر من كل عيب، المنزّه المبرّأ من كل شر ونقص، لأنه موصوف بصفات الجلال والكمال. الورود: ورد مرتين في القرآن الكريم."
  },
  {
    "name": "السلام",
    "text":
        "المعنى: الذي سلم من العيوب والنقائص لكماله وكمال صفاته وأفعاله، وهو الذي يؤمِّن الخلائق وحده ويسلّمهم. الورود: ورد مرة واحدة في القرآن."
  },
  {
    "name": "المؤمن",
    "text":
        "المعنى: الذي يصدق نفسه بدلائل توحيده ويصدّق رسله وأتباعهم، وهو الذي يُؤَمِّن عبيده من ظلمه، ويُؤَمِّن عباده المؤمنين بما يشرع لهم من الأحكام، وبما يجدونه في قلوبهم من الطمأنينة والأنس، ويذهب ما يعتريهم من الخوف إذا لجؤوا إليه في الدنيا ويوم الفزع الأكبر. الورود: ورد مرة واحدة في القرآن."
  },
  {
    "name": "المهيمن",
    "text":
        "المعنى: هو القائم على خلقه بأعمالهم وأرزاقهم وآجالهم، يعلم حال خلقه، وهو قادر عليهم، حافظ لهم، محيط بهم.  الورود: ورد مرة واحدة في القرآن."
  },
  {
    "name": "العزيز",
    "text":
        "المعنى: القوي الغالب الجليل رفيع الشأن، قهر جميع المخلوقات، ودانت له وخضعت لقوته. الورود: ورد في القرآن (۹۲) مرة."
  },
  {
    "name": "الجبَّار",
    "text":
        "المعنى: العلي الأعلى القهار، الذي تنفذ مشيئته في خلقه، وهو الرؤوف الجابر للقلوب المنكسرة، وللضعيف العاجز، ولمن لاذ به ولجأ إليه. الورود: ورد مرة واحدة في القرآن."
  },
  {
    "name": "المتكبر",
    "text":
        "المعنى: العظيم ذو الكبرياء، المتعالي عن صفات خلقه، القاهر لعتاتهم، ولا يوصف بهذا الاسم على سبيل المدح سواه سبحانه وتعالى. الورود: ورد مرة واحدة في القرآن."
  },
  {
    "name": "الخالق",
    "text":
        "المعنى: الخالق هو المبدع للخلق المخترع له على غير مثال سابق، والخلاق تدل على كثرة خلق الله تعالى وإيجاده وكماله فيه. الورود: ورد اسم الخالق (۸) مرات، أما اسم الخلاق فورد مرتين."
  },
  {
    "name": "البارئ",
    "text":
        "المعنى: الموجد من العدم، والبرء هو التنفيذ وإبراز ما قدره وقرره إلى الوجود على صفة محددة. الورود: ورد في القرآن (۳) مرات."
  },
  {
    "name": "المصور",
    "text":
        "المعنى: الذي ينفذ ما يريد إيجاده على الصفة التي يريدها، الذي جعل خلقه على الصور التي شاءها بمقتضى حكمته. الورود: ورد مرة واحدة في القرآن. "
  },
  {
    "name": "الغفَّار",
    "text":
        "المعنى: الذي يغفر الذنوب ويتوب على كل من يتوب، الستار لذنوب عباده والمسدل عليهم ثوب عطفه ورأفته، والغفار: دال على كثرة مغفرته. الورود: ورد اسم الغفور (۹۱) مرة، أما اسم الغفار فورد (٥) مرات، واسم غافر الذنب مرة واحدة."
  },
  {
    "name": " القهَّار",
    "text":
        "المعنى: الذي خضعت له الرقاب، وذلت له الجبابرة، وعنت له الوجوه، وقهر كل شيء، ودانت له الخلائق وتواضعت لعظمته وجلاله وكبريائه. الورود: ورد اسم القاهر مرتين، أما اسم القهار فورد (٦) مرات."
  },
  {
    "name": "الوهَّاب",
    "text":
        "المعنى: الذي وسع الخلق جوده، يهبه ما يشاء لمن يشاء، ومن ذلك الهداية والرزق والشفاء. الورود: ورد من القرآن (۳) مرات."
  },
  {
    "name": " الرزَّاق",
    "text":
        "المعنى: المتكفل بالرزق العام لجميع الخلائق، وبرزق خاص بعباده المؤمنين، هو الإيمان به سبحانه والعلم النافع، والرزق الحلال، والرزاق يدل على كثرة رزقه لخلقه. الورود: ورد اسم الرازق (٥) مرات، أما اسم الرزاق فورد مرة واحدة."
  },
  {
    "name": "الفتَّاح",
    "text":
        "المعنى: الحاكم بين عباده، الذي يفتح أبواب الرزق والرحمة لهم، ويفتح المنغلق عليهم من أمورهم وأسبابهم.  الورود: ورد مرة واحدة في القرآن."
  },
  {
    "name": "العليم ",
    "text":
        "المعنى: الذي أحاط علمه بالظواهر والبواطن، والإسرار والإعلان، فلا يخفى عليه شيء من الأشياء، يعلم ما كان وما هو كائن. الورود: ورد اسم العليم (۱٥۷) مرة، أما اسم العالم فورد (۱۳) مرة، واسم علام الغيوب (٤) مرات."
  },
  {
    "name": "القابض",
    "text":
        "المعنى: القابض للأرزاق والأرواح والنفوس، والباسط للأرزاق والرحمة والقلوب، والباسط يديه بالتوبة للمؤمنين، وهذه الأسماء الكريمة من المتقابلات التي لا ينبغي أن يفرد أحدها عن قرينه. الورود: لم يرد هذان الاسمان في القرآن الكريم، ووردا في السنة المطهرة."
  },
  {
    "name": " الباسط",
    "text":
        "المعنى: القابض للأرزاق والأرواح والنفوس، والباسط للأرزاق والرحمة والقلوب، والباسط يديه بالتوبة للمؤمنين، وهذه الأسماء الكريمة من المتقابلات التي لا ينبغي أن يفرد أحدها عن قرينه. الورود: لم يرد هذان الاسمان في القرآن الكريم، ووردا في السنة المطهرة."
  },
  {"name": " الخافض", "text": ""},
  {"name": " الرافع", "text": ""},
  {"name": " المعزُّ", "text": ""},
  {"name": " المذلُّ", "text": ""},
  {
    "name": "السميع",
    "text":
        "المعنى: الذي أحاط سمعه بكل سرّ ونجوى، الذي يسمع أقوال عباده وما ينطق به خلقه، فلا يخفي عليه شيء، وهو السميع الذي يستجيب للسائلين. الورود: ورد في القرآن (٤٥) مرة."
  },
  {
    "name": "البصير",
    "text":
        "المعنى: الذي أحاط بصره بجميع المبصرات مهما خفيت وصغرت، الخبير بالأشياء، المطلع عليها. الورود: ورد في القرآن (٤٢) مرة."
  },
  {
    "name": "الحكم  ",
    "text":
        "المعنى: الذي يحكم بين عباده في الدنيا والآخرة بعدله وقسطه، في شرعه وقدره وجزائه. الورود: ورد اسم الحكم مرة واحدة، أما اسم خير الحاكمين فقد ورد (٥) مرات."
  },
  {"name": " العدل", "text": ""},
  {
    "name": "اللطيف",
    "text":
        "المعنى: الذي أحاط علمه بالأمور الدقيقة، والذي يوصل رحمته وخيره إلى عباده بالطرق الخفية. الورود: ورد في القرآن (۷) مرات."
  },
  {
    "name": "الخبير",
    "text":
        "المعنى: الذي انتهى علمه إلى الإحاطة ببواطن الأشياء وخفاياها كما أحاط بظواهرها. الورود: ورد في القرآن (٤٥) مرة."
  },
  {
    "name": "الحليم",
    "text":
        "المعنى: أنّه عز وجل ذو أناة، لا يعجل على عباده بعقوبتهم على ذنوبهم ويمهلهم كي يُنِيبوا، وهو قادر على مؤاخذتهم. الورود: ورد في القرآن (۱۱) مرة."
  },
  {
    "name": "العظيم",
    "text":
        "المعنى: الجامع لصفات العظمة والجلال والكبرياء، العظيم في ذاته وأسمائه وصفاته، فلا يستحق أحد من الخلق أن يعظَّم كما يعظَّم سبحانه بالقلب واللسان والجوارح. الورود: ورد في القرآن (۹) مرات."
  },
  {
    "name": "الغفور",
    "text":
        "المعنى: الذي يغفر الذنوب ويتوب على كل من يتوب، الستار لذنوب عباده والمسدل عليهم ثوب عطفه ورأفته، والغفار: دال على كثرة مغفرته. الورود: ورد اسم الغفور (۹۱) مرة، أما اسم الغفار فورد (٥) مرات، واسم غافر الذنب مرة واحدة."
  },
  {
    "name": " الشكور",
    "text":
        "المعنى: الذي يشكر اليسير من الطاعة فَيُثيبُ عليه الكثير من الثواب، ويعطي الجزيلَ من النعمة فيرضى باليسير من الشكر. الورود: ورد اسم الشاكر مرتين، أما اسم الشكور فورد (٤) مرات."
  },
  {
    "name": "العليّ",
    "text":
        "المعنى: الذي له العلوّ المطلق من جميع الوجوه، علوّ الذات، وعلوّ القدر والصفات، وعلوّ القهر والغلبة، وهو المتعالي على خلقه، وكل شيء هو تحت قهره وسلطانه. الورود: ورد اسم (العلي) ٨ مرات، أما اسم (الأعلى) فورد مرتين، واسم (المتعال) مرة واحدة."
  },
  {
    "name": "الكبير",
    "text":
        "المعنى: الموصوف بالجلال وكبر الشأن، العظيم في ذاته وصفاته وأفعاله، الذي لا شيء أعظم منه. الورود: ورد في القرآن (٦) مرات."
  },
  {
    "name": " الحفيظ",
    "text":
        "المعنى: الذي يحفظ السماوات والأرض وما فيها ومن فيها، ويحفظ على الخلق أعمالهم، ويحفظ عباده المؤمنين من المهالك والشياطين ومواقعة الذنوب. الورود: ورد اسم الحافظ (۳) مرات، وكذلك اسم الحفيظ ورد (۳) مرات."
  },
  {
    "name": "المُقِيت",
    "text":
        "المعنى: القدير، ومعطي القوت، فالمقيت سبحانه يقدر حاجة الخلائق بعلمه، ثم يسوقها إليهم بقدرته، ليقيتهم بها ويحفظهم. الورود: ورد مرة واحدة في القرآن."
  },
  {
    "name": "الحسيب",
    "text":
        "المعنى: كافي المتوكلين، العليم بعباده، يحفظ أعمالهم ويجازيهم بمقتضى حكمته وعلمه وهو حسب المؤمنين وكافيهم. الورود: ورد في القرآن (۳) مرات."
  },
  {"name": " الجليل", "text": ""},
  {
    "name": "الكريم",
    "text":
        "المعنى: الكريم أي كثير الخير عظيم النفع، الذي يتبرع بالإحسان من غير جزاء، والأكرم : كثير الخير، الذي لا يوازيه كريم.  الورود: ورد اسم الكريم (۳) مرات، أما اسم الأكرم فورد مرة واحدة."
  },
  {
    "name": "الرقيب",
    "text":
        "المعنى: الحافظ الذي لا يغيب عنه شيء، الذي أحاط سمعه بالمسموعات، وبصره بالمبصرات، وأحاط علمه بكل شيء، فلا تخفى عليه خافية.  الورود: ورد في القرآن (۳) مرات."
  },
  {
    "name": "المجيب",
    "text":
        "المعنى: الذي يقابل الدعاء والسؤال بالعطاء والقبول والاستجابة سبحانه وتعالى. الورود: ورد مرة واحدة في القرآن."
  },
  {
    "name": "الواسع",
    "text":
        "المعنى: الذي وسع كل شيء رحمة وعلما، ووسع رزقه جميع خلقه، لا يحصي أحد ثناء عليه. الورود: ورد في القرآن (۹) مرات."
  },
  {
    "name": "الحكيم",
    "text":
        "المعنى: الذي له الحكمة العليا في قدره وشرعه وجزائه يوم القيامة، الذي أحسن كل شيء خلَقه، فلا يخلق شيئاً عبثاً، ولا يشرع ولا يقضي إلا بما فيه حكمة. الورود: ورد في القرآن (۹۱) مرة."
  },
  {
    "name": "الودود",
    "text":
        "المعنى: الذي يحب أنبياءه ورسله وأتباعهم ويحبونه، وهو المحبوب الذي يستحق أن يكون أحب إلى العبد من نفسه وولده وجميع محبوباته. الورود: ورد مرتين في القرآن."
  },
  {
    "name": "المجيد",
    "text":
        "المعنى: واسع صفات الكمال ومتعلقاتها، العظيم وأفعاله عظيمة، واسع الكرم، مجّدَه خلقه لعظمته. الورود: ورد مرتين في القرآن."
  },
  {"name": " الباعث", "text": ""},
  {
    "name": "الشهيد",
    "text":
        "المعنى: الذي لا يغيب عنه شيء، ولا يعزب عنه مثقال ذرة في الأرض ولا في السماء، بل هو مطلع على كل شيء، مشاهد له، عليم بتفاصيله. الورود: ورد في القرآن (۱۸) مرة."
  },
  {
    "name": "الحق",
    "text":
        "المعنى: المتحقق كونه ووجوده، المألوه المعبود بحق، الرب الملك الذي لا شك فيه، الكامل في أفعاله وصفاته، فكلامه حق وقضاؤه حق ووعده حق وشرعه حق. الورود: ورد في القرآن (۱۰) مرات."
  },
  {
    "name": "الوكيل ",
    "text":
        "المعنى: الوكيل هو المتولي لتدبير جميع خلقه المتكفل بأرزاقهم وحاجاتهم، وهو الكافي لمن التجأ إليه، ويتولى أولياءه فييسرهم لليسرى ويجنبهم العسرى ويكفيهم أمورهم، والكفيل يعني الشهيد، ويقال الحافظ، ويقال الضامن.  الورود: ورد اسم الوكيل (١٤) مرة، أما اسم الكفيل فورد مرة واحدة."
  },
  {
    "name": "القوي",
    "text":
        "المعنى: الذي له القوة والقدرة التامة، لا يغلبه غالب ولا يرد قضاءه راد، يَنفُذ أمرُه، ويَمضي قضاؤه في خلقه، ناصرٌ عباده المؤمنين، شديدٌ عقابه لمن كفر بآياته وجحد توحيده. الورود: ورد في القرآن (۹) مرات."
  },
  {
    "name": "المتين",
    "text":
        "المعنى: الشديد القوي الذي لا تنقطع قوته ولا تلحقه في أفعاله مشقة، ولا يمسه تعب. الورود: ورد مرة واحدة في القرآن."
  },
  {
    "name": "الولىّ ",
    "text":
        "المعنى: الولي الناصر، والمتولِّي للأمر والقائم به، والله - جل شأنه - مولى الخلق أجمعين، بمعنى أنه سيدهم ومالكهم وخالقهم ورازقهم، ومعبودهم الحق، ومولى المؤمنين ولاية خاصة محبة وتوفيقا ونصراً.  الورود: ورد اسم الولي (١٥) مرة، أما اسم المولى فورد (۱۲) مرة."
  },
  {
    "name": "الحميد",
    "text":
        "المعنى: المحمود في جميع أفعاله وأقواله، وصفاته وأسمائه، وشرعه وقدَره، يُحمد على كلّ حال، وهو المستحق للحمد والثناء لكمال صفاته ولكثير إحسانه إلى الخلق. الورود: ورد في القرآن (۱۷) مرة."
  },
  {"name": " المحصى", "text": ""},
  {"name": " المبدى", "text": ""},
  {"name": " المُعيد", "text": ""},
  {"name": " المحيى", "text": ""},
  {"name": " المميت", "text": ""},
  {
    "name": "الحيُّ",
    "text":
        "المعنى: الذي لا يموت، وحياته - سبحانه - أكمل الحياة، تستلزم جميع صفات الكمال، وتنفي أضدادها من جميع الوجوه، وكمال حياته يستلزم أن لا تأخذه سنة ولانوم. الورود: ورد في القرآن (٥) مرات."
  },
  {
    "name": "القيوم",
    "text":
        "المعنى: الذي قام بنفسه فلم يحتج إلى أحد، وقام كل شيء به، فكل ما سواه محتاج إليه بالذات. الورود: ورد في القرآن (۳) مرات."
  },
  {"name": " الواجد", "text": ""},
  {"name": " الماجد", "text": ""},
  {
    "name": "الواحد",
    "text":
        "المعنى: الفرد الذي لم يزل وحده ولم يكن معه آخر، المتفرد في ذاته، وصفاته وأفعاله، وربوبيته وإلهيته، المستحق للعبادة وحده. الورود: ورد اسم الواحد (۲۲) مرة، أما اسم الأحد فورد مرة واحدة."
  },
  {
    "name": "الصمد",
    "text":
        "المعنى: السيد الكامل السؤدد، الذي يقصده الخلق ويصمدون إليه في حوائجهم وما ينزل بهم، وتقصده القلوب بالرغبة والرهبة. الورود: ورد مرة واحدة في القرآن."
  },
  {
    "name": "القادر",
    "text":
        "المعنى: القادر على كل شيء أراده، فلا يُعجزه شيء في الأرض ولا في السماء، والمقتدر مبالغة في الوصف بالقدرة، والقدير كامل القدرة. الورود: ورد اسم القادر (۱۲) مرة، أما اسم القدير فورد (٤٥) مرة، واسم المقتدر (٤) مرات."
  },
  {
    "name": "المُقتَدِر",
    "text":
        "المعنى: القادر على كل شيء أراده، فلا يُعجزه شيء في الأرض ولا في السماء، والمقتدر مبالغة في الوصف بالقدرة، والقدير كامل القدرة. الورود: ورد اسم القادر (۱۲) مرة، أما اسم القدير فورد (٤٥) مرة، واسم المقتدر (٤) مرات."
  },
  {
    "name": "المقدم المؤخر",
    "text":
        "المعنى: المنزل للأشياء منازلها، يقدم ما شاء منها ويؤخر ما شاء بحكمته وعدله، قدر المقادير قبل أن يخلق الخلق، وقدم من شاء بالتوفيق إلى مقامات السابقين، وأخر من شاء بحكمته وعدله، لا مقدم لما أخر ولا مؤخر لما قدَّم. الورود: لم يردا في القرآن الكريم، ووردا في السنة المطهرة."
  },
  {
    "name": "الأول",
    "text":
        "المعنى: الأول: الذي ليس قبله شيء، وكل ما سواه كائن بعد أن لم يكن، والآخر: الباقي، الذي لا انتهاء لوجوده، وليس بعده شيء. الورود: ورد الاسمان مرة واحدة في القرآن الكريم."
  },
  {
    "name": "الآخر",
    "text":
        "المعنى: الأول: الذي ليس قبله شيء، وكل ما سواه كائن بعد أن لم يكن، والآخر: الباقي، الذي لا انتهاء لوجوده، وليس بعده شيء. الورود: ورد الاسمان مرة واحدة في القرآن الكريم."
  },
  {
    "name": "الظاهر",
    "text":
        "المعنى: الظاهر على كل شيء، والعالي فوق كل شيء، فلا شيء أعلى منه، والباطن الأقرب إلى جميع الأشياء باطلاعه على السرائر والخفايا ودقائق الأشياء، فليس دونه شيء. الورود: ورد الاسمان مرة واحدة في القرآن الكريم."
  },
  {
    "name": "الباطن",
    "text":
        "المعنى: الظاهر على كل شيء، والعالي فوق كل شيء، فلا شيء أعلى منه، والباطن الأقرب إلى جميع الأشياء باطلاعه على السرائر والخفايا ودقائق الأشياء، فليس دونه شيء. الورود: ورد الاسمان مرة واحدة في القرآن الكريم."
  },
  {"name": " الوالى", "text": ""},
  {"name": " المُتعال", "text": ""},
  {
    "name": "البرُّ",
    "text":
        "المعنى: مسبغ النعم الظاهرة والباطنة، فلا يستغني مخلوق عن إحسانه وبره طرفة عين، يضاعف ثواب المحسن من المسلمين، ويصفح ويتجاوز عن المسيء منهم، وهو الصادق في وعده. الورود: ورد مرة واحدة في القرآن."
  },
  {
    "name": "التوّاب",
    "text":
        "المعنى: هو الذي يرزق من شاء الإنابة والتوبة إليه، والإقبال عليه بعد المعصية، ويقبل ذلك منهم ويعفو ويصفح. الورود: ورد في القرآن (۱۱) مرة."
  },
  {"name": " المُنتقم", "text": ""},
  {
    "name": "العفو",
    "text":
        "المعنى: الذي يصفح عن الذنوب، ويتجاوز عنها، وهو الذي له العفو الشامل الذي وسع ما يصدر من عباده من الذنوب، ولا سيما إذا أتوا بما يوجب العفو من توحيد خالص أو توبة أو استغفار أو عمل صالح. الورود: ورد في القرآن (٥) مرات."
  },
  {
    "name": "الرؤوف",
    "text":
        "المعنى: ذو الرأفة، وهي أعلى معاني الرحمة، والرأفة عامة لجميع الخلق ولبعضهم في الآخرة. الورود: ورد في القرآن (۱۰) مرات."
  },
  {"name": " المقسط", "text": ""},
  {"name": "الجامع", "text": ""},
  {
    "name": "الغني",
    "text":
        "المعنى: الغني بذاته، الذي لا يحتاج إلى أحد في شيء، وكل أحد محتاج وفقير إليه. الورود: ورد في القرآن (١٨) مرة."
  },
  {"name": "المُغنى", "text": ""},
  {"name": "المانع", "text": ""},
  {"name": "النافع و الضار", "text": ""},
  {
    "name": "الرب",
    "text":
        "المعنى: الخالق المالك المدبر، المربي جميع خلقه بنعمه، ويربي أولياءه بما يصلح قلوبهم، ولا يجوز إطلاق اسم الرب على غير الله تعالى إلا مضافاً، کرب الأسرة. الورود: ورد في القرآن (۹۰۰) مرة."
  },
  {
    "name": "الوارث",
    "text":
        "المعنى: الباقي بعد فناء الخلق والمسترد أملاكهم وموارثهم بعد موتهم، ولم يزل الله باقياً مالكاً للأشياء كلها يورثها من يشاء، ويستخلف فيها من أحب. الورود: ورد في القرآن (۳) مرات."
  },
  {
    "name": "النصير ",
    "text":
        "المعنى: الذي ينصر من يشاء من عباده المؤمنين، ولا غالب لمن نصره، ولا ناصر لمن خذله. الورود: ورد اسم النصير (٤) مرات، أما اسم خير الناصرين فورد مرة واحدة."
  },
  {
    "name": "الكافي",
    "text":
        "المعنى: كفايته سبحانه لجميع عباده في رزقهم وتدبير أمورهم وإصلاح شؤونهم، وكفايته لأوليائه المؤمنين برعايتهم وتأييدهم. الورود: ورد مرة واحدة في القرآن."
  },
  {
    "name": "المبين",
    "text":
        "المعنى: البين أمره في وجوده ووحدانيته، بظهور الأدلة عليها، وهو الذي يظهر الحق للخلق ويبينه لهم. الورود: ورد مرة واحدة في القرآن."
  },
  {
    "name": "الهادي",
    "text":
        "المعنى: الذي ألهم الخلق معرفته وربوبيته، وأرشدهم إلى مصالحهم، وكسب أرزاقهم، وهو الذي دل الخلق على طريق الخير والشر، ووفق من شاء منهم إلى صراطه المستقيم هداية التوفيق والإلهام. الورود: ورد مرتين في القرآن."
  },
  {
    "name": "القريب",
    "text":
        "المعنى: القريب من كل أحد بعلمه، وإحاطته، والقريب من عابديه، وسائليه ومحبيه بالنصر والتأييد، وإجابة دعوتهم. الورود: ورد في القرآن (۳) مرات."
  },
  {
    "name": "المحيط",
    "text":
        "المعنى: الذي لا يغيب عنه علم شيء، وأحاط بكل شيء علماً، وأحصى كل شيء عدداً. الورود: ورد في القرآن (۸) مرات."
  },
  {
    "name": "الرفيق",
    "text":
        "المعنى: الرفيق في خَلقه وشرعه وجزائه، خلق الخلق وشرع الأحكام بالتدريج شيئاً فشيئاً بحسب حكمته، وعلى وجه السعة واليسر ومناسبة العباد، وهو الذي يعامل العباد بالرفق واللين. الورود: لم يرد هذا الاسم في القرآن الكريم، وورد في السنة المطهرة."
  },
  {
    "name": "المنان",
    "text":
        "المعنى: الذي يجود بالنوال قبل السؤال، يمن على عباده بإحسانه وإنعامه عليهم، وعلى أوليائه بالهداية والتوفيق والإيمان. الورود: لم يرد هذا الاسم في القرآن الكريم ، وورد في السنة المطهرة."
  },
  {
    "name": "الجواد",
    "text":
        "المعنى: الذي عم بعطائه جميع المخلوقات، وملأها من فضله وكرمه، ونعمه المتنوعة، وخص عباده المؤمنين بأنواع من الجود في الدنيا والآخرة. الورود: لم يرد هذا الاسم في القرآن الكريم، وورد في السنة المطهرة."
  },
  {
    "name": "المحسن",
    "text":
        "المعنى: المتفضل الذي يعطي النعم الكثيرة التي لا تحصى، وهو الذي أحسن كل شيء خلقه بالإيجاد والإمداد، والهداية. الورود: لم يرد هذا الاسم في القرآن الكريم، وورد في السنة المطهرة."
  },
  {
    "name": "الستير",
    "text":
        "المعنى: ساتر يستر على عباده كثيراً ولا يفضحهم في المشاهد، كذلك يحب من عباده الستر على أنفسهم واجتناب ما يشينهم. الورود: لم يرد هذا الاسم في القرآن الكريم، وورد في السنة المطهرة."
  },
  {
    "name": "الديان",
    "text":
        "المعنى: الحاكم القاضي الذي يجازي الناس بأعمالهم. الورود: لم يرد في القرآن الكريم، وورد في السنة المطهرة."
  },
  {
    "name": "الشافي",
    "text":
        "المعنى: العالم حقاً بأمراض الأبدان والقلوب وأدويتها، والقادر على إزالتها وحده، لا شفاء إلا شفاؤه، لا يكشف الضر إلا هو -سبحانه-، وشريعته شفاء للبشرية وعلاج لها. الورود: لم يرد في القرآن الكريم، وورد في السنة المطهرة."
  },
  {
    "name": "السيد",
    "text":
        "المعنى: مالك الخلق، والخلق كلهم عبيده؛ الذي إليه يرجعون، وبأمره يعملون، وعن قوله يصدرون. الورود: لم يرد هذا الاسم في القرآن الكريم، وورد في السنة المطهرة."
  },
  {
    "name": "الوتر",
    "text":
        "المعنى: الواحد الفرد الذي لا شريك له ولا نظير. الورود: لم يرد هذا الاسم في القرآن الكريم، وورد في السنة المطهرة."
  },
  {
    "name": "الحيي",
    "text":
        "المعنى: حياؤه تعالی وصفٌ يليق به، ليس كحياء المخلوقين، بل هو حياء كرم وبرّ، وجود وجلال. الورود: لم يرد هذا الاسم في القرآن الكريم، وورد في السنة المطهرة."
  },
  {
    "name": "الطيب",
    "text":
        "المعنى: المنزه عن النقائص، فهو طيب وأفعاله طيبة، وصفاته أطيب الصفات، وأسماؤه أطيب الأسماء، يحب الطيبين، ولا يقبل إلا طيباً. الورود: لم يرد هذا الاسم في القرآن الكريم، وورد في السنة المطهرة."
  },
  {
    "name": "المُعطي",
    "text":
        "المعنى: الله سبحانه هو المعطي على الحقيقة، لا مانع لما أعطى ولا معطي لما منع، وعطاؤه سبحانه واسع ليس له حدود ولا قيود. الورود: لم يرد هذا الاسم في القرآن الكريم، وورد في السنة المطهرة."
  },
  {
    "name": "الجميل",
    "text":
        "المعنى: من له نعوت الحسن والإحسان؛ الجميل في ذاته، وأسماؤه وصفاته وأفعاله كلها جميلة. الورود: لم يرد هذا الاسم في القرآن الكريم، وورد في السنة المطهرة."
  }
];
