List<String> dailyDuas = [
  "اللَّهُمَّ إني أسألُكَ الهُدَى والتُّقَى والعَفَافَ والغِنَى.",
  "اللَّهُمَّ مُصَرِّفَ القلوبِ صَرِّفْ قلوبنا على طَاعَتِكَ.",
  "اللَّهُمَّ اجعلْ لي في قلبي نوراً، وفي لساني نوراً، وفي سمعي نوراً، وفي بصرِي نوراً.",
  "اللَّهُمَّ إني أعوذُ بكَ منَ العجزِ والكسلِ.",
  "اللَّهُمَّ إني أعوذُ بكَ منْ زَوالِ نعمتِكَ وتحَول عافِيَتِكَ.",
  "اللَّهُمَّ إني أعوذُ بكَ منْ جهدِ البلاءِ وسوءِ القضاءِ.",
  "اللَّهُمَّ إني أعوذُ بكَ منْ علمٍ لا ينفَعُ، ومنْ قلبٍ لا يخشَعُ.",
  "اللَّهُمَّ إني أسألكَ منَ الخيرِ كلهِ عاجلهِ وآجلهِ.",
  "اللَّهُمَّ إني أعوذُ برضَاكَ منْ سَخَطِكَ.",
  "اللَّهُمَّ لكَ أسلَمْتُ وبكَ آمَنْتُ، وعلَيكَ توكلتُ وإليكَ أَنَبْتُ."
];
